/** @noSelfInFile */

import {
  应用剧情电影镜头,
  进入剧情电影模式,
  type 剧情镜头预设参数,
} from "../../00．剧情系统核心工具/12．剧情电影镜头";

export const 第三章电影镜头预设表: Record<number, 剧情镜头预设参数> = {
  41: { X: 19430.74, Y: -7947.24, 高度偏移: 40, 旋转角度: 90, 攻角: 344, 距离到目标: 2523.08, 滚动角度: 0, 观察区域: 50, 远景剪裁: 7000 },
  42: { X: 28676.21, Y: -3994.94, 高度偏移: 100, 旋转角度: 90, 攻角: 344, 距离到目标: 2523.08, 滚动角度: 0, 观察区域: 50, 远景剪裁: 7000 },
  43: { X: 15521.01, Y: -4025.45, 高度偏移: 150, 旋转角度: 10, 攻角: 344, 距离到目标: 3200, 滚动角度: 0, 观察区域: 70, 远景剪裁: 7000 },
  46: { X: 8435.27, Y: -14704.1, 高度偏移: 50, 旋转角度: 90, 攻角: 350, 距离到目标: 3000, 滚动角度: 0, 观察区域: 70, 远景剪裁: 6000 },
  48: { X: 1265.97, Y: -9787.9, 高度偏移: 800, 旋转角度: 130, 攻角: 330, 距离到目标: 5000, 滚动角度: 0, 观察区域: 65, 远景剪裁: 8500 },
  50: { X: 1265.97, Y: -9787.9, 高度偏移: 400, 旋转角度: 130, 攻角: 350, 距离到目标: 2500, 滚动角度: 0, 观察区域: 55, 远景剪裁: 8500 },
};

export function 应用第三章电影镜头(this: void, 节点: number): void {
  const 预设 = 第三章电影镜头预设表[节点];
  if (预设 == null) return;
  进入剧情电影模式();
  应用剧情电影镜头(预设, 0);
}
