/** @noSelfInFile */

export {
  测试二维点 as Boss测试二维点,
  测试XY点 as Boss测试XY点,
  测试矩形配置 as Boss测试矩形配置,
  测试坐标平移映射 as Boss测试坐标映射,
  创建测试中心平移映射 as 创建Boss测试坐标映射,
  创建测试中心平移映射 as 创建中心平移映射,
  按测试映射平移坐标 as 映射Boss测试二维点,
  按测试映射平移坐标 as 按映射平移坐标,
  按测试映射平移XY坐标 as 映射Boss测试XY点,
  按测试映射平移XY坐标 as 按映射平移XY坐标,
  按测试映射平移矩形 as 映射Boss测试矩形,
  按测试映射平移矩形 as 按映射平移矩形,
  根据测试中心平移坐标 as 根据中心平移坐标,
  根据测试中心平移XY坐标 as 根据中心平移XY坐标,
  根据测试中心平移矩形 as 根据中心平移矩形,
  复制平移测试坐标数组 as 复制映射Boss测试二维点数组,
  复制平移测试矩形数组 as 复制映射Boss测试矩形数组,
} from "../00．测试系统辅助函数";
