--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____02_FF0E_653B_51FB_6548_679C_6CE8_518C_8868 = require("系统.02．物品系统.15．装备技能.08．攻击效果.00．公共.02．攻击效果注册表")
local _____6CE8_518C_653B_51FB_6548_679C_914D_7F6E = ____02_FF0E_653B_51FB_6548_679C_6CE8_518C_8868["注册攻击效果配置"]
local ____01_FF0E_653B_51FB_6548_679C_5DE5_5177 = require("系统.02．物品系统.15．装备技能.08．攻击效果.00．公共.01．攻击效果工具")
local _____53D6_653B_51FB_529B = ____01_FF0E_653B_51FB_6548_679C_5DE5_5177["取攻击力"]
local ____require_result_0 = require("系统.03．技能系统.00．技能模板+函数.01．技能函数.19．拓展效果.01．debuff.03．燃烧")
local _____65BD_52A0_71C3_70E7_6548_679C = ____require_result_0["施加燃烧效果"]
local function _____6267_884C_70BD_70ED_4E4B_5F39_77E2_71C3_70E7(_____4E0A_4E0B_6587)
    _____65BD_52A0_71C3_70E7_6548_679C(
        _____4E0A_4E0B_6587.source,
        _____4E0A_4E0B_6587.target,
        {
            ["持续模式"] = "刷新",
            ["持续时间"] = 3,
            ["每秒伤害"] = 100 + _____53D6_653B_51FB_529B(_____4E0A_4E0B_6587.source) * 0.2,
            ["伤害来源名称"] = "炽热之弹矢"
        }
    )
end
_____6CE8_518C_653B_51FB_6548_679C_914D_7F6E({
    ["装备名"] = "炽热之弹矢",
    ["触发侧"] = "攻击者",
    ["效果类型"] = "持续伤害",
    ["仅普通攻击"] = true,
    ["攻击者类型"] = "远程",
    ["自定义执行"] = _____6267_884C_70BD_70ED_4E4B_5F39_77E2_71C3_70E7
})
return ____exports
