--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____02_FF0E_653B_51FB_6548_679C_6CE8_518C_8868 = require("系统.02．物品系统.15．装备技能.08．攻击效果.00．公共.02．攻击效果注册表")
local _____6CE8_518C_653B_51FB_6548_679C_914D_7F6E = ____02_FF0E_653B_51FB_6548_679C_6CE8_518C_8868["注册攻击效果配置"]
local ____01_FF0E_653B_51FB_6548_679C_5DE5_5177 = require("系统.02．物品系统.15．装备技能.08．攻击效果.00．公共.01．攻击效果工具")
local _____653B_51FB_6548_679C_9020_6210_4F24_5BB3 = ____01_FF0E_653B_51FB_6548_679C_5DE5_5177["攻击效果造成伤害"]
local ____22_FF0E_5E78_8FD0_503C = require("系统.03．技能系统.00．技能模板+函数.01．技能函数.22．幸运值.index")
local _____88C5_5907_89E6_53D1_6982_7387_901A_8FC7 = ____22_FF0E_5E78_8FD0_503C["装备触发概率通过"]
local ____require_result_0 = require("系统.03．技能系统.00．技能模板+函数.01．技能函数.10．跳链.治疗波跳链")
local _____53D1_8D77_6CBB_7597_6CE2_8DF3_94FE = ____require_result_0["发起治疗波跳链"]
local function _____6267_884C_6DEC_8840_6218_5203_6548_679C(_____4E0A_4E0B_6587)
    _____653B_51FB_6548_679C_9020_6210_4F24_5BB3(_____4E0A_4E0B_6587.source, _____4E0A_4E0B_6587.target, 500, "火焰")
    if not _____88C5_5907_89E6_53D1_6982_7387_901A_8FC7(0.1, _____4E0A_4E0B_6587.source) then
        return
    end
    _____53D1_8D77_6CBB_7597_6CE2_8DF3_94FE({
        ["起始目标"] = _____4E0A_4E0B_6587.source,
        ["来源单位"] = _____4E0A_4E0B_6587.source,
        ["最大跳数"] = 3,
        ["初始治疗量"] = 2000,
        ["每跳衰减系数"] = 0,
        ["影响目标"] = "友方"
    })
end
_____6CE8_518C_653B_51FB_6548_679C_914D_7F6E({
    ["装备名"] = "淬血战刃",
    ["触发侧"] = "攻击者",
    ["效果类型"] = "额外伤害",
    ["仅普通攻击"] = true,
    ["自定义执行"] = _____6267_884C_6DEC_8840_6218_5203_6548_679C
})
return ____exports
