--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____20_FF0E_7269_54C1_8F85_52A9 = require("系统.03．技能系统.00．技能模板+函数.01．技能函数.20．物品辅助.index")
local _____8BFB_53D6_73A9_5BB6_66B4_51FB_7387 = ____20_FF0E_7269_54C1_8F85_52A9["读取玩家暴击率"]
local ____02_FF0E_653B_51FB_6548_679C_6CE8_518C_8868 = require("系统.02．物品系统.15．装备技能.08．攻击效果.00．公共.02．攻击效果注册表")
local _____6CE8_518C_653B_51FB_6548_679C_914D_7F6E = ____02_FF0E_653B_51FB_6548_679C_6CE8_518C_8868["注册攻击效果配置"]
local function _____8BA1_7B97_677F_5B50_950B_5203_89E6_53D1_6982_7387(ctx)
    return 0.06 + _____8BFB_53D6_73A9_5BB6_66B4_51FB_7387(ctx.source) / 2
end
_____6CE8_518C_653B_51FB_6548_679C_914D_7F6E({
    ["装备名"] = "双翼恶魔之利刃",
    ["触发侧"] = "攻击者",
    ["效果类型"] = "额外伤害",
    ["仅普通攻击"] = true,
    ["攻击者类型"] = "近战",
    ["攻击系数"] = 3,
    ["概率计算"] = _____8BA1_7B97_677F_5B50_950B_5203_89E6_53D1_6982_7387,
    ["伤害类型"] = "物理"
})
return ____exports
