--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____01_FF0E_653B_51FB_6548_679C_5DE5_5177 = require("系统.02．物品系统.15．装备技能.08．攻击效果.00．公共.01．攻击效果工具")
local _____5355_4F4D_662F_7CBE_82F1_76EE_6807 = ____01_FF0E_653B_51FB_6548_679C_5DE5_5177["单位是精英目标"]
local ____02_FF0E_653B_51FB_6548_679C_6CE8_518C_8868 = require("系统.02．物品系统.15．装备技能.08．攻击效果.00．公共.02．攻击效果注册表")
local _____6CE8_518C_653B_51FB_6548_679C_914D_7F6E = ____02_FF0E_653B_51FB_6548_679C_6CE8_518C_8868["注册攻击效果配置"]
local function _____8BA1_7B97_745F_5C14_4E4B_5F13_751F_547D_7CFB_6570(ctx)
    return _____5355_4F4D_662F_7CBE_82F1_76EE_6807(ctx.target) and 0.01 or 0.05
end
_____6CE8_518C_653B_51FB_6548_679C_914D_7F6E({
    ["装备名"] = "瑟尔之弓",
    ["触发侧"] = "攻击者",
    ["效果类型"] = "额外伤害",
    ["攻击者类型"] = "远程",
    ["最小距离"] = 400,
    ["生命系数计算"] = _____8BA1_7B97_745F_5C14_4E4B_5F13_751F_547D_7CFB_6570,
    ["伤害类型"] = "物理"
})
return ____exports
