--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____01_FF0E_7269_54C1_4F7F_7528_914D_7F6E_8868 = require("系统.02．物品系统.15．装备技能.05．物品使用.00．公共.01．物品使用配置表")
local _____7269_54C1_4F7F_7528_88C5_5907ID = ____01_FF0E_7269_54C1_4F7F_7528_914D_7F6E_8868["物品使用装备ID"]
local _____7269_54C1_4F7F_7528_6570_503C_914D_7F6E = ____01_FF0E_7269_54C1_4F7F_7528_914D_7F6E_8868["物品使用数值配置"]
local ____02_FF0E_7269_54C1_4F7F_7528_5DE5_5177 = require("系统.02．物品系统.15．装备技能.05．物品使用.00．公共.02．物品使用工具")
local _____662F_5426_4E3A_4F7F_7528_7269_54C1 = ____02_FF0E_7269_54C1_4F7F_7528_5DE5_5177["是否为使用物品"]
local ____07_FF0E_88C5_5907_8F85_52A9 = require("系统.03．技能系统.00．技能模板+函数.01．技能函数.20．物品辅助.07．装备辅助")
local _____53D6_88C5_5907_51B7_5374_952E = ____07_FF0E_88C5_5907_8F85_52A9["取装备冷却键"]
local _____88C5_5907_51B7_5374_4E2D = ____07_FF0E_88C5_5907_8F85_52A9["装备冷却中"]
local _____8FDB_5165_88C5_5907_51B7_5374_5E76_663E_793A = ____07_FF0E_88C5_5907_8F85_52A9["进入装备冷却并显示"]
local ____require_result_0 = require("系统.03．技能系统.00．技能模板+函数.01．技能函数.07．护盾")
local _____5F00_59CB_5C5E_6027_62A4_76FE = ____require_result_0["开始属性护盾"]
local _____6297_6BD2_836F_6C34ID = _____7269_54C1_4F7F_7528_88C5_5907ID["抗毒药水"]
local _____6297_6BD2_836F_6C34_914D_7F6E = _____7269_54C1_4F7F_7528_6570_503C_914D_7F6E["抗毒药水"]
____exports["处理抗毒药水使用"] = function(ctx)
    if not _____662F_5426_4E3A_4F7F_7528_7269_54C1(ctx["物品"], _____6297_6BD2_836F_6C34ID) then
        return
    end
    local unit = ctx["施法单位"]
    local _____51B7_5374_952E = _____53D6_88C5_5907_51B7_5374_952E(unit, "抗毒药水", "物品使用")
    if _____88C5_5907_51B7_5374_4E2D(_____51B7_5374_952E) then
        return
    end
    _____8FDB_5165_88C5_5907_51B7_5374_5E76_663E_793A(_____51B7_5374_952E, _____6297_6BD2_836F_6C34_914D_7F6E["冷却毫秒"] / 1000, unit, "抗毒药水")
    _____5F00_59CB_5C5E_6027_62A4_76FE(unit, "毒", {
        ["数值"] = _____6297_6BD2_836F_6C34_914D_7F6E["护盾值"],
        ["持续时间"] = _____6297_6BD2_836F_6C34_914D_7F6E["持续时间"],
        ["来源单位"] = unit,
        ["显示护盾条"] = true,
        ["可驱散"] = false,
        ["标签"] = "物品:抗毒药水"
    })
end
return ____exports
