--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____07_FF0E_88C5_5907_8F85_52A9 = require("系统.03．技能系统.00．技能模板+函数.01．技能函数.20．物品辅助.07．装备辅助")
local _____9020_6210_88C5_5907_4F24_5BB3 = ____07_FF0E_88C5_5907_8F85_52A9["造成装备伤害"]
local _____6062_590D_751F_547D_9B54_6CD5 = ____07_FF0E_88C5_5907_8F85_52A9["恢复生命魔法"]
local _____64AD_653E_70B9_7279_6548 = ____07_FF0E_88C5_5907_8F85_52A9["播放点特效"]
local _____53D6_5355_4F4DX = ____07_FF0E_88C5_5907_8F85_52A9["取单位X"]
local _____53D6_5355_4F4DY = ____07_FF0E_88C5_5907_8F85_52A9["取单位Y"]
local _____53D6_653B_51FB_529B = ____07_FF0E_88C5_5907_8F85_52A9["取攻击力"]
local _____7B2C_4E8C_7AE0_540E_6BB5Boss_6218_5229_54C1_88C5_5907_540D = ____07_FF0E_88C5_5907_8F85_52A9["第二章后段Boss战利品装备名"]
local _____88C5_5907_4F24_5BB3_7C7B_578B = ____07_FF0E_88C5_5907_8F85_52A9["装备伤害类型"]
local _____88C5_5907_5C0F_7279_6548 = ____07_FF0E_88C5_5907_8F85_52A9["装备小特效"]
local ____09_FF0E_88C5_5907_901A_7528_673A_5236 = require("系统.03．技能系统.00．技能模板+函数.04．机制组件.09．装备通用机制.index")
local _____6CE8_518C_6700_7EC8_4F24_5BB3_89E6_53D1_6A21_677F = ____09_FF0E_88C5_5907_901A_7528_673A_5236["注册最终伤害触发模板"]
local function ____on_5251_9B42_72FC_7259_5760_89E6_53D1(event)
    local target = event["目标"]
    local attacker = event["攻击者"]
    _____64AD_653E_70B9_7279_6548(
        _____88C5_5907_5C0F_7279_6548["小风爆"],
        _____53D6_5355_4F4DX(target),
        _____53D6_5355_4F4DY(target),
        0.8
    )
    _____9020_6210_88C5_5907_4F24_5BB3(
        attacker,
        target,
        _____53D6_653B_51FB_529B(attacker) * 0.35,
        _____88C5_5907_4F24_5BB3_7C7B_578B["风"]
    )
    _____6062_590D_751F_547D_9B54_6CD5(
        attacker,
        attacker,
        0,
        80,
        true
    )
end
_____6CE8_518C_6700_7EC8_4F24_5BB3_89E6_53D1_6A21_677F({
    ["名称"] = "剑魂狼牙坠",
    ["装备名"] = _____7B2C_4E8C_7AE0_540E_6BB5Boss_6218_5229_54C1_88C5_5907_540D["剑魂狼牙坠"],
    ["伤害过滤"] = "技能",
    ["概率"] = 0.15,
    ["要求双方存活"] = false,
    ["on触发"] = ____on_5251_9B42_72FC_7259_5760_89E6_53D1
})
return ____exports
