--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____07_FF0E_88C5_5907_8F85_52A9 = require("系统.03．技能系统.00．技能模板+函数.01．技能函数.20．物品辅助.07．装备辅助")
local _____4E34_65F6_73A9_5BB6_5C5E_6027 = ____07_FF0E_88C5_5907_8F85_52A9["临时玩家属性"]
local _____64AD_653E_5355_4F4D_7279_6548 = ____07_FF0E_88C5_5907_8F85_52A9["播放单位特效"]
local _____7B2C_4E8C_7AE0_540E_6BB5Boss_6218_5229_54C1_88C5_5907_540D = ____07_FF0E_88C5_5907_8F85_52A9["第二章后段Boss战利品装备名"]
local _____88C5_5907_5C0F_7279_6548 = ____07_FF0E_88C5_5907_8F85_52A9["装备小特效"]
local ____09_FF0E_88C5_5907_901A_7528_673A_5236 = require("系统.03．技能系统.00．技能模板+函数.04．机制组件.09．装备通用机制.index")
local _____521B_5EFA_4F24_5BB3_4FEE_6B63_9608_503C_89E6_53D1 = ____09_FF0E_88C5_5907_901A_7528_673A_5236["创建伤害修正阈值触发"]
_____521B_5EFA_4F24_5BB3_4FEE_6B63_9608_503C_89E6_53D1({
    ["名称"] = "封印斩护腕",
    ["装备名"] = _____7B2C_4E8C_7AE0_540E_6BB5Boss_6218_5229_54C1_88C5_5907_540D["封印斩护腕"],
    ["最大生命比例阈值"] = 0.1,
    ["冷却秒数"] = 14,
    ["冷却前缀"] = "第二章后段Boss战利品",
    ["伤害倍率"] = 0.65,
    ["优先级"] = 28,
    ["on触发"] = function(event)
        local target = event["单位"]
        _____4E34_65F6_73A9_5BB6_5C5E_6027(target, "眩晕抗性", 0.4, 4)
        _____64AD_653E_5355_4F4D_7279_6548(_____88C5_5907_5C0F_7279_6548["护盾闪光"], target, "origin", 0.8)
    end
})
return ____exports
