--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____02_FF0E_653B_51FB_6548_679C_6CE8_518C_8868 = require("系统.02．物品系统.15．装备技能.08．攻击效果.00．公共.02．攻击效果注册表")
local _____6CE8_518C_653B_51FB_6548_679C_914D_7F6E = ____02_FF0E_653B_51FB_6548_679C_6CE8_518C_8868["注册攻击效果配置"]
local ____137_FF0E_7C73_4E9A_6218_5229_54C1_516C_5171 = require("系统.02．物品系统.15．装备技能.00．物品.137．米亚战利品公共")
local _____7C73_4E9A_6218_5229_54C1_88C5_5907_540D = ____137_FF0E_7C73_4E9A_6218_5229_54C1_516C_5171["米亚战利品装备名"]
_____6CE8_518C_653B_51FB_6548_679C_914D_7F6E({
    ["装备名"] = _____7C73_4E9A_6218_5229_54C1_88C5_5907_540D["腐化猫爪手套"],
    ["触发侧"] = "攻击者",
    ["效果类型"] = "额外伤害",
    ["概率"] = 0.15,
    ["固定伤害"] = 750,
    ["伤害类型"] = "毒素"
})
return ____exports
