--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____07_FF0E_88C5_5907_8F85_52A9 = require("系统.03．技能系统.00．技能模板+函数.01．技能函数.20．物品辅助.07．装备辅助")
local _____53D6_5F53_524D_751F_547D = ____07_FF0E_88C5_5907_8F85_52A9["取当前生命"]
local _____53D6_6700_5927_751F_547D = ____07_FF0E_88C5_5907_8F85_52A9["取最大生命"]
local _____6062_590D_751F_547D_9B54_6CD5 = ____07_FF0E_88C5_5907_8F85_52A9["恢复生命魔法"]
local _____77ED_6682_65E0_654C = ____07_FF0E_88C5_5907_8F85_52A9["短暂无敌"]
local _____64AD_653E_5355_4F4D_7279_6548 = ____07_FF0E_88C5_5907_8F85_52A9["播放单位特效"]
local _____7B2C_4E8C_7AE0_540E_6BB5Boss_6218_5229_54C1_88C5_5907_540D = ____07_FF0E_88C5_5907_8F85_52A9["第二章后段Boss战利品装备名"]
local _____88C5_5907_5C0F_7279_6548 = ____07_FF0E_88C5_5907_8F85_52A9["装备小特效"]
local ____09_FF0E_88C5_5907_901A_7528_673A_5236 = require("系统.03．技能系统.00．技能模板+函数.04．机制组件.09．装备通用机制.index")
local _____521B_5EFA_4F24_5BB3_4FEE_6B63_9608_503C_89E6_53D1 = ____09_FF0E_88C5_5907_901A_7528_673A_5236["创建伤害修正阈值触发"]
local function _____7075_5FC3_4E4B_788E_7247_81F4_6B7B_8FC7_6EE4(event)
    return _____53D6_5F53_524D_751F_547D(event["单位"]) - event["当前伤害"] <= 1
end
local function ____on_7075_5FC3_4E4B_788E_7247_89E6_53D1(event)
    local target = event["单位"]
    _____77ED_6682_65E0_654C(target, 1)
    _____6062_590D_751F_547D_9B54_6CD5(
        target,
        target,
        _____53D6_6700_5927_751F_547D(target) * 0.1
    )
    _____64AD_653E_5355_4F4D_7279_6548(_____88C5_5907_5C0F_7279_6548["护盾闪光"], target, "origin", 1)
end
local function _____8BA1_7B97_7075_5FC3_4E4B_788E_7247_4FDD_547D_4F24_5BB3(event)
    local life = _____53D6_5F53_524D_751F_547D(event["单位"])
    return life > 1 and life - 1 or 0
end
_____521B_5EFA_4F24_5BB3_4FEE_6B63_9608_503C_89E6_53D1({
    ["名称"] = "灵心之碎片",
    ["装备名"] = _____7B2C_4E8C_7AE0_540E_6BB5Boss_6218_5229_54C1_88C5_5907_540D["灵心之碎片"],
    ["冷却秒数"] = 120,
    ["冷却前缀"] = "第二章后段Boss战利品",
    ["优先级"] = 5,
    ["过滤伤害"] = _____7075_5FC3_4E4B_788E_7247_81F4_6B7B_8FC7_6EE4,
    ["on触发"] = ____on_7075_5FC3_4E4B_788E_7247_89E6_53D1,
    ["计算伤害"] = _____8BA1_7B97_7075_5FC3_4E4B_788E_7247_4FDD_547D_4F24_5BB3
})
return ____exports
