--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____07_FF0E_88C5_5907_8F85_52A9 = require("系统.03．技能系统.00．技能模板+函数.01．技能函数.20．物品辅助.07．装备辅助")
local _____9020_6210_88C5_5907_4F24_5BB3 = ____07_FF0E_88C5_5907_8F85_52A9["造成装备伤害"]
local _____64AD_653E_70B9_7279_6548 = ____07_FF0E_88C5_5907_8F85_52A9["播放点特效"]
local _____53D6_5355_4F4DX = ____07_FF0E_88C5_5907_8F85_52A9["取单位X"]
local _____53D6_5355_4F4DY = ____07_FF0E_88C5_5907_8F85_52A9["取单位Y"]
local _____53D6_653B_51FB_529B = ____07_FF0E_88C5_5907_8F85_52A9["取攻击力"]
local _____7B2C_4E8C_7AE0_540E_6BB5Boss_6218_5229_54C1_88C5_5907_540D = ____07_FF0E_88C5_5907_8F85_52A9["第二章后段Boss战利品装备名"]
local _____88C5_5907_4F24_5BB3_7C7B_578B = ____07_FF0E_88C5_5907_8F85_52A9["装备伤害类型"]
local _____88C5_5907_5C0F_7279_6548 = ____07_FF0E_88C5_5907_8F85_52A9["装备小特效"]
local ____08_FF0E_88C5_5907_89E6_53D1_6A21_677F = require("系统.03．技能系统.00．技能模板+函数.00．技能模板.08．装备触发模板.index")
local _____6CE8_518C_6700_7EC8_4F24_5BB3_89E6_53D1_6A21_677F = ____08_FF0E_88C5_5907_89E6_53D1_6A21_677F["注册最终伤害触发模板"]
local ____require_result_0 = require("系统.03．技能系统.00．技能模板+函数.01．技能函数.16．扩展控制.扩展控制系统")
local _____65BD_52A0_6269_5C55_63A7_5236 = ____require_result_0["施加扩展控制"]
local function ____on_6E6E_706D_4E4B_98CE_6212_6307_89E6_53D1(event)
    local target = event["目标"]
    local attacker = event["攻击者"]
    _____64AD_653E_70B9_7279_6548(
        _____88C5_5907_5C0F_7279_6548["小风爆"],
        _____53D6_5355_4F4DX(target),
        _____53D6_5355_4F4DY(target),
        0.8
    )
    _____9020_6210_88C5_5907_4F24_5BB3(
        attacker,
        target,
        _____53D6_653B_51FB_529B(attacker) * 0.3,
        _____88C5_5907_4F24_5BB3_7C7B_578B["风"],
        false,
        nil,
        {["伤害形态"] = "单体"}
    )
    _____65BD_52A0_6269_5C55_63A7_5236(attacker, target, "silence", {["持续时间"] = 1.5, ["效果来源名称"] = "湮灭之风戒指", ["效果来源类型"] = "装备"})
end
_____6CE8_518C_6700_7EC8_4F24_5BB3_89E6_53D1_6A21_677F({
    ["名称"] = "湮灭之风戒指",
    ["装备名"] = _____7B2C_4E8C_7AE0_540E_6BB5Boss_6218_5229_54C1_88C5_5907_540D["湮灭之风戒指"],
    ["伤害过滤"] = "技能",
    ["冷却秒数"] = 11,
    ["冷却前缀"] = "第二章后段Boss战利品",
    ["要求双方存活"] = false,
    ["on触发"] = ____on_6E6E_706D_4E4B_98CE_6212_6307_89E6_53D1
})
return ____exports
