--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____07_FF0E_88C5_5907_8F85_52A9 = require("系统.03．技能系统.00．技能模板+函数.01．技能函数.20．物品辅助.07．装备辅助")
local _____662F_5143_7D20_4F24_5BB3 = ____07_FF0E_88C5_5907_8F85_52A9["是元素伤害"]
local _____9020_6210_88C5_5907_4F24_5BB3 = ____07_FF0E_88C5_5907_8F85_52A9["造成装备伤害"]
local _____64AD_653E_5355_4F4D_7279_6548 = ____07_FF0E_88C5_5907_8F85_52A9["播放单位特效"]
local _____7B2C_4E8C_7AE0_540E_6BB5Boss_6218_5229_54C1_88C5_5907_540D = ____07_FF0E_88C5_5907_8F85_52A9["第二章后段Boss战利品装备名"]
local _____88C5_5907_4F24_5BB3_7C7B_578B = ____07_FF0E_88C5_5907_8F85_52A9["装备伤害类型"]
local _____88C5_5907_5C0F_7279_6548 = ____07_FF0E_88C5_5907_8F85_52A9["装备小特效"]
local ____08_FF0E_88C5_5907_89E6_53D1_6A21_677F = require("系统.03．技能系统.00．技能模板+函数.00．技能模板.08．装备触发模板.index")
local _____6CE8_518C_6700_7EC8_4F24_5BB3_89E6_53D1_6A21_677F = ____08_FF0E_88C5_5907_89E6_53D1_6A21_677F["注册最终伤害触发模板"]
local ____14_FF0E_5355_4F4D_65F6_9650_6807_8BB0 = require("系统.03．技能系统.00．技能模板+函数.04．机制组件.09．装备通用机制.14．单位时限标记")
local _____521B_5EFA_5355_4F4D_65F6_9650_6807_8BB0 = ____14_FF0E_5355_4F4D_65F6_9650_6807_8BB0["创建单位时限标记"]
local _____5361_745F_62C9_6E7F_75D5 = _____521B_5EFA_5355_4F4D_65F6_9650_6807_8BB0("卡瑟拉深渊法典湿痕")
local function _____5361_745F_62C9_6C34_4F24_8FC7_6EE4(event)
    return _____662F_5143_7D20_4F24_5BB3(event["伤害快照"], _____88C5_5907_4F24_5BB3_7C7B_578B["水"])
end
local function _____5361_745F_62C9_95EA_7535_8FC7_6EE4(event)
    return _____662F_5143_7D20_4F24_5BB3(event["伤害快照"], _____88C5_5907_4F24_5BB3_7C7B_578B["闪电"]) and _____5361_745F_62C9_6E7F_75D5["存在"](_____5361_745F_62C9_6E7F_75D5, event["目标"])
end
_____6CE8_518C_6700_7EC8_4F24_5BB3_89E6_53D1_6A21_677F({
    ["名称"] = "卡瑟拉深渊法典-湿痕",
    ["装备名"] = _____7B2C_4E8C_7AE0_540E_6BB5Boss_6218_5229_54C1_88C5_5907_540D["卡瑟拉深渊法典"],
    ["伤害过滤"] = "技能",
    ["要求双方存活"] = false,
    ["自定义过滤"] = _____5361_745F_62C9_6C34_4F24_8FC7_6EE4,
    ["on触发"] = function(event)
        _____5361_745F_62C9_6E7F_75D5["标记"](_____5361_745F_62C9_6E7F_75D5, event["目标"], 6)
        _____64AD_653E_5355_4F4D_7279_6548(_____88C5_5907_5C0F_7279_6548["湿痕"], event["目标"], "origin", 1.2)
    end
})
_____6CE8_518C_6700_7EC8_4F24_5BB3_89E6_53D1_6A21_677F({
    ["名称"] = "卡瑟拉深渊法典-闪电引爆",
    ["装备名"] = _____7B2C_4E8C_7AE0_540E_6BB5Boss_6218_5229_54C1_88C5_5907_540D["卡瑟拉深渊法典"],
    ["伤害过滤"] = "技能",
    ["要求双方存活"] = false,
    ["自定义过滤"] = _____5361_745F_62C9_95EA_7535_8FC7_6EE4,
    ["on触发"] = function(event)
        if not _____5361_745F_62C9_6E7F_75D5["消耗"](_____5361_745F_62C9_6E7F_75D5, event["目标"]) then
            return
        end
        _____9020_6210_88C5_5907_4F24_5BB3(
            event["攻击者"],
            event["目标"],
            event["本次伤害"] * 0.22,
            _____88C5_5907_4F24_5BB3_7C7B_578B["闪电"],
            false,
            nil,
            {["伤害形态"] = "单体"}
        )
    end
})
return ____exports
