--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____07_FF0E_88C5_5907_8F85_52A9 = require("系统.03．技能系统.00．技能模板+函数.01．技能函数.20．物品辅助.07．装备辅助")
local _____662F_5143_7D20_4F24_5BB3 = ____07_FF0E_88C5_5907_8F85_52A9["是元素伤害"]
local _____9020_6210_88C5_5907_4F24_5BB3 = ____07_FF0E_88C5_5907_8F85_52A9["造成装备伤害"]
local _____64AD_653E_5355_4F4D_7279_6548 = ____07_FF0E_88C5_5907_8F85_52A9["播放单位特效"]
local _____53D6_653B_51FB_529B = ____07_FF0E_88C5_5907_8F85_52A9["取攻击力"]
local _____7B2C_4E8C_7AE0_540E_6BB5Boss_6218_5229_54C1_88C5_5907_540D = ____07_FF0E_88C5_5907_8F85_52A9["第二章后段Boss战利品装备名"]
local _____88C5_5907_4F24_5BB3_7C7B_578B = ____07_FF0E_88C5_5907_8F85_52A9["装备伤害类型"]
local _____88C5_5907_5C0F_7279_6548 = ____07_FF0E_88C5_5907_8F85_52A9["装备小特效"]
local ____08_FF0E_88C5_5907_89E6_53D1_6A21_677F = require("系统.03．技能系统.00．技能模板+函数.00．技能模板.08．装备触发模板.index")
local _____6CE8_518C_6700_7EC8_4F24_5BB3_89E6_53D1_6A21_677F = ____08_FF0E_88C5_5907_89E6_53D1_6A21_677F["注册最终伤害触发模板"]
local function _____9AD8_538B_6C34_810A_6CD5_6756_8FC7_6EE4(event)
    return _____662F_5143_7D20_4F24_5BB3(event["伤害快照"], _____88C5_5907_4F24_5BB3_7C7B_578B["水"])
end
local function ____on_9AD8_538B_6C34_810A_6CD5_6756_89E6_53D1(event)
    local target = event["目标"]
    local attacker = event["攻击者"]
    _____64AD_653E_5355_4F4D_7279_6548(_____88C5_5907_5C0F_7279_6548["湿痕"], target, "origin", 1)
    _____9020_6210_88C5_5907_4F24_5BB3(
        attacker,
        target,
        _____53D6_653B_51FB_529B(attacker) * 0.6,
        _____88C5_5907_4F24_5BB3_7C7B_578B["水"],
        false,
        nil,
        {["伤害形态"] = "单体"}
    )
end
_____6CE8_518C_6700_7EC8_4F24_5BB3_89E6_53D1_6A21_677F({
    ["名称"] = "高压水脊法杖",
    ["装备名"] = _____7B2C_4E8C_7AE0_540E_6BB5Boss_6218_5229_54C1_88C5_5907_540D["高压水脊法杖"],
    ["伤害过滤"] = "技能",
    ["冷却秒数"] = 9,
    ["冷却前缀"] = "第二章后段Boss战利品",
    ["要求双方存活"] = false,
    ["自定义过滤"] = _____9AD8_538B_6C34_810A_6CD5_6756_8FC7_6EE4,
    ["on触发"] = ____on_9AD8_538B_6C34_810A_6CD5_6756_89E6_53D1
})
return ____exports
