--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____07_FF0E_88C5_5907_8F85_52A9 = require("系统.03．技能系统.00．技能模板+函数.01．技能函数.20．物品辅助.07．装备辅助")
local _____9020_6210_88C5_5907_4F24_5BB3 = ____07_FF0E_88C5_5907_8F85_52A9["造成装备伤害"]
local _____64AD_653E_5355_4F4D_7279_6548 = ____07_FF0E_88C5_5907_8F85_52A9["播放单位特效"]
local _____53D6_653B_51FB_529B = ____07_FF0E_88C5_5907_8F85_52A9["取攻击力"]
local _____7B2C_4E8C_7AE0_540E_6BB5Boss_6218_5229_54C1_88C5_5907_540D = ____07_FF0E_88C5_5907_8F85_52A9["第二章后段Boss战利品装备名"]
local _____88C5_5907_4F24_5BB3_7C7B_578B = ____07_FF0E_88C5_5907_8F85_52A9["装备伤害类型"]
local _____88C5_5907_5C0F_7279_6548 = ____07_FF0E_88C5_5907_8F85_52A9["装备小特效"]
local ____09_FF0E_88C5_5907_901A_7528_673A_5236 = require("系统.03．技能系统.00．技能模板+函数.04．机制组件.09．装备通用机制.index")
local _____6CE8_518C_6700_7EC8_4F24_5BB3_89E6_53D1_6A21_677F = ____09_FF0E_88C5_5907_901A_7528_673A_5236["注册最终伤害触发模板"]
local ____20_FF0E_7269_54C1_8F85_52A9 = require("系统.03．技能系统.00．技能模板+函数.01．技能函数.20．物品辅助.index")
local _____5EF6_8FDF_6267_884C_53CC_5355_4F4D_52A8_4F5C = ____20_FF0E_7269_54C1_8F85_52A9["延迟执行双单位动作"]
local ____require_result_0 = require("系统.03．技能系统.00．技能模板+函数.01．技能函数.16．扩展控制.扩展控制系统")
local _____65BD_52A0_6269_5C55_63A7_5236 = ____require_result_0["施加扩展控制"]
local function _____5EF6_8FDF_6839_987B_4F24_5BB3(source, target)
    _____9020_6210_88C5_5907_4F24_5BB3(
        source,
        target,
        _____53D6_653B_51FB_529B(source) * 0.25,
        _____88C5_5907_4F24_5BB3_7C7B_578B["自然"]
    )
end
local function ____on_8150_8D25_6839_987B_6CD5_6756_89E6_53D1(event)
    local target = event["目标"]
    local attacker = event["攻击者"]
    _____64AD_653E_5355_4F4D_7279_6548(_____88C5_5907_5C0F_7279_6548["根须"], target, "origin", 2.5)
    _____65BD_52A0_6269_5C55_63A7_5236(attacker, target, "roots", {["持续时间"] = 1.5})
    _____9020_6210_88C5_5907_4F24_5BB3(
        attacker,
        target,
        _____53D6_653B_51FB_529B(attacker) * 0.3,
        _____88C5_5907_4F24_5BB3_7C7B_578B["自然"]
    )
    _____5EF6_8FDF_6267_884C_53CC_5355_4F4D_52A8_4F5C(attacker, target, 1000, _____5EF6_8FDF_6839_987B_4F24_5BB3)
    _____5EF6_8FDF_6267_884C_53CC_5355_4F4D_52A8_4F5C(attacker, target, 2000, _____5EF6_8FDF_6839_987B_4F24_5BB3)
end
_____6CE8_518C_6700_7EC8_4F24_5BB3_89E6_53D1_6A21_677F({
    ["名称"] = "腐败根须法杖",
    ["装备名"] = _____7B2C_4E8C_7AE0_540E_6BB5Boss_6218_5229_54C1_88C5_5907_540D["腐败根须法杖"],
    ["伤害过滤"] = "技能",
    ["概率"] = 0.15,
    ["冷却秒数"] = 4,
    ["冷却前缀"] = "第二章后段Boss战利品",
    ["要求双方存活"] = false,
    ["on触发"] = ____on_8150_8D25_6839_987B_6CD5_6756_89E6_53D1
})
return ____exports
