--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____07_FF0E_88C5_5907_8F85_52A9 = require("系统.03．技能系统.00．技能模板+函数.01．技能函数.20．物品辅助.07．装备辅助")
local _____5355_4F4D_6301_6709_7B2C_4E8C_7AE0_540E_6BB5Boss_6218_5229_54C1 = ____07_FF0E_88C5_5907_8F85_52A9["单位持有第二章后段Boss战利品"]
local _____51C0_5316_8D1F_9762 = ____07_FF0E_88C5_5907_8F85_52A9["净化负面"]
local _____6062_590D_751F_547D_9B54_6CD5 = ____07_FF0E_88C5_5907_8F85_52A9["恢复生命魔法"]
local _____53D6_6700_5927_751F_547D = ____07_FF0E_88C5_5907_8F85_52A9["取最大生命"]
local _____64AD_653E_5355_4F4D_7279_6548 = ____07_FF0E_88C5_5907_8F85_52A9["播放单位特效"]
local _____76D1_542C_88C5_5907_4E22_5F03_6E05_7406 = ____07_FF0E_88C5_5907_8F85_52A9["监听装备丢弃清理"]
local _____7B2C_4E8C_7AE0_540E_6BB5Boss_6218_5229_54C1_88C5_5907_540D = ____07_FF0E_88C5_5907_8F85_52A9["第二章后段Boss战利品装备名"]
local _____88C5_5907_5C0F_7279_6548 = ____07_FF0E_88C5_5907_8F85_52A9["装备小特效"]
local ____10_FF0E_7A97_53E3_627F_4F24_6B21_6570_89E6_53D1 = require("系统.03．技能系统.00．技能模板+函数.04．机制组件.09．装备通用机制.10．窗口承伤次数触发")
local _____521B_5EFA_7A97_53E3_627F_4F24_6B21_6570_89E6_53D1_5668 = ____10_FF0E_7A97_53E3_627F_4F24_6B21_6570_89E6_53D1["创建窗口承伤次数触发器"]
local function _____53E4_6811_4E4B_5FC3_62A4_7B26_8FC7_6EE4(event)
    return _____5355_4F4D_6301_6709_7B2C_4E8C_7AE0_540E_6BB5Boss_6218_5229_54C1(event["单位"], _____7B2C_4E8C_7AE0_540E_6BB5Boss_6218_5229_54C1_88C5_5907_540D["古树之心护符"])
end
local function ____on_53E4_6811_4E4B_5FC3_62A4_7B26_89E6_53D1(event)
    local target = event["单位"]
    _____51C0_5316_8D1F_9762(target)
    _____6062_590D_751F_547D_9B54_6CD5(
        target,
        target,
        _____53D6_6700_5927_751F_547D(target) * 0.08
    )
    _____64AD_653E_5355_4F4D_7279_6548(_____88C5_5907_5C0F_7279_6548["护盾闪光"], target, "origin", 0.8)
end
local _____53E4_6811_4E4B_5FC3_62A4_7B26_627F_4F24_6B21_6570 = _____521B_5EFA_7A97_53E3_627F_4F24_6B21_6570_89E6_53D1_5668({["名称"] = "古树之心护符", ["次数阈值"] = 4, ["过滤伤害"] = _____53E4_6811_4E4B_5FC3_62A4_7B26_8FC7_6EE4, ["on触发"] = ____on_53E4_6811_4E4B_5FC3_62A4_7B26_89E6_53D1})
_____76D1_542C_88C5_5907_4E22_5F03_6E05_7406(
    _____7B2C_4E8C_7AE0_540E_6BB5Boss_6218_5229_54C1_88C5_5907_540D["古树之心护符"],
    function(unit)
        _____53E4_6811_4E4B_5FC3_62A4_7B26_627F_4F24_6B21_6570["清空"](_____53E4_6811_4E4B_5FC3_62A4_7B26_627F_4F24_6B21_6570, unit)
    end
)
return ____exports
