--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____149_FF0E_5F71_9AA8_6218_5229_54C1_516C_5171 = require("系统.02．物品系统.15．装备技能.00．物品.149．影骨战利品公共")
local _____5355_4F4D_6301_6709_5F71_9AA8_6218_5229_54C1 = ____149_FF0E_5F71_9AA8_6218_5229_54C1_516C_5171["单位持有影骨战利品"]
local _____5F71_9AA8_6218_5229_54C1_88C5_5907_540D = ____149_FF0E_5F71_9AA8_6218_5229_54C1_516C_5171["影骨战利品装备名"]
local ____require_result_0 = require("系统.03．技能系统.00．技能模板+函数.04．机制组件.09．装备通用机制.07．击杀回复触发模板")
local _____6CE8_518C_51FB_6740_56DE_590D_89E6_53D1_6A21_677F = ____require_result_0["注册击杀回复触发模板"]
local function _____76D7_8D3C_9996_9886_5FBD_8BB0_89E6_53D1_6761_4EF6(event)
    return _____5355_4F4D_6301_6709_5F71_9AA8_6218_5229_54C1(event["击杀单位"], _____5F71_9AA8_6218_5229_54C1_88C5_5907_540D["盗贼首领徽记"])
end
_____6CE8_518C_51FB_6740_56DE_590D_89E6_53D1_6A21_677F({
    ["名称"] = "盗贼首领徽记",
    ["冷却秒数"] = 0.5,
    ["恢复魔法值"] = 40,
    ["恢复最大魔法比例"] = 0.04,
    ["使用默认魔法特效"] = true,
    ["触发条件"] = _____76D7_8D3C_9996_9886_5FBD_8BB0_89E6_53D1_6761_4EF6
})
return ____exports
