--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____07_FF0E_88C5_5907_8F85_52A9 = require("系统.03．技能系统.00．技能模板+函数.01．技能函数.20．物品辅助.07．装备辅助")
local _____53D6_6700_5927_751F_547D = ____07_FF0E_88C5_5907_8F85_52A9["取最大生命"]
local _____5F00_59CB_901A_7528_62A4_76FE = ____07_FF0E_88C5_5907_8F85_52A9["开始通用护盾"]
local _____4E34_65F6_73A9_5BB6_5C5E_6027 = ____07_FF0E_88C5_5907_8F85_52A9["临时玩家属性"]
local _____7B2C_4E8C_7AE0_540E_6BB5Boss_6218_5229_54C1_88C5_5907_540D = ____07_FF0E_88C5_5907_8F85_52A9["第二章后段Boss战利品装备名"]
local ____13_FF0E_4F24_5BB3_4FEE_6B63_9608_503C_89E6_53D1 = require("系统.03．技能系统.00．技能模板+函数.04．机制组件.09．装备通用机制.13．伤害修正阈值触发")
local _____521B_5EFA_4F24_5BB3_4FEE_6B63_9608_503C_89E6_53D1 = ____13_FF0E_4F24_5BB3_4FEE_6B63_9608_503C_89E6_53D1["创建伤害修正阈值触发"]
_____521B_5EFA_4F24_5BB3_4FEE_6B63_9608_503C_89E6_53D1({
    ["名称"] = "莫尔特斯树皮盾",
    ["装备名"] = _____7B2C_4E8C_7AE0_540E_6BB5Boss_6218_5229_54C1_88C5_5907_540D["莫尔特斯树皮盾"],
    ["最大生命比例阈值"] = 0.13,
    ["冷却秒数"] = 18,
    ["冷却前缀"] = "第二章后段Boss战利品",
    ["伤害倍率"] = 0.82,
    ["优先级"] = 27,
    ["on触发"] = function(event)
        local target = event["单位"]
        _____5F00_59CB_901A_7528_62A4_76FE(
            target,
            target,
            600 + _____53D6_6700_5927_751F_547D(target) * 0.1,
            6,
            "莫尔特斯树皮盾"
        )
        _____4E34_65F6_73A9_5BB6_5C5E_6027(target, "木属性抗性", 0.12, 6)
        _____4E34_65F6_73A9_5BB6_5C5E_6027(target, "暗属性抗性", 0.12, 6)
    end
})
return ____exports
