--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____02_FF0E_653B_51FB_6548_679C_6CE8_518C_8868 = require("系统.02．物品系统.15．装备技能.08．攻击效果.00．公共.02．攻击效果注册表")
local _____6CE8_518C_653B_51FB_6548_679C_914D_7F6E = ____02_FF0E_653B_51FB_6548_679C_6CE8_518C_8868["注册攻击效果配置"]
_____6CE8_518C_653B_51FB_6548_679C_914D_7F6E({
    ["装备名"] = "地核熔炉之心",
    ["触发侧"] = "攻击者",
    ["效果类型"] = "范围伤害",
    ["概率"] = 0.1,
    ["范围"] = 260,
    ["范围包含主目标"] = true,
    ["固定伤害"] = 550,
    ["伤害类型"] = "火焰"
})
return ____exports
