--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____01_FF0E_4F24_5BB3_4E8B_4EF6_5DE5_5177 = require("系统.02．物品系统.15．装备技能.04．伤害事件.00．公共.01．伤害事件工具")
local _____5355_4F4D_6709_6548_5B58_6D3B = ____01_FF0E_4F24_5BB3_4E8B_4EF6_5DE5_5177["单位有效存活"]
local _____53D6_5355_4F4D_653B_51FB_529B = ____01_FF0E_4F24_5BB3_4E8B_4EF6_5DE5_5177["取单位攻击力"]
local _____9020_6210_4F24_5BB3_4E8B_4EF6_4F24_5BB3 = ____01_FF0E_4F24_5BB3_4E8B_4EF6_5DE5_5177["造成伤害事件伤害"]
local _____4F24_5BB3_4E8B_4EF6_4F24_5BB3_7C7B_578B = ____01_FF0E_4F24_5BB3_4E8B_4EF6_5DE5_5177["伤害事件伤害类型"]
local ____require_result_0 = require("系统.03．技能系统.00．技能模板+函数.04．机制组件.09．装备通用机制.11．最终伤害触发模板")
local _____6CE8_518C_6700_7EC8_4F24_5BB3_89E6_53D1_6A21_677F = ____require_result_0["注册最终伤害触发模板"]
local _____6C38_6052_8F6E_56DE_6CD5_5178_51B7_5374_79D2_6570 = 2
local _____6C38_6052_8F6E_56DE_6CD5_5178_653B_51FB_529B_7CFB_6570 = 0.4
local function ____on_6C38_6052_8F6E_56DE_6CD5_5178_6700_7EC8_4F24_5BB3(event)
    if not _____5355_4F4D_6709_6548_5B58_6D3B(event["攻击者"]) or not _____5355_4F4D_6709_6548_5B58_6D3B(event["目标"]) then
        return
    end
    _____9020_6210_4F24_5BB3_4E8B_4EF6_4F24_5BB3(
        event["攻击者"],
        event["目标"],
        _____53D6_5355_4F4D_653B_51FB_529B(event["攻击者"]) * _____6C38_6052_8F6E_56DE_6CD5_5178_653B_51FB_529B_7CFB_6570,
        _____4F24_5BB3_4E8B_4EF6_4F24_5BB3_7C7B_578B["火焰"]
    )
end
_____6CE8_518C_6700_7EC8_4F24_5BB3_89E6_53D1_6A21_677F({
    ["名称"] = "永恒轮回法典",
    ["装备名"] = "永恒轮回法典",
    ["持有者"] = "攻击者",
    ["伤害过滤"] = "技能",
    ["冷却秒数"] = _____6C38_6052_8F6E_56DE_6CD5_5178_51B7_5374_79D2_6570,
    ["冷却标签"] = "永恒轮回法典:轮回火印",
    ["冷却前缀"] = "第三章主线Boss战利品",
    ["on触发"] = ____on_6C38_6052_8F6E_56DE_6CD5_5178_6700_7EC8_4F24_5BB3
})
return ____exports
