--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____04_FF0E_6301_6709_6218_6597_5468_671F_6A21_677F = require("系统.03．技能系统.00．技能模板+函数.00．技能模板.08．装备触发模板.04．持有战斗周期模板")
local _____6CE8_518C_6301_6709_6218_6597_5468_671F_6A21_677F = ____04_FF0E_6301_6709_6218_6597_5468_671F_6A21_677F["注册持有战斗周期模板"]
local ____28_FF0E_5355_4F4D_9A7B_7559_8FDB_5EA6 = require("系统.03．技能系统.00．技能模板+函数.04．机制组件.09．装备通用机制.28．单位驻留进度")
local _____521B_5EFA_5355_4F4D_9A7B_7559_8FDB_5EA6 = ____28_FF0E_5355_4F4D_9A7B_7559_8FDB_5EA6["创建单位驻留进度"]
local ____07_FF0E_88C5_5907_8F85_52A9 = require("系统.03．技能系统.00．技能模板+函数.01．技能函数.20．物品辅助.07．装备辅助")
local _____53D6_88C5_5907_7269_54C1ID = ____07_FF0E_88C5_5907_8F85_52A9["取装备物品ID"]
local _____4E34_65F6_73A9_5BB6_5C5E_6027 = ____07_FF0E_88C5_5907_8F85_52A9["临时玩家属性"]
local _____64AD_653E_5355_4F4D_7279_6548 = ____07_FF0E_88C5_5907_8F85_52A9["播放单位特效"]
local _____56DBBoss_6218_5229_54C1_88C5_5907_540D = ____07_FF0E_88C5_5907_8F85_52A9["四Boss战利品装备名"]
local _____56DBBoss_88C5_5907_7279_6548 = ____07_FF0E_88C5_5907_8F85_52A9["四Boss装备特效"]
local _____9A7B_7559_8FDB_5EA6 = _____521B_5EFA_5355_4F4D_9A7B_7559_8FDB_5EA6("最后阵地重铠", 160)
_____6CE8_518C_6301_6709_6218_6597_5468_671F_6A21_677F({
    ["名称"] = "最后阵地重铠",
    ["物品类型ID"] = _____53D6_88C5_5907_7269_54C1ID(_____56DBBoss_6218_5229_54C1_88C5_5907_540D["最后阵地重铠"]),
    ["周期秒"] = 1,
    ["on丢弃"] = function(event)
        _____9A7B_7559_8FDB_5EA6["清空"](event["单位"])
    end,
    ["on周期"] = function(event)
        local u = event["单位"]
        if _____9A7B_7559_8FDB_5EA6["采样"](u) >= 3 then
            _____4E34_65F6_73A9_5BB6_5C5E_6027(u, "护甲", 18, 2.2)
            _____4E34_65F6_73A9_5BB6_5C5E_6027(u, "物理抗性", 0.12, 2.2)
            _____4E34_65F6_73A9_5BB6_5C5E_6027(u, "控制抗性", 0.2, 2.2)
            _____64AD_653E_5355_4F4D_7279_6548(
                _____56DBBoss_88C5_5907_7279_6548["安魂范围"],
                u,
                "origin",
                2.2,
                0.35
            )
        end
    end
})
return ____exports
