--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____08_FF0E_88C5_5907_89E6_53D1_6A21_677F = require("系统.03．技能系统.00．技能模板+函数.00．技能模板.08．装备触发模板.index")
local _____6CE8_518C_6700_7EC8_4F24_5BB3_89E6_53D1_6A21_677F = ____08_FF0E_88C5_5907_89E6_53D1_6A21_677F["注册最终伤害触发模板"]
local ____07_FF0E_88C5_5907_8F85_52A9 = require("系统.03．技能系统.00．技能模板+函数.01．技能函数.20．物品辅助.07．装备辅助")
local _____53D6_5F53_524D_751F_547D = ____07_FF0E_88C5_5907_8F85_52A9["取当前生命"]
local _____53D6_6700_5927_751F_547D = ____07_FF0E_88C5_5907_8F85_52A9["取最大生命"]
local _____4E34_65F6_73A9_5BB6_5C5E_6027 = ____07_FF0E_88C5_5907_8F85_52A9["临时玩家属性"]
local _____64AD_653E_5355_4F4D_7279_6548 = ____07_FF0E_88C5_5907_8F85_52A9["播放单位特效"]
local _____56DBBoss_6218_5229_54C1_88C5_5907_540D = ____07_FF0E_88C5_5907_8F85_52A9["四Boss战利品装备名"]
local _____56DBBoss_88C5_5907_7279_6548 = ____07_FF0E_88C5_5907_8F85_52A9["四Boss装备特效"]
local ____require_result_0 = require("lib.扩展函数.Star扩展函数.Star扩展库.04A．快速Buff共享")
local SFB_setSlow = ____require_result_0.SFB_setSlow
_____6CE8_518C_6700_7EC8_4F24_5BB3_89E6_53D1_6A21_677F({
    ["名称"] = "裂誓战躯重铠-残誓不退",
    ["装备名"] = _____56DBBoss_6218_5229_54C1_88C5_5907_540D["裂誓战躯重铠"],
    ["持有者"] = "受击者",
    ["冷却秒数"] = 45,
    ["自定义过滤"] = function(e) return _____53D6_5F53_524D_751F_547D(e["持有者"]) / _____53D6_6700_5927_751F_547D(e["持有者"]) <= 0.35 end,
    ["on触发"] = function(e)
        _____4E34_65F6_73A9_5BB6_5C5E_6027(e["持有者"], "物理抗性", 0.25, 6)
        _____4E34_65F6_73A9_5BB6_5C5E_6027(e["持有者"], "魔法抗性", 0.18, 6)
        _____4E34_65F6_73A9_5BB6_5C5E_6027(e["持有者"], "控制抗性", 0.4, 6)
        SFB_setSlow(
            e["持有者"],
            e["持有者"],
            0,
            0.25,
            6
        )
        _____64AD_653E_5355_4F4D_7279_6548(
            _____56DBBoss_88C5_5907_7279_6548["誓盾"],
            e["持有者"],
            "origin",
            6,
            0.32
        )
    end
})
return ____exports
