--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____06_FF0E_4E0D_540C_6280_80FD_4F24_5BB3_5E8F_5217_89E6_53D1_6A21_677F = require("系统.03．技能系统.00．技能模板+函数.00．技能模板.08．装备触发模板.06．不同技能伤害序列触发模板")
local _____6CE8_518C_4E0D_540C_6280_80FD_4F24_5BB3_5E8F_5217_89E6_53D1_6A21_677F = ____06_FF0E_4E0D_540C_6280_80FD_4F24_5BB3_5E8F_5217_89E6_53D1_6A21_677F["注册不同技能伤害序列触发模板"]
local ____07_FF0E_88C5_5907_8F85_52A9 = require("系统.03．技能系统.00．技能模板+函数.01．技能函数.20．物品辅助.07．装备辅助")
local _____53D6_653B_51FB_529B = ____07_FF0E_88C5_5907_8F85_52A9["取攻击力"]
local _____4E34_65F6_73A9_5BB6_5C5E_6027 = ____07_FF0E_88C5_5907_8F85_52A9["临时玩家属性"]
local _____9020_6210_88C5_5907_4F24_5BB3 = ____07_FF0E_88C5_5907_8F85_52A9["造成装备伤害"]
local _____64AD_653E_5355_4F4D_7279_6548 = ____07_FF0E_88C5_5907_8F85_52A9["播放单位特效"]
local _____56DBBoss_6218_5229_54C1_88C5_5907_540D = ____07_FF0E_88C5_5907_8F85_52A9["四Boss战利品装备名"]
local _____56DBBoss_88C5_5907_7279_6548 = ____07_FF0E_88C5_5907_8F85_52A9["四Boss装备特效"]
local _____88C5_5907_4F24_5BB3_7C7B_578B = ____07_FF0E_88C5_5907_8F85_52A9["装备伤害类型"]
_____6CE8_518C_4E0D_540C_6280_80FD_4F24_5BB3_5E8F_5217_89E6_53D1_6A21_677F({
    ["名称"] = "苍影校魂法典",
    ["装备名"] = _____56DBBoss_6218_5229_54C1_88C5_5907_540D["苍影校魂法典"],
    ["需要不同技能数"] = 2,
    ["时间窗毫秒"] = 6000,
    ["作用域"] = "主体与目标",
    ["重复策略"] = "忽略",
    ["触发时机"] = "达成时",
    ["on触发"] = function(e)
        _____4E34_65F6_73A9_5BB6_5C5E_6027(e["目标"], "魔法抗性", -0.12, 4)
        _____64AD_653E_5355_4F4D_7279_6548(
            _____56DBBoss_88C5_5907_7279_6548["月纹"],
            e["目标"],
            "overhead",
            4,
            0.22
        )
        _____9020_6210_88C5_5907_4F24_5BB3(
            e["攻击者"],
            e["目标"],
            _____53D6_653B_51FB_529B(e["攻击者"]) * 0.65 + 240,
            _____88C5_5907_4F24_5BB3_7C7B_578B["魔法"],
            false,
            nil,
            {["装备技能类型"] = "装备被动", ["标签"] = "灵识校准", ["伤害形态"] = "单体"}
        )
    end
})
return ____exports
