--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____05_FF0E_6CBB_7597_62A4_76FE_8054_52A8 = require("系统.03．技能系统.00．技能模板+函数.04．机制组件.09．装备通用机制.05．治疗护盾联动")
local _____521B_5EFA_6CBB_7597_62A4_76FE_8054_52A8 = ____05_FF0E_6CBB_7597_62A4_76FE_8054_52A8["创建治疗护盾联动"]
local ____19_FF0E_4E34_65F6_5C5E_6027_6548_679C = require("系统.03．技能系统.00．技能模板+函数.01．技能函数.20．物品辅助.19．临时属性效果")
local _____521B_5EFA_5355_4F4D_4E34_65F6_5C5E_6027_6548_679C_6258_7BA1_5668 = ____19_FF0E_4E34_65F6_5C5E_6027_6548_679C["创建单位临时属性效果托管器"]
local ____23_FF0E_88C5_5907_5C5E_6027_5B9A_4E49 = require("系统.03．技能系统.00．技能模板+函数.01．技能函数.20．物品辅助.23．装备属性定义")
local _____521B_5EFA_88C5_5907_73A9_5BB6_5C5E_6027_9879 = ____23_FF0E_88C5_5907_5C5E_6027_5B9A_4E49["创建装备玩家属性项"]
local _____88C5_5907_5C5E_6027_952E = ____23_FF0E_88C5_5907_5C5E_6027_5B9A_4E49["装备属性键"]
local ____00_FF0EBuff_7CFB_7EDF = require("系统.05．Buff系统.00．Buff系统")
local registerManualBuff = ____00_FF0EBuff_7CFB_7EDF.registerManualBuff
local ____00_FF0EBuff_767B_8BB0 = require("系统.05．Buff系统.03．Buff表.00．Buff登记")
local _____5E38_89C4BuffID = ____00_FF0EBuff_767B_8BB0["常规BuffID"]
local ____07_FF0E_88C5_5907_8F85_52A9 = require("系统.03．技能系统.00．技能模板+函数.01．技能函数.20．物品辅助.07．装备辅助")
local _____5355_4F4D_6301_6709_88C5_5907 = ____07_FF0E_88C5_5907_8F85_52A9["单位持有装备"]
local _____662F_654C_5BF9_5355_4F4D = ____07_FF0E_88C5_5907_8F85_52A9["是敌对单位"]
local _____53D6_5F53_524D_751F_547D = ____07_FF0E_88C5_5907_8F85_52A9["取当前生命"]
local _____53D6_6700_5927_751F_547D = ____07_FF0E_88C5_5907_8F85_52A9["取最大生命"]
local _____53D6_5355_4F4D_5BF9_5355_4F4D_51B7_5374_952E = ____07_FF0E_88C5_5907_8F85_52A9["取单位对单位冷却键"]
local _____88C5_5907_51B7_5374_5C31_7EEA = ____07_FF0E_88C5_5907_8F85_52A9["装备冷却就绪"]
local _____8FDB_5165_88C5_5907_51B7_5374_5E76_663E_793A = ____07_FF0E_88C5_5907_8F85_52A9["进入装备冷却并显示"]
local _____56DBBoss_6218_5229_54C1_88C5_5907_540D = ____07_FF0E_88C5_5907_8F85_52A9["四Boss战利品装备名"]
local _____51C0_8A93_4F59_8F89_6301_7EED_79D2 = 5
local _____51C0_8A93_4F59_8F89_6297_6027 = 0.15
local _____51C0_8A93_4F59_8F89_5C5E_6027_6548_679C = _____521B_5EFA_5355_4F4D_4E34_65F6_5C5E_6027_6548_679C_6258_7BA1_5668()
local function _____6E05_9664_51C0_8A93_4F59_8F89_5C5E_6027(unit, _buffID, _row)
    _____51C0_8A93_4F59_8F89_5C5E_6027_6548_679C["清除"](unit)
end
local function _____5C1D_8BD5_51C0_8A93_4F59_8F89(event)
    local source = event["来源单位"]
    local target = event["目标单位"]
    if _____662F_654C_5BF9_5355_4F4D(source, target) or not _____5355_4F4D_6301_6709_88C5_5907(source, _____56DBBoss_6218_5229_54C1_88C5_5907_540D["月白归静圣铃"]) or _____53D6_5F53_524D_751F_547D(target) / _____53D6_6700_5927_751F_547D(target) > 0.45 then
        return
    end
    local key = _____53D6_5355_4F4D_5BF9_5355_4F4D_51B7_5374_952E(source, target, "净誓余辉")
    if not _____88C5_5907_51B7_5374_5C31_7EEA(key) then
        return
    end
    _____8FDB_5165_88C5_5907_51B7_5374_5E76_663E_793A(key, 10, source, _____56DBBoss_6218_5229_54C1_88C5_5907_540D["月白归静圣铃"])
    registerManualBuff(
        target,
        _____5E38_89C4BuffID["月白归静圣铃_净誓余辉"],
        _____51C0_8A93_4F59_8F89_6301_7EED_79D2,
        _____51C0_8A93_4F59_8F89_6297_6027,
        {
            sourceUnit = source,
            effectSourceName = _____56DBBoss_6218_5229_54C1_88C5_5907_540D["月白归静圣铃"],
            effectSourceType = "装备",
            effectValue2 = _____51C0_8A93_4F59_8F89_6297_6027,
            onRemove = _____6E05_9664_51C0_8A93_4F59_8F89_5C5E_6027
        }
    )
    _____51C0_8A93_4F59_8F89_5C5E_6027_6548_679C["施加"](
        target,
        0,
        {
            _____521B_5EFA_88C5_5907_73A9_5BB6_5C5E_6027_9879(_____88C5_5907_5C5E_6027_952E["物理抗性"], _____51C0_8A93_4F59_8F89_6297_6027),
            _____521B_5EFA_88C5_5907_73A9_5BB6_5C5E_6027_9879(_____88C5_5907_5C5E_6027_952E["魔法抗性"], _____51C0_8A93_4F59_8F89_6297_6027),
            _____521B_5EFA_88C5_5907_73A9_5BB6_5C5E_6027_9879(_____88C5_5907_5C5E_6027_952E["控制抗性"], 0.3)
        }
    )
end
_____521B_5EFA_6CBB_7597_62A4_76FE_8054_52A8({
    ["名称"] = "月白归静圣铃-净誓余辉",
    ["监听方向"] = "自己给予",
    ["治疗触发阶段"] = "治疗开始",
    ["on治疗"] = _____5C1D_8BD5_51C0_8A93_4F59_8F89,
    ["on护盾"] = _____5C1D_8BD5_51C0_8A93_4F59_8F89
})
return ____exports
