--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____01_FF0E_524D_6447_9884_8B66_6267_884C_6A21_677F = require("系统.03．技能系统.00．技能模板+函数.00．技能模板.04．主动技能流程模板.01．前摇预警执行模板")
local _____5F00_59CB_4E3B_52A8_6280_80FD_524D_6447_9884_8B66_6267_884C_6A21_677F = ____01_FF0E_524D_6447_9884_8B66_6267_884C_6A21_677F["开始主动技能前摇预警执行模板"]
local ____07_FF0E_88C5_5907_8F85_52A9 = require("系统.03．技能系统.00．技能模板+函数.01．技能函数.20．物品辅助.07．装备辅助")
local _____53D6_5750_6807_8303_56F4_654C_4EBA = ____07_FF0E_88C5_5907_8F85_52A9["取坐标范围敌人"]
local _____9020_6210_88C5_5907_4F24_5BB3 = ____07_FF0E_88C5_5907_8F85_52A9["造成装备伤害"]
local _____64AD_653E_70B9_7279_6548 = ____07_FF0E_88C5_5907_8F85_52A9["播放点特效"]
local _____56DBBoss_88C5_5907_7279_6548 = ____07_FF0E_88C5_5907_8F85_52A9["四Boss装备特效"]
local _____88C5_5907_4F24_5BB3_7C7B_578B = ____07_FF0E_88C5_5907_8F85_52A9["装备伤害类型"]
local jass = require("jass.common")
____exports["处理超位魔法残章天空坠落使用"] = function(ctx)
    local caster = ctx["施法单位"]
    local x = ctx["目标X"]
    local y = ctx["目标Y"]
    _____5F00_59CB_4E3B_52A8_6280_80FD_524D_6447_9884_8B66_6267_884C_6A21_677F({
        ["施法者"] = caster,
        ["目标X"] = x,
        ["目标Y"] = y,
        ["前摇"] = {
            ["持续时间"] = 2.5,
            ["强制硬直"] = true,
            ["允许自我打断"] = true,
            ["施法动作名"] = "spell",
            ["开始回调"] = function()
                _____64AD_653E_70B9_7279_6548(
                    _____56DBBoss_88C5_5907_7279_6548["天空法阵"],
                    x,
                    y,
                    2.6,
                    0.75
                )
            end
        },
        ["提示圈"] = {
            ["类型"] = "敌方圆形",
            X = x,
            Y = y,
            ["半径"] = 500,
            ["持续时间"] = 2.5,
            ["来源单位"] = caster
        },
        ["执行"] = function()
            _____64AD_653E_70B9_7279_6548(
                _____56DBBoss_88C5_5907_7279_6548["天空光柱"],
                x,
                y,
                1.2,
                0.8
            )
            _____64AD_653E_70B9_7279_6548(
                _____56DBBoss_88C5_5907_7279_6548["天空冲击"],
                x,
                y,
                1.5,
                0.85
            )
            local units = _____53D6_5750_6807_8303_56F4_654C_4EBA(caster, x, y, 500)
            local damage = 1800 + jass:GetHeroInt(caster, true) * 7
            do
                local i = 0
                while i < #units do
                    _____9020_6210_88C5_5907_4F24_5BB3(
                        caster,
                        units[i + 1],
                        damage,
                        _____88C5_5907_4F24_5BB3_7C7B_578B["魔法"],
                        true,
                        nil,
                        {
                            ["装备技能类型"] = "装备主动",
                            ["物品ID"] = jass:GetItemTypeId(ctx["物品"]),
                            ["物品实例"] = ctx["物品"],
                            ["技能ID"] = ctx["技能ID"],
                            ["标签"] = "天空坠落",
                            ["伤害形态"] = "AOE"
                        }
                    )
                    i = i + 1
                end
            end
        end
    })
end
return ____exports
