--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____02_FF0E_653B_51FB_6548_679C_6CE8_518C_8868 = require("系统.02．物品系统.15．装备技能.08．攻击效果.00．公共.02．攻击效果注册表")
local _____6CE8_518C_653B_51FB_6548_679C_914D_7F6E = ____02_FF0E_653B_51FB_6548_679C_6CE8_518C_8868["注册攻击效果配置"]
local ____07_FF0E_88C5_5907_8F85_52A9 = require("系统.03．技能系统.00．技能模板+函数.01．技能函数.20．物品辅助.07．装备辅助")
local _____53D6_5F53_524D_751F_547D = ____07_FF0E_88C5_5907_8F85_52A9["取当前生命"]
local _____53D6_6700_5927_751F_547D = ____07_FF0E_88C5_5907_8F85_52A9["取最大生命"]
local _____7956_5730_79D8_5883_6218_5229_54C1_88C5_5907_540D = ____07_FF0E_88C5_5907_8F85_52A9["祖地秘境战利品装备名"]
local _____5904_51B3_65A9_6740_7EBF = 0.4
local _____5904_51B3_653B_51FB_7CFB_6570 = 0.3
local _____5904_51B3_7279_6548 = "Common\\Effect\\Element\\Light\\lightnova.mdx"
local function _____8BA1_7B97_6267_5211_5DE8_5203_89E6_53D1_6982_7387(ctx)
    local target = ctx.target
    if target == nil or target == 0 then
        return 0
    end
    return _____53D6_5F53_524D_751F_547D(target) / _____53D6_6700_5927_751F_547D(target) <= _____5904_51B3_65A9_6740_7EBF and 1 or 0
end
_____6CE8_518C_653B_51FB_6548_679C_914D_7F6E({
    ["装备名"] = _____7956_5730_79D8_5883_6218_5229_54C1_88C5_5907_540D["执刑巨刃"],
    ["触发侧"] = "攻击者",
    ["效果类型"] = "额外伤害",
    ["仅普通攻击"] = true,
    ["概率计算"] = _____8BA1_7B97_6267_5211_5DE8_5203_89E6_53D1_6982_7387,
    ["攻击系数"] = _____5904_51B3_653B_51FB_7CFB_6570,
    ["伤害类型"] = "物理",
    ["特效"] = _____5904_51B3_7279_6548
})
return ____exports
