--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____04_FF0E_6301_6709_6218_6597_5468_671F_6A21_677F = require("系统.03．技能系统.00．技能模板+函数.00．技能模板.08．装备触发模板.04．持有战斗周期模板")
local _____6CE8_518C_6301_6709_6218_6597_5468_671F_6A21_677F = ____04_FF0E_6301_6709_6218_6597_5468_671F_6A21_677F["注册持有战斗周期模板"]
local ____07_FF0E_88C5_5907_8F85_52A9 = require("系统.03．技能系统.00．技能模板+函数.01．技能函数.20．物品辅助.07．装备辅助")
local _____53D6_88C5_5907_7269_54C1ID = ____07_FF0E_88C5_5907_8F85_52A9["取装备物品ID"]
local _____53D6_8303_56F4_53CB_65B9 = ____07_FF0E_88C5_5907_8F85_52A9["取范围友方"]
local _____53D6_5F53_524D_751F_547D = ____07_FF0E_88C5_5907_8F85_52A9["取当前生命"]
local _____53D6_6700_5927_751F_547D = ____07_FF0E_88C5_5907_8F85_52A9["取最大生命"]
local _____53D6_653B_51FB_529B = ____07_FF0E_88C5_5907_8F85_52A9["取攻击力"]
local _____6062_590D_751F_547D_9B54_6CD5 = ____07_FF0E_88C5_5907_8F85_52A9["恢复生命魔法"]
local _____64AD_653E_5355_4F4D_7279_6548 = ____07_FF0E_88C5_5907_8F85_52A9["播放单位特效"]
local _____5355_4F4D_5B58_6D3B = ____07_FF0E_88C5_5907_8F85_52A9["单位存活"]
local _____7956_5730_79D8_5883_6218_5229_54C1_88C5_5907_540D = ____07_FF0E_88C5_5907_8F85_52A9["祖地秘境战利品装备名"]
local _____62A4_5FC3_5468_671F_79D2 = 5
local _____62A4_5FC3_534A_5F84 = 600
local _____62A4_5FC3_653B_51FB_7CFB_6570 = 0.4
local _____62A4_5FC3_6CBB_7597_7279_6548 = "Abilities\\Spells\\NightElf\\Rejuvenation\\RejuvenationTarget.mdl"
local function ____on_62A4_5FC3_5468_671F(event)
    local unit = event["单位"]
    if not _____5355_4F4D_5B58_6D3B(unit) then
        return
    end
    local _____53CB_519B = _____53D6_8303_56F4_53CB_65B9(unit, _____62A4_5FC3_534A_5F84)
    local _____76EE_6807 = nil
    local _____6700_4F4E_6BD4_4F8B = 2
    do
        local i = 0
        while i < #_____53CB_519B do
            local ally = _____53CB_519B[i + 1]
            local _____6BD4_4F8B = _____53D6_5F53_524D_751F_547D(ally) / _____53D6_6700_5927_751F_547D(ally)
            if _____6BD4_4F8B < _____6700_4F4E_6BD4_4F8B then
                _____6700_4F4E_6BD4_4F8B = _____6BD4_4F8B
                _____76EE_6807 = ally
            end
            i = i + 1
        end
    end
    if _____76EE_6807 == nil or _____6700_4F4E_6BD4_4F8B >= 1 then
        return
    end
    _____6062_590D_751F_547D_9B54_6CD5(
        unit,
        _____76EE_6807,
        _____53D6_653B_51FB_529B(unit) * _____62A4_5FC3_653B_51FB_7CFB_6570
    )
    _____64AD_653E_5355_4F4D_7279_6548(
        _____62A4_5FC3_6CBB_7597_7279_6548,
        _____76EE_6807,
        "origin",
        1.5,
        0.6
    )
end
_____6CE8_518C_6301_6709_6218_6597_5468_671F_6A21_677F({
    ["名称"] = "灵潮护心灯-护心",
    ["物品类型ID"] = _____53D6_88C5_5907_7269_54C1ID(_____7956_5730_79D8_5883_6218_5229_54C1_88C5_5907_540D["灵潮护心灯"]),
    ["周期秒"] = _____62A4_5FC3_5468_671F_79D2,
    ["on周期"] = ____on_62A4_5FC3_5468_671F
})
return ____exports
