--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____00_FF0E_4F24_5BB3_4E8B_4EF6_914D_7F6E_8868 = require("系统.02．物品系统.15．装备技能.04．伤害事件.00．公共.00．伤害事件配置表")
local _____4F24_5BB3_4E8B_4EF6_88C5_5907ID = ____00_FF0E_4F24_5BB3_4E8B_4EF6_914D_7F6E_8868["伤害事件装备ID"]
local ____01_FF0E_4F24_5BB3_4E8B_4EF6_5DE5_5177 = require("系统.02．物品系统.15．装备技能.04．伤害事件.00．公共.01．伤害事件工具")
local _____5355_4F4D_6301_6709_4F24_5BB3_4E8B_4EF6_88C5_5907 = ____01_FF0E_4F24_5BB3_4E8B_4EF6_5DE5_5177["单位持有伤害事件装备"]
local _____6267_884C_7269_54C1_6CBB_7597 = ____01_FF0E_4F24_5BB3_4E8B_4EF6_5DE5_5177["执行物品治疗"]
local ____17_FF0E_5355_76EE_6807_5468_671F_6548_679C = require("系统.03．技能系统.00．技能模板+函数.04．机制组件.09．装备通用机制.17．单目标周期效果")
local _____6DFB_52A0_5355_76EE_6807_5468_671F_6548_679C = ____17_FF0E_5355_76EE_6807_5468_671F_6548_679C["添加单目标周期效果"]
local ____07_FF0E_88C5_5907_8F85_52A9 = require("系统.03．技能系统.00．技能模板+函数.01．技能函数.20．物品辅助.07．装备辅助")
local _____88C5_5907_51B7_5374_4E2D = ____07_FF0E_88C5_5907_8F85_52A9["装备冷却中"]
local _____8FDB_5165_88C5_5907_516C_5171_51B7_5374_5E76_663E_793A = ____07_FF0E_88C5_5907_8F85_52A9["进入装备公共冷却并显示"]
local _____6CE8_518C_88C5_5907_51B7_5374_663E_793A_6301_6709_8005_8FFD_8E2A = ____07_FF0E_88C5_5907_8F85_52A9["注册装备冷却显示持有者追踪"]
local _____7194_7075_5927_5251_5168_961F_51B7_5374_952E = "伤害事件装备:熔灵大剑全队"
_____6CE8_518C_88C5_5907_51B7_5374_663E_793A_6301_6709_8005_8FFD_8E2A("熔灵大剑")
local function _____7194_7075_5927_5251_5468_671F(event)
    _____6267_884C_7269_54C1_6CBB_7597(
        event["来源"],
        event["来源"],
        0,
        "",
        event["数值"],
        "Abilities\\Spells\\Items\\AIma\\AImaTarget.mdl"
    )
end
____exports["处理熔灵大剑造成伤害"] = function(ctx)
    if ctx.applied <= 10 then
        return
    end
    if not _____5355_4F4D_6301_6709_4F24_5BB3_4E8B_4EF6_88C5_5907(ctx.attacker, _____4F24_5BB3_4E8B_4EF6_88C5_5907ID["熔灵大剑"]) then
        return
    end
    if _____88C5_5907_51B7_5374_4E2D(_____7194_7075_5927_5251_5168_961F_51B7_5374_952E) then
        return
    end
    _____8FDB_5165_88C5_5907_516C_5171_51B7_5374_5E76_663E_793A(_____7194_7075_5927_5251_5168_961F_51B7_5374_952E, 5, "熔灵大剑")
    _____6DFB_52A0_5355_76EE_6807_5468_671F_6548_679C({
        ["名称"] = "熔灵大剑",
        ["来源"] = ctx.attacker,
        ["目标"] = ctx.attacker,
        ["数值"] = ctx.applied * 0.05 * 0.2,
        ["持续毫秒"] = 5000,
        ["间隔毫秒"] = 1000,
        ["on周期"] = _____7194_7075_5927_5251_5468_671F
    })
end
return ____exports
