--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____01_FF0E_7269_54C1_4F7F_7528_914D_7F6E_8868 = require("系统.02．物品系统.15．装备技能.05．物品使用.00．公共.01．物品使用配置表")
local _____7269_54C1_4F7F_7528_88C5_5907ID = ____01_FF0E_7269_54C1_4F7F_7528_914D_7F6E_8868["物品使用装备ID"]
local _____7269_54C1_4F7F_7528_6570_503C_914D_7F6E = ____01_FF0E_7269_54C1_4F7F_7528_914D_7F6E_8868["物品使用数值配置"]
local ____02_FF0E_7269_54C1_4F7F_7528_5DE5_5177 = require("系统.02．物品系统.15．装备技能.05．物品使用.00．公共.02．物品使用工具")
local _____662F_5426_4E3A_4F7F_7528_7269_54C1 = ____02_FF0E_7269_54C1_4F7F_7528_5DE5_5177["是否为使用物品"]
local _____82F1_96C4_4E3B_5C5E_6027_662F_667A_529B = ____02_FF0E_7269_54C1_4F7F_7528_5DE5_5177["英雄主属性是智力"]
local _____589E_52A0_82F1_96C4_7ECF_9A8C_4E0E_667A_529B = ____02_FF0E_7269_54C1_4F7F_7528_5DE5_5177["增加英雄经验与智力"]
local ____22_FF0E_5355_4F4D_6C38_4E45_6807_8BB0 = require("系统.03．技能系统.00．技能模板+函数.04．机制组件.09．装备通用机制.22．单位永久标记")
local _____521B_5EFA_5355_4F4D_6C38_4E45_6807_8BB0 = ____22_FF0E_5355_4F4D_6C38_4E45_6807_8BB0["创建单位永久标记"]
local _____5546_4EBA_4E4B_4E66_5DF2_53C2_609F = _____521B_5EFA_5355_4F4D_6C38_4E45_6807_8BB0("商人之书已参悟")
____exports["处理商人之书使用"] = function(ctx)
    if not _____662F_5426_4E3A_4F7F_7528_7269_54C1(ctx["物品"], _____7269_54C1_4F7F_7528_88C5_5907ID["商人之书"]) then
        return
    end
    local unit = ctx["施法单位"]
    if not _____82F1_96C4_4E3B_5C5E_6027_662F_667A_529B(unit) then
        return
    end
    if not _____5546_4EBA_4E4B_4E66_5DF2_53C2_609F["标记若不存在"](unit) then
        return
    end
    local cfg = _____7269_54C1_4F7F_7528_6570_503C_914D_7F6E["商人之书"]
    _____589E_52A0_82F1_96C4_7ECF_9A8C_4E0E_667A_529B(unit, cfg["经验次数"], cfg["每次经验"], cfg["智力增加"])
end
return ____exports
