--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____01_FF0E_7269_54C1_4F7F_7528_914D_7F6E_8868 = require("系统.02．物品系统.15．装备技能.05．物品使用.00．公共.01．物品使用配置表")
local _____7269_54C1_4F7F_7528_88C5_5907ID = ____01_FF0E_7269_54C1_4F7F_7528_914D_7F6E_8868["物品使用装备ID"]
local _____7269_54C1_4F7F_7528_6570_503C_914D_7F6E = ____01_FF0E_7269_54C1_4F7F_7528_914D_7F6E_8868["物品使用数值配置"]
local ____02_FF0E_7269_54C1_4F7F_7528_5DE5_5177 = require("系统.02．物品系统.15．装备技能.05．物品使用.00．公共.02．物品使用工具")
local _____662F_5426_4E3A_4F7F_7528_7269_54C1 = ____02_FF0E_7269_54C1_4F7F_7528_5DE5_5177["是否为使用物品"]
local _____6267_884C_6CBB_7597 = ____02_FF0E_7269_54C1_4F7F_7528_5DE5_5177["执行治疗"]
local _____8BFB_53D6_73A9_5BB6_5C5E_6027 = ____02_FF0E_7269_54C1_4F7F_7528_5DE5_5177["读取玩家属性"]
____exports["处理熔灵宝石之戒使用"] = function(ctx)
    if not _____662F_5426_4E3A_4F7F_7528_7269_54C1(ctx["物品"], _____7269_54C1_4F7F_7528_88C5_5907ID["熔灵宝石之戒"]) then
        return
    end
    local unit = ctx["施法单位"]
    local heal = _____7269_54C1_4F7F_7528_6570_503C_914D_7F6E["熔灵宝石之戒"]["基础治疗"] * (1 + _____8BFB_53D6_73A9_5BB6_5C5E_6027(unit, "魔法伤害"))
    _____6267_884C_6CBB_7597(unit, unit, heal, 0)
end
return ____exports
