--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____01_FF0E_7269_54C1_4F7F_7528_914D_7F6E_8868 = require("系统.02．物品系统.15．装备技能.05．物品使用.00．公共.01．物品使用配置表")
local _____7269_54C1_4F7F_7528_88C5_5907ID = ____01_FF0E_7269_54C1_4F7F_7528_914D_7F6E_8868["物品使用装备ID"]
local _____7269_54C1_4F7F_7528_6570_503C_914D_7F6E = ____01_FF0E_7269_54C1_4F7F_7528_914D_7F6E_8868["物品使用数值配置"]
local ____02_FF0E_7269_54C1_4F7F_7528_5DE5_5177 = require("系统.02．物品系统.15．装备技能.05．物品使用.00．公共.02．物品使用工具")
local _____662F_5426_4E3A_4F7F_7528_7269_54C1 = ____02_FF0E_7269_54C1_4F7F_7528_5DE5_5177["是否为使用物品"]
local _____79FB_9664_5DF2_7528_5C3D_6B21_6570_7269_54C1 = ____02_FF0E_7269_54C1_4F7F_7528_5DE5_5177["移除已用尽次数物品"]
local ____20_FF0E_7269_54C1_8F85_52A9 = require("系统.03．技能系统.00．技能模板+函数.01．技能函数.20．物品辅助.index")
local _____65BD_52A0_4E34_65F6_5C5E_6027_6548_679C = ____20_FF0E_7269_54C1_8F85_52A9["施加临时属性效果"]
local _____64AD_653E_5355_4F4D_7279_6548 = ____20_FF0E_7269_54C1_8F85_52A9["播放单位特效"]
local _____836F_5242_4F7F_7528_7279_6548 = "Common\\Effect\\Element\\magic\\vortex.mdx"
____exports["处理浴灵药剂使用"] = function(ctx)
    if not _____662F_5426_4E3A_4F7F_7528_7269_54C1(ctx["物品"], _____7269_54C1_4F7F_7528_88C5_5907ID["浴灵药剂"]) then
        return
    end
    local unit = ctx["施法单位"]
    local cfg = _____7269_54C1_4F7F_7528_6570_503C_914D_7F6E["浴灵药剂"]
    _____64AD_653E_5355_4F4D_7279_6548(_____836F_5242_4F7F_7528_7279_6548, unit, "origin", 1)
    _____65BD_52A0_4E34_65F6_5C5E_6027_6548_679C(unit, cfg["持续毫秒"], {{["类型"] = "玩家属性", ["属性名"] = "魔抗", ["数值"] = cfg["魔抗提升"]}})
    _____79FB_9664_5DF2_7528_5C3D_6B21_6570_7269_54C1(ctx["物品"])
end
return ____exports
