--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____00_FF0E_83B7_5F97_7269_54C1_914D_7F6E_8868 = require("系统.02．物品系统.15．装备技能.07．获得物品.00．公共.00．获得物品配置表")
local _____7194_5893_5B88_536B_62A4_7B26_914D_7F6E = ____00_FF0E_83B7_5F97_7269_54C1_914D_7F6E_8868["熔墓守卫护符配置"]
local _____83B7_5F97_7269_54C1_88C5_5907ID = ____00_FF0E_83B7_5F97_7269_54C1_914D_7F6E_8868["获得物品装备ID"]
local ____require_result_0 = require("系统.03．技能系统.00．技能模板+函数.01．技能函数.20．物品辅助.02．持有型周期效果")
local _____6CE8_518C_6301_6709_578B_5468_671F_6548_679C = ____require_result_0["注册持有型周期效果"]
local ____require_result_1 = require("系统.02．物品系统.15．装备技能.05．物品使用.00．公共.02．物品使用工具")
local _____5355_4F4D_6240_5728_70B9_662F_8352_829C = ____require_result_1["单位所在点是荒芜"]
local _____53D6_6700_5927_751F_547D = ____require_result_1["取最大生命"]
local _____6267_884C_6CBB_7597 = ____require_result_1["执行治疗"]
local function ____on_7194_5893_5B88_536B_62A4_7B26_5468_671F(unit, currentCount)
    if not _____5355_4F4D_6240_5728_70B9_662F_8352_829C(unit) then
        return
    end
    _____6267_884C_6CBB_7597(
        unit,
        unit,
        _____53D6_6700_5927_751F_547D(unit) * _____7194_5893_5B88_536B_62A4_7B26_914D_7F6E["荒芜恢复最大生命比例"] * currentCount,
        0
    )
end
local function _____521D_59CB_5316_7194_5893_5B88_536B_62A4_7B26()
    if _____83B7_5F97_7269_54C1_88C5_5907ID["熔墓守卫护符"] == 0 then
        return
    end
    _____6CE8_518C_6301_6709_578B_5468_671F_6548_679C({["物品类型ID"] = _____83B7_5F97_7269_54C1_88C5_5907ID["熔墓守卫护符"], ["间隔毫秒"] = _____7194_5893_5B88_536B_62A4_7B26_914D_7F6E["间隔毫秒"], ["周期回调"] = ____on_7194_5893_5B88_536B_62A4_7B26_5468_671F})
end
_____521D_59CB_5316_7194_5893_5B88_536B_62A4_7B26()
return ____exports
