--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____02_FF0E_653B_51FB_6548_679C_6CE8_518C_8868 = require("系统.02．物品系统.15．装备技能.08．攻击效果.00．公共.02．攻击效果注册表")
local _____6CE8_518C_653B_51FB_6548_679C_914D_7F6E = ____02_FF0E_653B_51FB_6548_679C_6CE8_518C_8868["注册攻击效果配置"]
_____6CE8_518C_653B_51FB_6548_679C_914D_7F6E({
    ["装备名"] = "毒之铠甲",
    ["触发侧"] = "受击者",
    ["效果类型"] = "持续伤害",
    ["仅普通攻击"] = true,
    ["最大距离"] = 200,
    ["固定伤害"] = 50,
    ["持续时间"] = 3,
    ["间隔"] = 1,
    ["伤害类型"] = "毒素"
})
return ____exports
