--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____02_FF0E_653B_51FB_6548_679C_6CE8_518C_8868 = require("系统.02．物品系统.15．装备技能.08．攻击效果.00．公共.02．攻击效果注册表")
local _____6CE8_518C_653B_51FB_6548_679C_914D_7F6E = ____02_FF0E_653B_51FB_6548_679C_6CE8_518C_8868["注册攻击效果配置"]
_____6CE8_518C_653B_51FB_6548_679C_914D_7F6E({
    ["装备名"] = "狱之刺刃",
    ["触发侧"] = "攻击者",
    ["效果类型"] = "资源偷取",
    ["仅普通攻击"] = true,
    ["攻击者类型"] = "近战",
    ["最大距离"] = 200,
    ["概率"] = 0.2,
    ["攻击系数"] = 3,
    ["抽取生命比例"] = 0.15,
    ["抽取魔法比例"] = 0.15,
    ["伤害类型"] = "物理"
})
return ____exports
