/** @noSelfInFile */

import { 注册教派学者暗影索命 } from './03．暗影索命';
import { 注册教派学者深渊之牢 } from './04．深渊之牢';
import { 注册教派学者冥神魔门 } from './05．冥神魔门';
import { 注册教派学者冥之念欲 } from './06．冥之念欲';
import { 注册教派学者邪狱追魂冥法 } from './07．邪狱追魂冥法';
import { 教派学者单位技能配置 } from './00．配置';
import { 注册技能显示名称覆盖 } from '../../../../01．显示技能名字';


let 教派学者技能结构已注册 = false;

export function 注册教派学者技能结构(this: void): void {
  if (教派学者技能结构已注册) return;
  教派学者技能结构已注册 = true;
  const 技能提示 = 教派学者单位技能配置.主动技能提示;
  for (let i = 0; i < 技能提示.length; i++) {
    注册技能显示名称覆盖(教派学者单位技能配置.单位ID, 技能提示[i].技能ID, 技能提示[i].提示);
  }
  注册教派学者暗影索命();
  注册教派学者深渊之牢();
  注册教派学者冥神魔门();
  注册教派学者冥之念欲();
  注册教派学者邪狱追魂冥法();
}
