--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____00_FF0E_914D_7F6E_7C7B_578B = require("系统.03．技能系统.06．AI自动使用技能.03．Boss战启动桥接.00．战斗启动属性.00．配置类型")
local _____9ED8_8BA4Boss_5F31_70B9_6570_91CF_57FA_7840_503C = ____00_FF0E_914D_7F6E_7C7B_578B["默认Boss弱点数量基础值"]
____exports["单位nbdo战斗启动属性配置"] = {
    ["归类"] = "Boss",
    ["单位ID"] = "nbdo",
    ["单位名"] = "蛇之领主-奢恩",
    ["战斗音乐变量名"] = "gg_snd_battle002",
    ["胜利音乐变量名"] = "gg_snd_shengliBgm",
    ["地点变量名"] = "gg_rct______________047",
    ["转换场景"] = true,
    ["BS移动X轴"] = 27768.1,
    ["BS移动Y轴"] = 12959.3,
    ["玩家移动X轴"] = 29751.8,
    ["玩家移动Y轴"] = 11901.6,
    ["暴击率"] = 0.4,
    ["护甲穿透"] = 0.5,
    ["弱点数量基础值"] = _____9ED8_8BA4Boss_5F31_70B9_6570_91CF_57FA_7840_503C,
    ["弱点数量每层N增量"] = 0,
    ["天生弱点数"] = 2,
    ["剑弱"] = true,
    ["暗弱"] = true,
    ["器弱伤害需求生命百分比"] = 0.03,
    ["护盾基础值"] = 7,
    ["护盾每层N增量"] = 2
}
____exports["单位nbdo战斗启动护卫配置"] = {
    ["Boss单位ID"] = "nbdo",
    ["Boss单位名"] = "蛇之领主-奢恩",
    ["护卫血条归属类型"] = "独立",
    ["初始护卫批次"] = {["单位列表"] = {{
        ["单位ID"] = "nbdw",
        ["单位名"] = "蛇之护卫",
        X = 27930.9,
        Y = 13411.4,
        ["面向"] = 270,
        ["额外最大生命"] = 2000,
        ["出生特效模型"] = "Abilities\\Spells\\Demon\\DarkConversion\\ZombifyTarget.mdl",
        ["出生特效持续秒"] = 1,
        ["主Boss死亡时立刻死亡"] = true,
        ["显示护卫血条"] = true
    }, {
        ["单位ID"] = "nbdw",
        ["单位名"] = "蛇之护卫",
        X = 28982.1,
        Y = 13233.3,
        ["面向"] = 270,
        ["额外最大生命"] = 2000,
        ["出生特效模型"] = "Abilities\\Spells\\Demon\\DarkConversion\\ZombifyTarget.mdl",
        ["出生特效持续秒"] = 1,
        ["主Boss死亡时立刻死亡"] = true,
        ["显示护卫血条"] = true
    }}},
    ["周期护卫批次"] = {["间隔毫秒"] = 42500, ["广播说话者"] = "护卫", ["广播文案池"] = {"进攻！粉碎入侵者", "奢恩大人，我们来帮助你赶跑入侵者"}, ["单位列表"] = {{
        ["单位ID"] = "nbdw",
        ["单位名"] = "蛇之护卫",
        X = 27930.9,
        Y = 13411.4,
        ["面向"] = 270,
        ["额外最大生命"] = 2000,
        ["出生特效模型"] = "Abilities\\Spells\\Demon\\DarkConversion\\ZombifyTarget.mdl",
        ["出生特效持续秒"] = 1,
        ["主Boss死亡时立刻死亡"] = true
    }, {
        ["单位ID"] = "nbds",
        ["单位名"] = "蛇之看守者(精英)",
        X = 28982.1,
        Y = 13233.3,
        ["面向"] = 270,
        ["额外最大生命"] = 2000,
        ["出生特效模型"] = "Abilities\\Spells\\Demon\\DarkConversion\\ZombifyTarget.mdl",
        ["出生特效持续秒"] = 1,
        ["主Boss死亡时立刻死亡"] = true
    }}}
}
return ____exports
