--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____00_FF0E_914D_7F6E_7C7B_578B = require("系统.03．技能系统.06．AI自动使用技能.03．Boss战启动桥接.00．战斗启动属性.00．配置类型")
local _____9ED8_8BA4Boss_5F31_70B9_6570_91CF_57FA_7840_503C = ____00_FF0E_914D_7F6E_7C7B_578B["默认Boss弱点数量基础值"]
____exports["单位N03O战斗启动属性配置"] = {
    ["归类"] = "Boss",
    ["单位ID"] = "N03O",
    ["单位名"] = "恶魔领袖",
    ["战斗音乐变量名"] = "gg_snd_battleBoss3",
    ["胜利音乐变量名"] = "gg_snd_shengliBgm2",
    ["地点变量名"] = "gg_rct______________1522",
    ["转换场景"] = true,
    ["BS移动X轴"] = 26503,
    ["BS移动Y轴"] = 20921.8,
    ["玩家移动X轴"] = 26807.5,
    ["玩家移动Y轴"] = 17016.8,
    ["魔抗"] = 0.38,
    ["暴击率"] = 0.5,
    ["普攻伤害吸血"] = 0.5,
    ["弱点数量基础值"] = _____9ED8_8BA4Boss_5F31_70B9_6570_91CF_57FA_7840_503C,
    ["弱点数量每层N增量"] = 0,
    ["天生弱点数"] = 2,
    ["冰弱"] = true,
    ["短剑弱"] = true,
    ["器弱伤害需求生命百分比"] = 0.03,
    ["护盾基础值"] = 10,
    ["护盾每层N增量"] = 2
}
____exports["单位N03O战斗启动护卫配置"] = {["Boss单位ID"] = "N03O", ["Boss单位名"] = "恶魔领袖", ["护卫血条归属类型"] = "独立", ["初始护卫批次"] = {["广播说话者"] = "护卫", ["广播文案池"] = {"大人，我们来助您一臂之力。", "大人，这里的麻烦交给我们处理。", "大人，察觉您这边有变，我们立刻赶回来了。"}, ["后续对白"] = {{["延迟毫秒"] = 3000, ["说话者"] = "Boss", ["文案池"] = {"很好，你们来得正是时候。此战若胜，少不了你们的奖赏。"}}, {["延迟毫秒"] = 5000, ["说话者"] = "护卫", ["文案池"] = {"愿为大人效死力。"}}}, ["单位列表"] = {{
    ["单位ID"] = "n03N",
    ["单位名"] = "恶魔队长",
    X = 26803,
    Y = 20921.8,
    ["面向"] = 270,
    ["暴击率"] = 0.4,
    ["普攻伤害吸血"] = 0.75,
    ["主Boss死亡时立刻死亡"] = false,
    ["显示护卫血条"] = true
}, {
    ["单位ID"] = "n03N",
    ["单位名"] = "恶魔队长",
    X = 26203,
    Y = 20921.8,
    ["面向"] = 270,
    ["暴击率"] = 0.4,
    ["普攻伤害吸血"] = 0.75,
    ["主Boss死亡时立刻死亡"] = false,
    ["显示护卫血条"] = true
}}}}
return ____exports
