--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____00_FF0E_914D_7F6E_7C7B_578B = require("系统.03．技能系统.06．AI自动使用技能.03．Boss战启动桥接.00．战斗启动属性.00．配置类型")
local _____9ED8_8BA4Boss_5F31_70B9_6570_91CF_57FA_7840_503C = ____00_FF0E_914D_7F6E_7C7B_578B["默认Boss弱点数量基础值"]
____exports["单位N03B战斗启动属性配置"] = {
    ["归类"] = "Boss",
    ["单位ID"] = "N03B",
    ["单位名"] = "熔岩恶魔",
    ["魔抗"] = 0.3,
    ["眩晕抗性"] = 0.35,
    ["命中率"] = 0.2,
    ["闪避率"] = 0.1,
    ["护甲穿透"] = 0.15,
    ["弱点数量基础值"] = _____9ED8_8BA4Boss_5F31_70B9_6570_91CF_57FA_7840_503C,
    ["弱点数量每层N增量"] = 0,
    ["天生弱点数"] = 1,
    ["额外随机弱点数"] = 1,
    ["冰弱"] = true,
    ["器弱伤害需求生命百分比"] = 0.03,
    ["护盾基础值"] = 8,
    ["护盾每层N增量"] = 2,
    ["战斗音乐变量名"] = "gg_snd_battleBgm002",
    ["胜利音乐变量名"] = "gg_snd_shengliBgm",
    ["动态地点矩形"] = {
        ID = "molten-demon-battlefield",
        ["名称"] = "熔岩恶魔战斗区域",
        ["左"] = 18208,
        ["右"] = 21152,
        ["下"] = -8768,
        ["上"] = -5888
    },
    ["转换场景"] = true,
    ["BS移动X轴"] = 19616.6,
    ["BS移动Y轴"] = -6856.6,
    ["玩家移动X轴"] = 19918.3,
    ["玩家移动Y轴"] = -8256
}
return ____exports
