--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____00_FF0E_914D_7F6E_7C7B_578B = require("系统.03．技能系统.06．AI自动使用技能.03．Boss战启动桥接.00．战斗启动属性.00．配置类型")
local _____9ED8_8BA4Boss_5F31_70B9_6570_91CF_57FA_7840_503C = ____00_FF0E_914D_7F6E_7C7B_578B["默认Boss弱点数量基础值"]
--- 旧环境互动 Boss入口 的史莱姆（史莱姆#n001）；传送/音乐/弱点全部走标准启动属性流程。
____exports["单位n001战斗启动属性配置"] = {
    ["归类"] = "Boss",
    ["单位ID"] = "n001",
    ["单位名"] = "史莱姆",
    ["战斗音乐变量名"] = "gg_snd_battle01",
    ["转换场景"] = true,
    ["BS移动X轴"] = 24896.4,
    ["BS移动Y轴"] = 12960,
    ["玩家移动X轴"] = 23800,
    ["玩家移动Y轴"] = 12500,
    ["弱点数量基础值"] = _____9ED8_8BA4Boss_5F31_70B9_6570_91CF_57FA_7840_503C,
    ["弱点数量每层N增量"] = 0,
    ["额外随机弱点数"] = 2,
    ["器弱伤害需求生命百分比"] = 0.03,
    ["护盾基础值"] = 10,
    ["护盾每层N增量"] = 2,
    ["雷弱"] = true
}
return ____exports
