--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
____exports["鱼竿配置"] = {
    ["技能ID"] = "A017",
    ["随机最小值"] = 1,
    ["随机最大值"] = 100,
    ["行走不可通行"] = true,
    ["漂浮可通行"] = true,
    ["成功特效路径"] = "Objects\\Spawnmodels\\Naga\\NagaDeath\\NagaDeath.mdl",
    ["成功特效持续秒"] = 2,
    ["失败提示"] = "鱼竿没有钓到任何东西。",
    ["物品结果列表"] = {
        {["随机最小值"] = 6, ["随机最大值"] = 10, ["物品ID"] = "黄金鱼#I031"},
        {["随机最小值"] = 11, ["随机最大值"] = 20, ["物品ID"] = "白鳍鱼#I030"},
        {["随机最小值"] = 21, ["随机最大值"] = 30, ["物品ID"] = "淡水鱼（超大）#I02Z"},
        {["随机最小值"] = 31, ["随机最大值"] = 40, ["物品ID"] = "淡水鱼（大）#I02Y"},
        {["随机最小值"] = 41, ["随机最大值"] = 50, ["物品ID"] = "淡水鱼（普通）#I02W"},
        {["随机最小值"] = 51, ["随机最大值"] = 75, ["物品ID"] = "淡水鱼（小）#I02X"}
    },
    ["单位结果列表"] = {
        {
            ["随机最小值"] = 74,
            ["随机最大值"] = 83,
            ["单位ID"] = "两栖鱼人#n02R",
            ["所有者"] = "中立敌对",
            ["最高英雄等级"] = 15,
            ["使用目标点"] = true,
            ["创建X"] = 0,
            ["创建Y"] = 0,
            ["创建面向角度"] = 0
        },
        {
            ["随机最小值"] = 74,
            ["随机最大值"] = 83,
            ["单位ID"] = "湖底元素#n02S",
            ["所有者"] = "中立被动",
            ["最低英雄等级"] = 19,
            ["重复刷新标记索引"] = 0,
            ["魔抗"] = 0.25,
            ["使用目标点"] = true,
            ["创建X"] = 0,
            ["创建Y"] = 0,
            ["创建面向角度"] = 0
        },
        {
            ["随机最小值"] = 84,
            ["随机最大值"] = 93,
            ["单位ID"] = "巨虾#n02T",
            ["所有者"] = "中立敌对",
            ["最高英雄等级"] = 15,
            ["使用目标点"] = true,
            ["创建X"] = 0,
            ["创建Y"] = 0,
            ["创建面向角度"] = 0
        },
        {
            ["随机最小值"] = 84,
            ["随机最大值"] = 93,
            ["单位ID"] = "龙虾守卫#n02U",
            ["所有者"] = "中立被动",
            ["最低英雄等级"] = 19,
            ["重复刷新标记索引"] = 1,
            ["魔抗"] = 0.25,
            ["使用目标点"] = true,
            ["创建X"] = 0,
            ["创建Y"] = 0,
            ["创建面向角度"] = 0
        },
        {
            ["随机最小值"] = 94,
            ["随机最大值"] = 100,
            ["单位ID"] = "人类渔夫#n01K",
            ["所有者"] = "玩家6",
            ["重复刷新标记索引"] = 8,
            ["创建X"] = 23347.1,
            ["创建Y"] = -29831.3,
            ["创建面向角度"] = 90,
            ["是否把施法者移动到创建点"] = true,
            ["施法者移动X"] = 21615.2,
            ["施法者移动Y"] = -29218.3
        }
    }
}
return ____exports
