/** @noSelfInFile */

import { 注册瑟兰迪尔执法印记 } from "./04．执法印记";
import { 注册瑟兰迪尔月光枷锁 } from "./05．月光枷锁";
import { 注册瑟兰迪尔精灵箭阵 } from "./06．精灵箭阵";
import { 注册瑟兰迪尔秩序领域 } from "./07．秩序领域";
import { 注册瑟兰迪尔审判之环 } from "./08．审判之环";
import { 注册瑟兰迪尔罪与罚 } from "./09．罪与罚";
import { 注册瑟兰迪尔律法召唤 } from "./10．律法召唤";
import { 注册瑟兰迪尔月光灌注 } from "./11．月光灌注";
import { 注册瑟兰迪尔终末审判 } from "./12．终末审判";
import { 注册瑟兰迪尔月光碎片 } from "./14．月光碎片";

export function 注册瑟兰迪尔技能结构(this: void): void {
  注册瑟兰迪尔执法印记();
  注册瑟兰迪尔月光枷锁();
  注册瑟兰迪尔精灵箭阵();
  注册瑟兰迪尔秩序领域();
  注册瑟兰迪尔审判之环();
  注册瑟兰迪尔罪与罚();
  注册瑟兰迪尔律法召唤();
  注册瑟兰迪尔月光灌注();
  注册瑟兰迪尔终末审判();
  注册瑟兰迪尔月光碎片();
}
