--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
---
-- @noSelfInFile
____exports["一方通行单位技能配置"] = {
    ["英雄名"] = "一方通行",
    ["单位类型ID"] = "H00I",
    ["矢量反射开启技能ID"] = "A0DV",
    ["矢量反射关闭技能ID"] = "A0DS",
    ["矢量反射范围"] = 300,
    ["弹幕扫描间隔毫秒"] = 20,
    ["普攻反射受伤倍率"] = 1,
    ["普攻反射攻击力倍率"] = 1,
    ["普攻反射魔法消耗倍率"] = 1.15,
    ["技能弹幕最大魔法消耗比例"] = 0.06,
    ["强制关闭魔法比例"] = 0.1,
    ["强制关闭固定冷却秒"] = 10,
    ["反射弹幕速度倍率"] = 1.5,
    ["普攻反射弹幕最大距离"] = 1500,
    ["普攻反射弹幕命中半径"] = 150,
    ["普攻反射弹幕默认速度"] = 900,
    ["普攻反射弹幕基础高度"] = 75,
    ["反射伤害标签"] = "一方通行-矢量反射"
}
return ____exports
