--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
____exports["英雄技能成长配置表"] = {{["英雄ID"] = "H015", ["技能ID"] = "A0K2", ["属性"] = {{["属性名"] = "光属性伤害", ["每级增量"] = 0.02}, {["属性名"] = "暴击率", ["每级增量"] = 0.02}}}, {["英雄ID"] = "H013", ["技能ID"] = "A0J6", ["属性"] = {{["处理方式"] = "玩家属性", ["属性名"] = "魔法恢复", ["每级增量"] = 1}, {["处理方式"] = "英雄智力", ["属性名"] = "智力", ["每级增量"] = 8}, {["处理方式"] = "玩家属性", ["属性名"] = "技能治疗率", ["每级增量"] = 0.04, ["初始增量"] = 0.1}}}, {["英雄ID"] = "H012", ["技能ID"] = "A0J1", ["属性"] = {{["处理方式"] = "护甲", ["属性名"] = "护甲", ["每级增量"] = 2, ["初始增量"] = 8}, {["处理方式"] = "玩家属性", ["属性名"] = "被暴击率", ["每级增量"] = -0.01}, {["处理方式"] = "玩家属性", ["属性名"] = "眩晕抗性", ["每级增量"] = 0.01, ["初始增量"] = 0.1}}}}
return ____exports
