--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
____exports["Boss战斗启动护卫配置表"] = {{["Boss单位ID"] = "o000", ["Boss单位名"] = "蛇之遗迹看守者-奢隆", ["初始护卫批次"] = {["广播说话者"] = "Boss", ["广播文案池"] = {"上！阻止任何想进入神殿的入侵者"}, ["单位列表"] = {{
    ["单位ID"] = "nbds",
    ["单位名"] = "蛇之看守者(精英)",
    X = 27930.9,
    Y = 13411.4,
    ["面向"] = 270,
    ["出生特效模型"] = "Abilities\\Spells\\Demon\\DarkConversion\\ZombifyTarget.mdl",
    ["出生特效持续秒"] = 1.5,
    ["主Boss死亡时立刻死亡"] = true
}, {
    ["单位ID"] = "nbds",
    ["单位名"] = "蛇之看守者(精英)",
    X = 28982.1,
    Y = 13233.3,
    ["面向"] = 270,
    ["出生特效模型"] = "Abilities\\Spells\\Demon\\DarkConversion\\ZombifyTarget.mdl",
    ["出生特效持续秒"] = 1.5,
    ["主Boss死亡时立刻死亡"] = true
}}}}, {["Boss单位ID"] = "nbdo", ["Boss单位名"] = "蛇之领主-奢恩", ["初始护卫批次"] = {["单位列表"] = {{
    ["单位ID"] = "nbdw",
    ["单位名"] = "蛇之护卫",
    X = 27930.9,
    Y = 13411.4,
    ["面向"] = 270,
    ["额外最大生命"] = 2000,
    ["出生特效模型"] = "Abilities\\Spells\\Demon\\DarkConversion\\ZombifyTarget.mdl",
    ["出生特效持续秒"] = 1,
    ["主Boss死亡时立刻死亡"] = true
}, {
    ["单位ID"] = "nbdw",
    ["单位名"] = "蛇之护卫",
    X = 28982.1,
    Y = 13233.3,
    ["面向"] = 270,
    ["额外最大生命"] = 2000,
    ["出生特效模型"] = "Abilities\\Spells\\Demon\\DarkConversion\\ZombifyTarget.mdl",
    ["出生特效持续秒"] = 1,
    ["主Boss死亡时立刻死亡"] = true
}}}, ["周期护卫批次"] = {["间隔毫秒"] = 42500, ["广播说话者"] = "护卫", ["广播文案池"] = {"进攻！粉碎入侵者", "奢恩大人，我们来帮助你赶跑入侵者"}, ["单位列表"] = {{
    ["单位ID"] = "nbdw",
    ["单位名"] = "蛇之护卫",
    X = 27930.9,
    Y = 13411.4,
    ["面向"] = 270,
    ["额外最大生命"] = 2000,
    ["出生特效模型"] = "Abilities\\Spells\\Demon\\DarkConversion\\ZombifyTarget.mdl",
    ["出生特效持续秒"] = 1,
    ["主Boss死亡时立刻死亡"] = true
}, {
    ["单位ID"] = "nbds",
    ["单位名"] = "蛇之看守者(精英)",
    X = 28982.1,
    Y = 13233.3,
    ["面向"] = 270,
    ["额外最大生命"] = 2000,
    ["出生特效模型"] = "Abilities\\Spells\\Demon\\DarkConversion\\ZombifyTarget.mdl",
    ["出生特效持续秒"] = 1,
    ["主Boss死亡时立刻死亡"] = true
}}}}, {["Boss单位ID"] = "N03O", ["Boss单位名"] = "恶魔领袖", ["初始护卫批次"] = {["广播说话者"] = "护卫", ["广播文案池"] = {"大人，我们来助您一臂之力。", "大人，这里的麻烦交给我们处理。", "大人，察觉您这边有变，我们立刻赶回来了。"}, ["后续对白"] = {{["延迟毫秒"] = 3000, ["说话者"] = "Boss", ["文案池"] = {"很好，你们来得正是时候。此战若胜，少不了你们的奖赏。"}}, {["延迟毫秒"] = 5000, ["说话者"] = "护卫", ["文案池"] = {"愿为大人效死力。"}}}, ["单位列表"] = {{
    ["单位ID"] = "n03N",
    ["单位名"] = "恶魔队长",
    X = 26803,
    Y = 20921.8,
    ["面向"] = 270,
    ["暴击率"] = 0.4,
    ["普攻伤害吸血"] = 0.75,
    ["主Boss死亡时立刻死亡"] = false
}, {
    ["单位ID"] = "n03N",
    ["单位名"] = "恶魔队长",
    X = 26203,
    Y = 20921.8,
    ["面向"] = 270,
    ["暴击率"] = 0.4,
    ["普攻伤害吸血"] = 0.75,
    ["主Boss死亡时立刻死亡"] = false
}}}}}
return ____exports
