local ____lualib = require("lualib_bundle")
local __TS__SparseArrayNew = ____lualib.__TS__SparseArrayNew
local __TS__SparseArrayPush = ____lualib.__TS__SparseArrayPush
local __TS__SparseArraySpread = ____lualib.__TS__SparseArraySpread
local ____exports = {}
local ____00_FF0E_4E3B_52A8_6280_80FD_88C5_5907_540D = require("系统.02．物品系统.15．装备技能.03．主动技能.00．公共.00．主动技能装备名")
local _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0 = ____00_FF0E_4E3B_52A8_6280_80FD_88C5_5907_540D["主动技能装备名称"]
local ____00_FF0E_4F24_5BB3_4E8B_4EF6_914D_7F6E_8868 = require("系统.02．物品系统.15．装备技能.04．伤害事件.00．公共.00．伤害事件配置表")
local _____4F24_5BB3_4E8B_4EF6_6D4B_8BD5_88C5_5907_987A_5E8F = ____00_FF0E_4F24_5BB3_4E8B_4EF6_914D_7F6E_8868["伤害事件测试装备顺序"]
local ____01_FF0E_7269_54C1_4F7F_7528_914D_7F6E_8868 = require("系统.02．物品系统.15．装备技能.05．物品使用.00．公共.01．物品使用配置表")
local _____7269_54C1_4F7F_7528_6D4B_8BD5_88C5_5907_987A_5E8F = ____01_FF0E_7269_54C1_4F7F_7528_914D_7F6E_8868["物品使用测试装备顺序"]
____exports["物品主动技能测试命令列表"] = {
    "wp1",
    "wp2",
    "wp3",
    "wp4",
    "wp5",
    "wp6",
    "wp7",
    "wp8",
    "wp9",
    "wp10",
    "wp11",
    "wp12",
    "wp13",
    "wp14",
    "wp15",
    "wp16",
    "wp17",
    "wp18",
    "wp19",
    "wp20",
    "wp21",
    "wp22",
    "wp23",
    "wp24",
    "wp25",
    "wp26",
    "wp27",
    "wp28",
    "wp29",
    "wp30",
    "wp31",
    "wp32",
    "wp33",
    "wp34",
    "wp35",
    "wp36",
    "wp37",
    "wp38",
    "wp39",
    "wp40",
    "wp41",
    "wp42",
    "wp43",
    "wp44",
    "wp45",
    "wp46",
    "wp47",
    "wp48",
    "wp49",
    "wp50",
    "wp51",
    "wp52",
    "wp53",
    "wp54",
    "wp55",
    "wp56",
    "wp57",
    "wp58",
    "wp59",
    "wp60",
    "wp61",
    "wp62",
    "wp63",
    "wp64",
    "wp65",
    "wp66",
    "wp67",
    "wp68",
    "wp69",
    "wp70",
    "wp71",
    "wp72",
    "wp73",
    "wp74",
    "wp75",
    "wp76",
    "wp77",
    "wp78",
    "wp79",
    "wp80",
    "wp81",
    "wp82"
}
local ____array_0 = __TS__SparseArrayNew(
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["回沙之书"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["女妖头饰"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["黑牧杖"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["熔岩权杖"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["破血之戒"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["战士大衣"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["比安血爪"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["地狱火卡牌"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["巨魔大剑"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["远古毒咒护符"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["史莱姆粘液瓶"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["地精钥匙"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["祭祀之杖"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["幽冥法杖"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["熔岩恶魔之灵眼"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["暗幽亡戒"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["使者魔炉"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["汭冥血杖"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["汭冥血杖强化"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["使者精神魔杖"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["史诗远古魔刃"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["焰虚宝珠"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["先祖之狱杖"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["咆哮之心"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["指挥之剑"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["使者魔轮"],
    table.unpack(_____4F24_5BB3_4E8B_4EF6_6D4B_8BD5_88C5_5907_987A_5E8F)
)
__TS__SparseArrayPush(
    ____array_0,
    table.unpack(_____7269_54C1_4F7F_7528_6D4B_8BD5_88C5_5907_987A_5E8F)
)
__TS__SparseArrayPush(
    ____array_0,
    "冥炎之裙",
    "邪恶之心",
    "祭祀面具",
    "守护之盾",
    "高原魔力灯笼",
    "熔岩宝石",
    "亡之魔杯",
    "熔墓守卫护符",
    "狱生面具",
    "狱生面具强化",
    "史莱姆粘液"
)
____exports["物品主动技能测试清理装备列表"] = {__TS__SparseArraySpread(____array_0)}
local ____array_1 = __TS__SparseArrayNew(
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["回沙之书"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["女妖头饰"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["黑牧杖"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["熔岩权杖"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["破血之戒"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["战士大衣"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["比安血爪"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["地狱火卡牌"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["巨魔大剑"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["远古毒咒护符"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["史莱姆粘液瓶"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["地精钥匙"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["祭祀之杖"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["幽冥法杖"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["熔岩恶魔之灵眼"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["暗幽亡戒"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["使者魔炉"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["汭冥血杖"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["汭冥血杖强化"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["使者精神魔杖"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["史诗远古魔刃"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["焰虚宝珠"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["先祖之狱杖"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["咆哮之心"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["指挥之剑"],
    _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["使者魔轮"],
    table.unpack(_____4F24_5BB3_4E8B_4EF6_6D4B_8BD5_88C5_5907_987A_5E8F)
)
__TS__SparseArrayPush(
    ____array_1,
    table.unpack(_____7269_54C1_4F7F_7528_6D4B_8BD5_88C5_5907_987A_5E8F)
)
__TS__SparseArrayPush(
    ____array_1,
    "冥炎之裙",
    "邪恶之心",
    "祭祀面具",
    "守护之盾",
    "高原魔力灯笼",
    "熔岩宝石",
    "亡之魔杯",
    "熔墓守卫护符",
    "狱生面具",
    "狱生面具强化",
    "史莱姆粘液"
)
____exports["物品主动技能测试发放顺序"] = {__TS__SparseArraySpread(____array_1)}
local function _____751F_6210_6D4B_8BD5_547D_4EE4_8BF4_660E_5217_8868()
    local list = {}
    local count = #____exports["物品主动技能测试命令列表"] < #____exports["物品主动技能测试发放顺序"] and #____exports["物品主动技能测试命令列表"] or #____exports["物品主动技能测试发放顺序"]
    do
        local i = 0
        while i < count do
            list[#list + 1] = {["序号"] = i + 1, ["命令"] = ____exports["物品主动技能测试命令列表"][i + 1], ["装备名"] = ____exports["物品主动技能测试发放顺序"][i + 1]}
            i = i + 1
        end
    end
    return list
end
local function _____751F_6210_6D4B_8BD5_547D_4EE4_8BF4_660E_6587_672C_5217_8868()
    local list = {}
    local _____8BF4_660E_5217_8868 = _____751F_6210_6D4B_8BD5_547D_4EE4_8BF4_660E_5217_8868()
    do
        local i = 0
        while i < #_____8BF4_660E_5217_8868 do
            local _____8BF4_660E = _____8BF4_660E_5217_8868[i + 1]
            list[#list + 1] = (((tostring(_____8BF4_660E["序号"]) .. ".") .. _____8BF4_660E["命令"]) .. "=") .. _____8BF4_660E["装备名"]
            i = i + 1
        end
    end
    return list
end
____exports["物品主动技能测试命令说明列表"] = _____751F_6210_6D4B_8BD5_547D_4EE4_8BF4_660E_5217_8868()
____exports["物品主动技能测试命令说明文本列表"] = _____751F_6210_6D4B_8BD5_547D_4EE4_8BF4_660E_6587_672C_5217_8868()
return ____exports
