/** @noSelfInFile */

export type 游戏难度配置 = {
  难度值: number;
  按钮文本: string;
  难度标题: string;
  团队复活次数: number;
  弱点数量: number;
  敌方普通生命科技ID?: string;
  敌方普通生命科技等级?: number;
  敌方精英Boss生命科技ID?: string;
  敌方精英Boss生命科技等级?: number;
  敌方攻击光环技能名?: string;
  敌方攻击光环等级?: number;
  难度使者单位名?: string;
  公告文本: string;
};

export const 游戏难度选择延迟秒 = 11;
export const 游戏难度全局变量名 = "udg_N";
export const 弱点数量全局变量名 = "udg_R";

export const 游戏难度配置表: ReadonlyArray<游戏难度配置> = [
  {
    难度值: 1,
    按钮文本: "一即是全，全即是一（难度1，未熟练推荐）",
    难度标题: "一即是全，全即是一",
    团队复活次数: 9999,
    弱点数量: 6,
    敌方攻击光环技能名: "难度攻击力奖励%",
    难度使者单位名: "负面buff使者（难度）",
    公告文本: "在该模式下无任何影响，团队复活次数 9999 次。",
  },
  {
    难度值: 2,
    按钮文本: "一切的开始（难度2，略有难度）",
    难度标题: "一切的开始",
    团队复活次数: 100,
    弱点数量: 6,
    敌方精英Boss生命科技ID: "R002",
    敌方精英Boss生命科技等级: 4,
    敌方攻击光环技能名: "难度攻击力奖励%",
    敌方攻击光环等级: 2,
    难度使者单位名: "负面buff使者（难度）",
    公告文本: "敌方血量为 130%（小怪 100%），攻击力为 115%，团队复活次数 100 次。",
  },
  {
    难度值: 3,
    按钮文本: "寻找真相（难度3，较有难度，单人游玩极限，推荐2人）",
    难度标题: "寻找真相",
    团队复活次数: 75,
    弱点数量: 6,
    敌方普通生命科技ID: "R001",
    敌方普通生命科技等级: 4,
    敌方精英Boss生命科技ID: "R002",
    敌方精英Boss生命科技等级: 4,
    敌方攻击光环技能名: "难度攻击力奖励%",
    敌方攻击光环等级: 3,
    难度使者单位名: "负面buff使者（难度）",
    公告文本: "敌方血量为 160%（小怪 130%），攻击力为 135%，团队复活次数 75 次。",
  },
  {
    难度值: 4,
    按钮文本: "|cffff99cc梦中的世界|r（难度4，难度开始明显提高，推荐2人对游戏熟练）",
    难度标题: "梦中的世界",
    团队复活次数: 60,
    弱点数量: 5,
    敌方普通生命科技ID: "R001",
    敌方普通生命科技等级: 6,
    敌方精英Boss生命科技ID: "R002",
    敌方精英Boss生命科技等级: 7,
    敌方攻击光环技能名: "难度攻击力奖励%",
    敌方攻击光环等级: 4,
    难度使者单位名: "负面buff使者（难度）",
    公告文本: "敌方血量为 210%（小怪 150%），攻击力为 150%，团队复活次数 60 次。",
  },
  {
    难度值: 5,
    按钮文本: "|cffcc99ff虚幻的命运|r（难度5，推荐3名玩家对游戏熟练）",
    难度标题: "虚幻的命运",
    团队复活次数: 45,
    弱点数量: 5,
    敌方普通生命科技ID: "R001",
    敌方普通生命科技等级: 8,
    敌方精英Boss生命科技ID: "R002",
    敌方精英Boss生命科技等级: 11,
    敌方攻击光环技能名: "难度攻击力奖励%",
    敌方攻击光环等级: 5,
    难度使者单位名: "负面buff使者（难度）",
    公告文本: "敌方血量为 270%（小怪 170%），攻击力为 170%，团队复活次数 45 次。",
  },
  {
    难度值: 6,
    按钮文本: "|cffff00ff挣扎的命运|r（最高难度，要求3名玩家对游戏极为熟练）",
    难度标题: "挣扎的命运",
    团队复活次数: 30,
    弱点数量: 5,
    敌方普通生命科技ID: "R001",
    敌方普通生命科技等级: 11,
    敌方精英Boss生命科技ID: "R002",
    敌方精英Boss生命科技等级: 14,
    敌方攻击光环技能名: "难度攻击力奖励%",
    敌方攻击光环等级: 6,
    难度使者单位名: "负面buff使者（难度）",
    公告文本: "敌方血量为 330%（小怪 200%），攻击力为 190%，团队复活次数 30 次。",
  },
] as const;

export default 游戏难度配置表;
