--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____04_FF0E_5F3A_5316_666E_653B = require("系统.03．技能系统.00．技能模板+函数.01．技能函数.21．攻击效果.04．强化普攻")
local _____6DFB_52A0_5F3A_5316_666E_653B = ____04_FF0E_5F3A_5316_666E_653B["添加强化普攻"]
local _____6E05_9664_5F3A_5316_666E_653B = ____04_FF0E_5F3A_5316_666E_653B["清除强化普攻"]
local _____83B7_53D6_5F3A_5316_666E_653B_72B6_6001 = ____04_FF0E_5F3A_5316_666E_653B["获取强化普攻状态"]
local _____5355_4F4D_62E5_6709_5F3A_5316_666E_653B = ____04_FF0E_5F3A_5316_666E_653B["单位拥有强化普攻"]
local function _____53D6_5F3A_5316_666E_653B_5355_4F4D(_____53C2_6570)
    if _____53C2_6570["Boss单位"] ~= nil and _____53C2_6570["Boss单位"] ~= 0 then
        return _____53C2_6570["Boss单位"]
    end
    return _____53C2_6570["单位"]
end
local function _____53D6_5F3A_5316_666E_653B_6301_7EED_79D2(_____53C2_6570)
    if _____53C2_6570["持续秒"] ~= nil then
        return _____53C2_6570["持续秒"]
    end
    return _____53C2_6570["持续时间"]
end
____exports["添加下一次普攻强化"] = function(_____53C2_6570)
    if _____53C2_6570 == nil then
        return false
    end
    local ____6DFB_52A0_5F3A_5316_666E_653B_10 = _____6DFB_52A0_5F3A_5316_666E_653B
    local ____53D6_5F3A_5316_666E_653B_5355_4F4D_result_1 = _____53D6_5F3A_5316_666E_653B_5355_4F4D(_____53C2_6570)
    local ____53C2_6570__540D_79F0_2 = _____53C2_6570["名称"]
    local ____53D6_5F3A_5316_666E_653B_6301_7EED_79D2_result_3 = _____53D6_5F3A_5316_666E_653B_6301_7EED_79D2(_____53C2_6570)
    local ____53C2_6570__6301_7EED_6BEB_79D2_4 = _____53C2_6570["持续毫秒"]
    local ____temp_5 = _____53C2_6570["次数"] or _____53C2_6570["最多强化次数"] or 1
    local ____53C2_6570__4F24_5BB3_500D_7387_6 = _____53C2_6570["伤害倍率"]
    local ____53C2_6570__989D_5916_4F24_5BB3_7 = _____53C2_6570["额外伤害"]
    local ____53C2_6570__4EC5_8FDC_7A0B_8 = _____53C2_6570["仅远程"]
    local ____53C2_6570__4EC5_8FD1_6218_9 = _____53C2_6570["仅近战"]
    local ____temp_0
    if _____53C2_6570["只认纯普攻"] == true then
        ____temp_0 = false
    else
        ____temp_0 = _____53C2_6570["允许技能普攻"]
    end
    return ____6DFB_52A0_5F3A_5316_666E_653B_10({
        ["单位"] = ____53D6_5F3A_5316_666E_653B_5355_4F4D_result_1,
        ["名称"] = ____53C2_6570__540D_79F0_2,
        ["持续时间"] = ____53D6_5F3A_5316_666E_653B_6301_7EED_79D2_result_3,
        ["持续毫秒"] = ____53C2_6570__6301_7EED_6BEB_79D2_4,
        ["次数"] = ____temp_5,
        ["伤害倍率"] = ____53C2_6570__4F24_5BB3_500D_7387_6,
        ["额外伤害"] = ____53C2_6570__989D_5916_4F24_5BB3_7,
        ["仅远程"] = ____53C2_6570__4EC5_8FDC_7A0B_8,
        ["仅近战"] = ____53C2_6570__4EC5_8FD1_6218_9,
        ["允许技能普攻"] = ____temp_0,
        ["弹道"] = _____53C2_6570["弹道"],
        ["恢复弹道"] = _____53C2_6570["恢复弹道"],
        ["on命中"] = _____53C2_6570["on命中"],
        ["on结束"] = _____53C2_6570["on结束"]
    })
end
____exports["清除下一次普攻强化"] = function(_____5355_4F4D, _____540D_79F0)
    _____6E05_9664_5F3A_5316_666E_653B(_____5355_4F4D, _____540D_79F0)
end
____exports["获取下一次普攻强化状态"] = function(_____5355_4F4D, _____540D_79F0)
    return _____83B7_53D6_5F3A_5316_666E_653B_72B6_6001(_____5355_4F4D, _____540D_79F0)
end
____exports["单位拥有下一次普攻强化"] = function(_____5355_4F4D, _____540D_79F0)
    return _____5355_4F4D_62E5_6709_5F3A_5316_666E_653B(_____5355_4F4D, _____540D_79F0)
end
____exports["添加Boss下一次普攻强化"] = function(_____53C2_6570)
    return ____exports["添加下一次普攻强化"](_____53C2_6570)
end
____exports["清除Boss下一次普攻强化"] = function(_____5355_4F4D, _____540D_79F0)
    ____exports["清除下一次普攻强化"](_____5355_4F4D, _____540D_79F0)
end
____exports["获取Boss下一次普攻强化状态"] = function(_____5355_4F4D, _____540D_79F0)
    return ____exports["获取下一次普攻强化状态"](_____5355_4F4D, _____540D_79F0)
end
____exports["Boss拥有下一次普攻强化"] = function(_____5355_4F4D, _____540D_79F0)
    return ____exports["单位拥有下一次普攻强化"](_____5355_4F4D, _____540D_79F0)
end
return ____exports
