--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____04_FF0E_6267_6CD5_5370_8BB0 = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.02．瑟兰迪尔.04．执法印记")
local _____6CE8_518C_745F_5170_8FEA_5C14_6267_6CD5_5370_8BB0 = ____04_FF0E_6267_6CD5_5370_8BB0["注册瑟兰迪尔执法印记"]
local ____05_FF0E_6708_5149_67B7_9501 = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.02．瑟兰迪尔.05．月光枷锁")
local _____6CE8_518C_745F_5170_8FEA_5C14_6708_5149_67B7_9501 = ____05_FF0E_6708_5149_67B7_9501["注册瑟兰迪尔月光枷锁"]
local ____06_FF0E_7CBE_7075_7BAD_9635 = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.02．瑟兰迪尔.06．精灵箭阵")
local _____6CE8_518C_745F_5170_8FEA_5C14_7CBE_7075_7BAD_9635 = ____06_FF0E_7CBE_7075_7BAD_9635["注册瑟兰迪尔精灵箭阵"]
local ____09_FF0E_7F6A_4E0E_7F5A = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.02．瑟兰迪尔.09．罪与罚")
local _____6CE8_518C_745F_5170_8FEA_5C14_7F6A_4E0E_7F5A = ____09_FF0E_7F6A_4E0E_7F5A["注册瑟兰迪尔罪与罚"]
local ____10_FF0E_5F8B_6CD5_53EC_5524 = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.02．瑟兰迪尔.10．律法召唤")
local _____6CE8_518C_745F_5170_8FEA_5C14_5F8B_6CD5_53EC_5524 = ____10_FF0E_5F8B_6CD5_53EC_5524["注册瑟兰迪尔律法召唤"]
local ____14_FF0E_6708_5149_788E_7247 = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.02．瑟兰迪尔.14．月光碎片")
local _____6CE8_518C_745F_5170_8FEA_5C14_6708_5149_788E_7247 = ____14_FF0E_6708_5149_788E_7247["注册瑟兰迪尔月光碎片"]
local ____16_FF0E_6280_80FD_8C03_5EA6 = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.02．瑟兰迪尔.16．技能调度")
local _____6CE8_518C_745F_5170_8FEA_5C14_6280_80FD_8C03_5EA6 = ____16_FF0E_6280_80FD_8C03_5EA6["注册瑟兰迪尔技能调度"]
____exports["注册瑟兰迪尔技能结构"] = function()
    _____6CE8_518C_745F_5170_8FEA_5C14_6267_6CD5_5370_8BB0()
    _____6CE8_518C_745F_5170_8FEA_5C14_6708_5149_67B7_9501()
    _____6CE8_518C_745F_5170_8FEA_5C14_7CBE_7075_7BAD_9635()
    _____6CE8_518C_745F_5170_8FEA_5C14_7F6A_4E0E_7F5A()
    _____6CE8_518C_745F_5170_8FEA_5C14_5F8B_6CD5_53EC_5524()
    _____6CE8_518C_745F_5170_8FEA_5C14_6708_5149_788E_7247()
    _____6CE8_518C_745F_5170_8FEA_5C14_6280_80FD_8C03_5EA6()
end
return ____exports
