--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
____exports["旧环境互动配置表"] = {
    {
        ID = "旧环境互动.隐藏木桩",
        ["类型"] = "隐藏木桩",
        X = -27990.8,
        Y = -7833.4,
        ["触发范围"] = 300,
        ["一次性"] = true,
        ["提示文本"] = "意外发现了藏在空木桩里的物品。"
    },
    {
        ID = "旧环境互动.普通提示",
        ["类型"] = "普通提示",
        X = -25991.2,
        Y = -11029.4,
        ["触发范围"] = 800,
        ["一次性"] = false,
        ["提示文本"] = "这里似乎隐藏着什么，需要继续探索。"
    },
    {
        ID = "旧环境互动.Boss入口",
        ["类型"] = "Boss入口",
        X = -27048.9,
        Y = -17664.8,
        ["触发范围"] = 300,
        ["一次性"] = true,
        ["提示文本"] = "封印被打开了，史莱姆Boss即将出现。"
    },
    {
        ID = "旧环境互动.魔法书",
        ["类型"] = "物品奖励",
        X = 16556.1,
        Y = -29798.6,
        ["一次性"] = true,
        ["提示文本"] = "发现了一本魔法书！",
        ["奖励物品ID"] = "自然魔书#I0D9"
    },
    {
        ID = "旧环境互动.精灵打造图纸",
        ["类型"] = "物品奖励",
        X = 16910.5,
        Y = -29237.1,
        ["一次性"] = true,
        ["提示文本"] = "发现了古时候精灵族的打造图纸。",
        ["奖励物品ID"] = "森灵圣枪打造图纸#I0D8"
    },
    {
        ID = "旧环境互动.小道具",
        ["类型"] = "物品奖励",
        X = -27944.3,
        Y = 3339.8,
        ["一次性"] = true,
        ["提示文本"] = "发现了一个小道具！",
        ["奖励物品ID"] = "沙之饰品#I0DB"
    }
}
____exports["旧环境互动Boss单位ID"] = "史莱姆#n001"
____exports["旧环境互动隐藏木桩奖励物品ID列表"] = {"伊达之果#I03W", "智力斗篷+1#ram1", "防御指环+1#rde1"}
return ____exports
