--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____index = require("系统.03．技能系统.00．技能模板+函数.01．技能函数.01．弹幕.01．TS原生弹幕.index")
local _____521B_5EFA_539F_751F_5F39_5E55 = ____index["创建原生弹幕"]
local ____index = require("系统.03．技能系统.00．技能模板+函数.01．技能函数.01．弹幕.02．弹道跳链.index")
local _____5F00_59CB_5F39_9053_8DF3_94FE = ____index["开始弹道跳链"]
local jass = require("jass.common")
local GetUnitX = jass.GetUnitX
local GetUnitY = jass.GetUnitY
local GetUnitFacing = jass.GetUnitFacing
____exports["发射弹道命中跳链示例"] = function(_____53C2_6570)
    if _____53C2_6570["施法者"] == nil or _____53C2_6570["施法者"] == 0 then
        return
    end
    if _____53C2_6570["初始目标"] == nil or _____53C2_6570["初始目标"] == 0 then
        return
    end
    _____521B_5EFA_539F_751F_5F39_5E55({
        ["所有者"] = _____53C2_6570["施法者"],
        X = GetUnitX(_____53C2_6570["施法者"]),
        Y = GetUnitY(_____53C2_6570["施法者"]),
        ["方向角"] = GetUnitFacing(_____53C2_6570["施法者"]),
        ["弹幕单位类型"] = _____53C2_6570["弹幕单位类型"],
        ["附着特效模型"] = _____53C2_6570["附着特效模型"],
        ["速度"] = _____53C2_6570["弹幕速度"] or 700,
        ["轨迹类型"] = "追踪",
        ["指定目标"] = _____53C2_6570["初始目标"],
        ["命中半径"] = 80,
        ["伤害值"] = _____53C2_6570["主弹伤害"] or 100,
        ["碰撞消失"] = true,
        ["生命周期"] = 4,
        ["目标筛选"] = function(_____5355_4F4D)
            return _____5355_4F4D == _____53C2_6570["初始目标"]
        end,
        ["on命中"] = function(_____76EE_6807_5355_4F4D)
            _____5F00_59CB_5F39_9053_8DF3_94FE({
                ["施法者"] = _____53C2_6570["施法者"],
                ["初始目标"] = _____76EE_6807_5355_4F4D,
                ["跳跃次数"] = _____53C2_6570["跳链次数"] or 3,
                ["搜索半径"] = _____53C2_6570["跳链搜索半径"] or 500,
                ["弹幕速度"] = _____53C2_6570["弹幕速度"] or 700,
                ["命中半径"] = 80,
                ["伤害值"] = _____53C2_6570["跳链伤害"] or 60,
                ["每跳伤害系数"] = 0.8,
                ["每单位只命中一次"] = true,
                ["弹幕单位类型"] = _____53C2_6570["弹幕单位类型"],
                ["附着特效模型"] = _____53C2_6570["附着特效模型"]
            })
        end
    })
end
return ____exports
