--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____00_FF0E_4E3B_52A8_6280_80FD_88C5_5907_540D = require("系统.02．物品系统.15．装备技能.03．主动技能.00．公共.00．主动技能装备名")
local _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0 = ____00_FF0E_4E3B_52A8_6280_80FD_88C5_5907_540D["主动技能装备名称"]
____exports["战士大衣配置"] = {["装备名称"] = _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["战士大衣"], ["附加攻击"] = 4, ["持续时间"] = 6}
____exports["比安血爪配置"] = {["装备名称"] = _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["比安血爪"], ["附加攻击"] = 8, ["持续时间"] = 10}
____exports["巨魔大剑配置"] = {
    ["装备名称"] = _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["巨魔大剑"],
    ["标记名"] = "JMDJ11",
    ["持续时间"] = 1,
    ["扩散半径"] = 300,
    ["扩散百分比"] = 0.8,
    ["扩散特效路径"] = "Abilities\\Spells\\Human\\Thunderclap\\ThunderClapCaster.mdl",
    ["扩散特效持续时间"] = 1
}
return ____exports
