--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____05_FF0E_7D27_51D1_5267_60C5_7247_6BB5_7F16_8BD1 = require("系统.11．剧情系统.01．主线任务.00．剧情系统核心工具.05．紧凑剧情片段编译")
local _____7F16_8BD1_7D27_51D1_5267_60C5_7247_6BB5 = ____05_FF0E_7D27_51D1_5267_60C5_7247_6BB5_7F16_8BD1["编译紧凑剧情片段"]
____exports["地精洞窟演出紧凑剧情片段"] = {
    ["片段ID"] = "jlc_goblin_cave_intro",
    ["名称"] = "地精洞窟演出",
    ["触发条件"] = "剧情进度 == 1 且玩家进入地精洞窟区域",
    ["可Esc整段跳过"] = true,
    ["默认倍速"] = 1,
    ["默认对白持续时间"] = 3,
    ["对白列表"] = {{
        ["序号"] = 1,
        ["说话者"] = "系统",
        ["文本"] = "地精洞窟深处幽暗无光，祭坛周围弥散着令人不安的魔力。",
        ["持续时间"] = 4.6,
        ["使用原生电影系统"] = true
    }, {
        ["序号"] = 2,
        ["说话者"] = "地精祭祀",
        ["文本"] = "精灵的鲜血……果然能让祭火燃烧得更加旺盛。",
        ["持续时间"] = 4,
        ["使用原生电影系统"] = true
    }, {
        ["序号"] = 3,
        ["说话者"] = "地精祭祀",
        ["文本"] = "有了这份力量，森林里再没有谁能把地精踩在脚下！",
        ["持续时间"] = 4.4,
        ["使用原生电影系统"] = true
    }, {
        ["序号"] = 4,
        ["说话者"] = "地精祭祀",
        ["文本"] = "伟大的赐予者啊……我族必会献上您想要的一切。",
        ["持续时间"] = 4.2,
        ["使用原生电影系统"] = true
    }},
    ["动作时间线"] = {{
        ["序号"] = 1,
        ["挂点"] = "beforeDialog",
        ["对白序号"] = 1,
        ["动作ID"] = "JLC精灵村_地精洞窟演出前置",
        ["名称"] = "进入洞窟后切入地精洞窟演出",
        ["参数"] = {
            ["触发区域"] = "gg_rct______________020",
            ["设置剧情进度"] = 2,
            ["Boss键"] = "Boss.地精巫师",
            ["视角镜头"] = "gg_cam___________________005",
            ["开启电影模式"] = true,
            ["玩家英雄组暂停"] = true,
            ["玩家英雄组无敌"] = true,
            ["时间设为午夜"] = true,
            ["黑场滤镜持续时间"] = 2,
            ["旧JASS功能清单"] = "YDLocal1Set(Boss.地精巫师) / SetTimeOfDay / ForGroupBJ / YDUserDataSet(剧情进度=2) / CinematicModeBJ / CinematicFilterGenericBJ"
        }
    }, {
        ["序号"] = 2,
        ["挂点"] = "absoluteTime",
        ["时间秒"] = 1,
        ["动作ID"] = "JLC精灵村_地精洞窟演出一秒收尾",
        ["名称"] = "洞窟演出 1 秒后关闭黑幕并切换区域音乐",
        ["参数"] = {["关闭电影滤镜"] = true, ["关闭区域音乐"] = "gg_snd_JQBGM01 @ gg_rct______________102", ["开启区域音乐"] = "gg_snd_BGM002 @ gg_rct______________025", ["旧JASS功能清单"] = "DisplayCineFilter(false) / SetStackedSoundBJ(false, gg_snd_JQBGM01, gg_rct______________102) / SetStackedSoundBJ(true, gg_snd_BGM002, gg_rct______________025)"}
    }}
}
____exports["地精洞窟演出剧情片段"] = _____7F16_8BD1_7D27_51D1_5267_60C5_7247_6BB5(____exports["地精洞窟演出紧凑剧情片段"])
return ____exports
