--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____05_FF0E_7D27_51D1_5267_60C5_7247_6BB5_7F16_8BD1 = require("系统.11．剧情系统.01．主线任务.00．剧情系统核心工具.05．紧凑剧情片段编译")
local _____7F16_8BD1_7D27_51D1_5267_60C5_7247_6BB5 = ____05_FF0E_7D27_51D1_5267_60C5_7247_6BB5_7F16_8BD1["编译紧凑剧情片段"]
____exports["蛇人族入口紧凑剧情片段"] = {
    ["片段ID"] = "jlc_snake_territory_entry",
    ["名称"] = "蛇人族入口",
    ["触发条件"] = "剧情进度 == 7 且玩家进入蛇人族入口区域",
    ["可Esc整段跳过"] = true,
    ["默认倍速"] = 1,
    ["默认对白持续时间"] = 3,
    ["对白列表"] = {{["序号"] = 1, ["说话者"] = "守卫", ["文本"] = "人类？不是熟面孔。你们是从外面来的吧，来我|cffff9900『蛇人族』|r领地，所为何事？", ["持续时间"] = 4.4}, {["序号"] = 2, ["说话者"] = "玩家", ["文本"] = "几位好眼力。我等确实来自外界，此行只为同贵族做一笔交易。若方便，还请代为引荐。这点薄礼，请诸位收下。", ["持续时间"] = 6.8}, {["序号"] = 3, ["说话者"] = "守卫", ["文本"] = "嗯……也罢。看你们确实不是那几个人族熟客商人。这是人族来客用的标识令牌，带好，别弄丢了。有了它，你们在我族地界内便不会被当作擅闯者驱逐。我族的藏品商会就在东部王宫之前，你们过去寻管理人便是。", ["持续时间"] = 9.3}, {["序号"] = 4, ["说话者"] = "玩家", ["文本"] = "多谢诸位。", ["持续时间"] = 2}},
    ["动作时间线"] = {{
        ["序号"] = 1,
        ["挂点"] = "beforeDialog",
        ["对白序号"] = 1,
        ["动作ID"] = "SRZ蛇人族_领地入口",
        ["名称"] = "进入蛇人族领地",
        ["参数"] = {["触发进度"] = 7, ["目标进度"] = 8, ["触发区域"] = "gg_rct______________106", ["旧JASS功能清单"] = "RemoveRect / PauseUnit / Set剧情进度 / stop"}
    }, {
        ["序号"] = 2,
        ["挂点"] = "afterDialog",
        ["对白序号"] = 4,
        ["动作ID"] = "SRZ蛇人族_领地放行收尾",
        ["名称"] = "蛇人族入口放行后的扣费与任务刷新",
        ["参数"] = {
            ["扣除金币"] = 233,
            ["解锁视野"] = "gg_rct______________108, gg_rct______________107",
            ["小地图X"] = -20880.7,
            ["小地图Y"] = 3186.4,
            ["任务更新提示"] = "|cffffff00『主线目标』：|r前往『东边藏品处』询问『夜光翡翠』消息",
            ["旧JASS功能清单"] = "PauseUnit(false) / AdjustPlayerStateBJ / CreateFogModifierRectBJ / PingMinimap / QuestMessageBJ"
        }
    }}
}
____exports["蛇人族入口剧情片段"] = _____7F16_8BD1_7D27_51D1_5267_60C5_7247_6BB5(____exports["蛇人族入口紧凑剧情片段"])
return ____exports
