--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
____exports["蛇人族卫队长血线承接配置"] = {
    ["配置名"] = "蛇人族卫队长血线认输承接",
    ["需要剧情进度"] = 14,
    ["目标剧情进度"] = 15,
    ["单位ID"] = "N05L",
    ["血线阈值比例"] = 0.1,
    ["保底生命比例"] = 0.1,
    ["切换所属玩家ID"] = 6,
    ["目标单位无敌"] = true,
    ["暂停目标单位"] = true,
    ["区域音乐切换"] = {{["添加"] = false, ["声音变量名"] = "gg_snd_JQBGM02", ["矩形变量名"] = "gg_rct______________107"}, {["添加"] = true, ["声音变量名"] = "gg_snd_BGM019", ["矩形变量名"] = "gg_rct______________107"}},
    ["对白列表"] = {
        {["说话者"] = "利尔·伯特", ["文本"] = "没想到诸位实力如此出众，也确实通过了我的试炼。既然如此，我等再强拦你们也无意义，各位请吧。", ["持续时间"] = 4},
        {["说话者"] = "玩家", ["文本"] = "|cffffffcc冒昧问一句，|r|cffff0000贵族的宝物究竟是如何丢失的|r|cffffffcc？|r", ["持续时间"] = 2.5, ["使用攻击者名"] = true},
        {["说话者"] = "利尔·伯特", ["文本"] = "今早卫士巡逻时发现防御法阵出现波动，再追查时只瞥见一个人族身影。那人速度极快，卫士没能拦住。唉，也罢，我等会继续追查。给诸位添麻烦了。", ["持续时间"] = 6.5},
        {["说话者"] = "玩家", ["文本"] = "无妨。若我等之后寻到线索，自会告知贵族。也祝你们尽快找回失窃。", ["持续时间"] = 4, ["使用攻击者名"] = true},
        {["说话者"] = "利尔·伯特", ["文本"] = "如此，蛇人族便先谢过各位。若有消息，可来蛇人族皇宫门口寻我。", ["持续时间"] = 6.5}
    },
    ["清理Boss语义键"] = "蛇人族卫队长",
    ["清理目标YD表"] = true,
    ["移除目标单位"] = true,
    ["任务描述"] = "|cffffff00『主线目标』|r：回到|cffffcc99『沙漠聚集地』情报商人处|r交换|cff00ccff『魔力源石』|r。",
    ["任务提示"] = "|cffffff00『主线目标』|r：回到|cffffcc99『沙漠聚集地』情报商人处|r交换|cff00ccff『魔力源石』|r。（小地图信号处）",
    ["小地图X"] = -7061.2,
    ["小地图Y"] = -26301.8,
    ["小地图持续时间"] = 15,
    ["支线任务发现"] = {
        ["任务数组索引"] = 7,
        ["任务名"] = "至强者的传承",
        ["任务描述"] = "顺便关注一下丢失的美杜莎之眼的线索吧。",
        ["图标路径"] = "ReplaceableTextures\\CommandButtons\\BTNGMExchange.blp",
        ["发现提示"] = "|cffffff00『系统提示』|r：发现支线任务|cffff00ff『至强者的传承』|r"
    },
    ["延迟显示"] = {
        ["延迟秒数"] = 5,
        ["语义单位名"] = "主线NPC.蛇人族卫队长",
        X = -21753.5,
        Y = 4565.3,
        ["朝向"] = 270
    },
    ["旧JASS来源"] = "14-15.j",
    ["说明"] = "真实的 14 -> 15 是血线承接，不是对白片段。"
}
return ____exports
