--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____05_FF0E_7D27_51D1_5267_60C5_7247_6BB5_7F16_8BD1 = require("系统.11．剧情系统.01．主线任务.00．剧情系统核心工具.05．紧凑剧情片段编译")
local _____7F16_8BD1_7D27_51D1_5267_60C5_7247_6BB5 = ____05_FF0E_7D27_51D1_5267_60C5_7247_6BB5_7F16_8BD1["编译紧凑剧情片段"]
____exports["精灵城章节承接紧凑剧情片段"] = {
    ["片段ID"] = "elven_city_chapter_bridge",
    ["名称"] = "精灵城章节承接",
    ["触发条件"] = "剧情进度 == 18 且玩家回到精灵村长老处",
    ["可Esc整段跳过"] = true,
    ["默认倍速"] = 1,
    ["默认对白持续时间"] = 3,
    ["对白列表"] = {
        {["序号"] = 1, ["说话者"] = "精灵村长老", ["文本"] = "多谢诸位帝国使者。我等会认真考虑此事。", ["持续时间"] = 3},
        {["序号"] = 2, ["说话者"] = "精灵村长老", ["文本"] = "各位接下来，想必是要前往|cffffcc99『克林姆德一脉』|r吧？", ["持续时间"] = 5},
        {["序号"] = 3, ["说话者"] = "精灵村长老", ["文本"] = "我族在森林深处，隐藏着一座通往|cffffcc99『克林山谷』|r的|cffff99cc『森林传送阵』|r，那里正是|cffffcc99『克林姆德一脉』|r的居处所在。", ["持续时间"] = 8},
        {["序号"] = 4, ["说话者"] = "精灵村长老", ["文本"] = "诸位可以凭这枚令牌将其开启，便能迅速前往。", ["持续时间"] = 4},
        {["序号"] = 5, ["说话者"] = "玩家", ["文本"] = "（|cff99ffcc『西里尔一脉』|r的|cffffffcc『钥匙』|r已经到手。接下来，便要前往|cffffcc99『克林姆德一脉』|r，取得封印之地的确切消息。", ["持续时间"] = 8},
        {["序号"] = 6, ["说话者"] = "玩家", ["文本"] = "只是|cffffcc99『克林姆德一脉』|r并未衰落，目标也远比西里尔明显。如今又有|cffcc99ff『分离教派』|r插手其中，这一趟，恐怕不会顺利。）", ["持续时间"] = 8}
    },
    ["动作时间线"] = {{
        ["序号"] = 1,
        ["挂点"] = "beforeDialog",
        ["对白序号"] = 1,
        ["动作ID"] = "JLC精灵城_章节承接",
        ["名称"] = "第二章章节承接",
        ["参数"] = {
            ["触发进度"] = 18,
            ["目标进度"] = 19,
            NPC = "主线NPC.精灵村长老",
            ["触发范围"] = 850,
            ["隐藏阻挡"] = "gg_dest_B00X_0013",
            ["旧JASS功能清单"] = "EC_CreateEffect / ShowDestructable(false) / SetUnitOwner"
        }
    }, {
        ["序号"] = 2,
        ["挂点"] = "afterDialog",
        ["对白序号"] = 6,
        ["动作ID"] = "JLC精灵城_前往王城",
        ["名称"] = "前往王城",
        ["参数"] = {["任务更新提示"] = "|cffffff00『主线目标』：|r使用|cffff99cc『森林传送阵』（在传送阵附近使用『环境互动』）|r前往|cffffcc99『克林山谷』|r寻找|cffff9900『克林姆德一脉』|r（小地图信号处）。", ["小地图X"] = -23154.7, ["小地图Y"] = -14847.9}
    }}
}
____exports["精灵城章节承接剧情片段"] = _____7F16_8BD1_7D27_51D1_5267_60C5_7247_6BB5(____exports["精灵城章节承接紧凑剧情片段"])
return ____exports
