/** @noSelfInFile */

export type 剧情物品掉落动作类型 = "掉落物品" | "开启大门";
export type 剧情物品掉落屏蔽条件 = "德鲁伊学者属于中立被动";

export interface 剧情物品掉落动作配置 {
  动作类型: 剧情物品掉落动作类型;
  物品名?: string;
  掉落概率?: number;
  要求剧情进度至少?: number;
  屏蔽条件?: 剧情物品掉落屏蔽条件;
  大门全局名列表?: string[];
}

export interface 剧情物品掉落配置 {
  配置ID: string;
  触发单位名: string;
  动作列表: 剧情物品掉落动作配置[];
}

export const 剧情物品掉落配置表: 剧情物品掉落配置[] = [
  {
    配置ID: "黑暗魔法女王_暗狱之书",
    触发单位名: "黑暗魔法女王",
    动作列表: [
      {
        动作类型: "掉落物品",
        物品名: "|cffcc99ff暗狱之书|r",
        掉落概率: 10,
        屏蔽条件: "德鲁伊学者属于中立被动",
      },
    ],
  },
  {
    配置ID: "地精剑客_地精钥匙",
    触发单位名: "地精剑客",
    动作列表: [
      {
        动作类型: "掉落物品",
        物品名: "地精钥匙",
        要求剧情进度至少: 1,
      },
    ],
  },
  {
    配置ID: "熔岩恶魔_开启大门",
    触发单位名: "熔岩恶魔",
    动作列表: [
      {
        动作类型: "开启大门",
        大门全局名列表: ["gg_dest_ATg3_10381", "gg_dest_B00J_10382"],
      },
    ],
  },
];
