/** @noSelfInFile */

export const 菲尼克斯尔场地配置 = {
  战斗矩形: {
    左: -928,
    右: 2816,
    下: -11744,
    上: -7968,
  },
  中心点: {
    x: 28415.9,
    y: 1163.3,
  },
  Boss初始点: {
    x: 15429.9,
    y: -4014.9,
  },
  永恒冰核点: {
    x: 28415.9,
    y: 1163.3,
  },
  导管点位: [
    { x: 27634.7, y: 2033.3 },
    { x: 29169.2, y: 1966.2 },
    { x: 27610.6, y: 18.8 },
    { x: 29066.0, y: 145.8 },
  ],
  怨火核心点: {
    x: 28415.9,
    y: 1163.3,
  },
  凤凰蛋点位: [
    { x: 27634.7, y: 2033.3 },
    { x: 29169.2, y: 1966.2 },
    { x: 27610.6, y: 18.8 },
    { x: 29066.0, y: 145.8 },
  ],
  挽歌安全区点位: [
    { x: 27634.7, y: 2033.3, 元素: "火" },
    { x: 29169.2, y: 1966.2, 元素: "冰" },
    { x: 27610.6, y: 18.8, 元素: "毒" },
    { x: 29066.0, y: 145.8, 元素: "暗" },
  ],
} as const;

export type 菲尼克斯尔二维点 = {
  readonly x: number;
  readonly y: number;
};
