/** @noSelfInFile */

export const 菲尼克斯尔场地配置 = {
  战斗矩形: {
    左: -928,
    右: 2816,
    下: -11744,
    上: -7968,
  },
  中心点: {
    x: 944,
    y: -9856,
  },
  Boss初始点: {
    x: 15429.9,
    y: -4014.9,
  },
  永恒冰核点: {
    x: 944,
    y: -9856,
  },
  导管点位: [
    { x: 44, y: -10756 },
    { x: 1844, y: -10756 },
    { x: 44, y: -8956 },
    { x: 1844, y: -8956 },
  ],
  怨火核心点: {
    x: 944,
    y: -9856,
  },
  凤凰蛋点位: [
    { x: 44, y: -10756 },
    { x: 1844, y: -10756 },
    { x: 44, y: -8956 },
    { x: 1844, y: -8956 },
  ],
  挽歌安全区点位: [
    { x: 44, y: -10756, 元素: "火" },
    { x: 1844, y: -10756, 元素: "冰" },
    { x: 44, y: -8956, 元素: "毒" },
    { x: 1844, y: -8956, 元素: "暗" },
  ],
} as const;

export type 菲尼克斯尔二维点 = {
  readonly x: number;
  readonly y: number;
};
