/** @noSelfInFile */

import { 注册菲尼克斯尔双形态转换 } from "./04．双形态转换";
import { 注册菲尼克斯尔永恒冰核与导管 } from "./05．永恒冰核与导管";
import { 注册菲尼克斯尔炽羽散射 } from "./06．炽羽散射";
import { 注册菲尼克斯尔熔岩吐息 } from "./07．熔岩吐息";
import { 注册菲尼克斯尔凤凰漩涡 } from "./08．凤凰漩涡";
import { 注册菲尼克斯尔浴火重生准备 } from "./09．浴火重生准备";
import { 注册菲尼克斯尔元素层数 } from "./10．元素层数";
import { 注册菲尼克斯尔骸骨弹幕 } from "./11．骸骨弹幕";
import { 注册菲尼克斯尔怨火链接 } from "./12．怨火链接";
import { 注册菲尼克斯尔凤凰挽歌 } from "./13．凤凰挽歌";
import { 注册菲尼克斯尔元素爆发 } from "./14．元素爆发";
import { 注册菲尼克斯尔永恒轮回 } from "./16．永恒轮回";

export function 注册菲尼克斯尔技能结构(this: void): void {
  注册菲尼克斯尔双形态转换();
  注册菲尼克斯尔永恒冰核与导管();
  注册菲尼克斯尔炽羽散射();
  注册菲尼克斯尔熔岩吐息();
  注册菲尼克斯尔凤凰漩涡();
  注册菲尼克斯尔浴火重生准备();
  注册菲尼克斯尔元素层数();
  注册菲尼克斯尔骸骨弹幕();
  注册菲尼克斯尔怨火链接();
  注册菲尼克斯尔凤凰挽歌();
  注册菲尼克斯尔元素爆发();
  注册菲尼克斯尔永恒轮回();
}
