--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____02_FF0EAI_914D_7F6E_5DE5_5177 = require("系统.03．技能系统.06．AI自动使用技能.00．AI配置.02．AI配置工具")
local _____521B_5EFA_5355_4F4DAI_914D_7F6E = ____02_FF0EAI_914D_7F6E_5DE5_5177["创建单位AI配置"]
local ____00_FF0E_914D_7F6E = require("系统.03．技能系统.05．单位技能.03．Boss技能.03．异界Boss.03．安兹乌尔恭.00．配置")
local _____5B89_5179_4E4C_5C14_606D_5355_4F4D_6280_80FD_914D_7F6E = ____00_FF0E_914D_7F6E["安兹乌尔恭单位技能配置"]
____exports["安兹乌尔恭AI配置"] = _____521B_5EFA_5355_4F4DAI_914D_7F6E({
    ["AI配置ID"] = "安兹乌尔恭AI",
    ["单位ID"] = _____5B89_5179_4E4C_5C14_606D_5355_4F4D_6280_80FD_914D_7F6E["正式单位ID"],
    ["单位名"] = _____5B89_5179_4E4C_5C14_606D_5355_4F4D_6280_80FD_914D_7F6E["单位名称"],
    ["归类"] = "异界Boss",
    ["AI模式"] = "固定技能表",
    ["检查间隔Ms"] = 250,
    ["公共施法间隔Ms"] = 2400,
    ["默认目标选择方式"] = "最高仇恨",
    ["技能覆盖"] = {{
        ["技能ID"] = _____5B89_5179_4E4C_5C14_606D_5355_4F4D_6280_80FD_914D_7F6E["技能壳"]["现实断裂"],
        ["技能名"] = "现实断裂",
        ["施法目标类型"] = "单位",
        ["目标选择方式"] = "最高仇恨",
        ["最大施法距离"] = 1500,
        ["最低生命百分比"] = 70,
        ["权重"] = 36,
        ["说明"] = "P1 主动技能：固定当前目标方向，先显示狭长切面预警，再结算一次线段危险区。"
    }, {
        ["技能ID"] = _____5B89_5179_4E4C_5C14_606D_5355_4F4D_6280_80FD_914D_7F6E["技能壳"]["高阶魔法箭"],
        ["技能名"] = "高阶魔法箭",
        ["施法目标类型"] = "单位",
        ["目标选择方式"] = "最高仇恨",
        ["最大施法距离"] = 1300,
        ["最低生命百分比"] = 70,
        ["权重"] = 30,
        ["说明"] = "P1 主动技能：分三轮锁定敌对英雄当前位置，圆形预警后落下错峰骸骨箭雨。"
    }},
    ["说明"] = "安兹 P1 已接入现实断裂与高阶魔法箭；其余技能与阶段机制继续由后续技能入口注册。"
})
return ____exports
