local ____lualib = require("lualib_bundle")
local __TS__ObjectAssign = ____lualib.__TS__ObjectAssign
local ____exports = {}
local ____20_FF0E_4E16_754C_5730_56FE_5355_4F4D_7F13_6B65_521B_5EFA = require("系统.01．单位系统.00．单位初始化创建.02．世界地图单位初始化.20．世界地图单位缓步创建")
local _____542F_52A8_4E16_754C_5730_56FE_5355_4F4D_7F13_6B65_521B_5EFA = ____20_FF0E_4E16_754C_5730_56FE_5355_4F4D_7F13_6B65_521B_5EFA["启动世界地图单位缓步创建"]
____exports["世界地图杂鱼出生配置表"] = {
    {
        ["分组名"] = "豺狼人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "豺狼刺客",
        ["兼容单位ID"] = "ngns",
        X = -28888.6,
        Y = -25449.6,
        ["朝向"] = 68.28
    },
    {
        ["分组名"] = "豺狼人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "豺狼刺客",
        ["兼容单位ID"] = "ngns",
        X = -29274.7,
        Y = -25379.4,
        ["朝向"] = 41.6
    },
    {
        ["分组名"] = "豺狼人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "豺狼偷猎者",
        ["兼容单位ID"] = "ngna",
        X = -29377.7,
        Y = -24802.6,
        ["朝向"] = 62.2
    },
    {
        ["分组名"] = "豺狼人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "豺狼偷猎者",
        ["兼容单位ID"] = "ngna",
        X = -28936.9,
        Y = -24637,
        ["朝向"] = 72.87
    },
    {
        ["分组名"] = "豺狼人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "豺狼偷猎者",
        ["兼容单位ID"] = "ngna",
        X = -29336.9,
        Y = -24267.9,
        ["朝向"] = 299.52
    },
    {
        ["分组名"] = "豺狼人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "豺狼偷猎者",
        ["兼容单位ID"] = "ngna",
        X = -28490.5,
        Y = -24245.1,
        ["朝向"] = 98.76
    },
    {
        ["分组名"] = "豺狼人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "豺狼偷猎者",
        ["兼容单位ID"] = "ngna",
        X = -28492.2,
        Y = -23755.5,
        ["朝向"] = 57.95
    },
    {
        ["分组名"] = "豺狼人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "豺狼刺客",
        ["兼容单位ID"] = "ngns",
        X = -29268.8,
        Y = -23596.2,
        ["朝向"] = 0
    },
    {
        ["分组名"] = "豺狼人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "豺狼刺客",
        ["兼容单位ID"] = "ngns",
        X = -29494.9,
        Y = -23334.6,
        ["朝向"] = 300
    },
    {
        ["分组名"] = "豺狼人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "豺狼刺客",
        ["兼容单位ID"] = "ngns",
        X = -29553.4,
        Y = -23673.7,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "豺狼人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "豺狼偷猎者",
        ["兼容单位ID"] = "ngna",
        X = -26583.2,
        Y = -23877.7,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "豺狼人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "豺狼偷猎者",
        ["兼容单位ID"] = "ngna",
        X = -26157,
        Y = -23781.2,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "豺狼人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "豺狼偷猎者",
        ["兼容单位ID"] = "ngna",
        X = -26830.3,
        Y = -23468.9,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "豺狼人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "豺狼偷猎者",
        ["兼容单位ID"] = "ngna",
        X = -26444.1,
        Y = -23191.6,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "豺狼人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "豺狼偷猎者",
        ["兼容单位ID"] = "ngna",
        X = -25995.7,
        Y = -23031.8,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "豺狼人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "豺狼偷猎者",
        ["兼容单位ID"] = "ngna",
        X = -27623,
        Y = -23026.6,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "豺狼人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "豺狼偷猎者",
        ["兼容单位ID"] = "ngna",
        X = -27889.3,
        Y = -22400.4,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "豺狼人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "豺狼偷猎者",
        ["兼容单位ID"] = "ngna",
        X = -26812.7,
        Y = -22902.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "豺狼人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "豺狼偷猎者",
        ["兼容单位ID"] = "ngna",
        X = -26275.6,
        Y = -22758.2,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "豺狼人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "豺狼偷猎者",
        ["兼容单位ID"] = "ngna",
        X = -26111,
        Y = -22318.6,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "豺狼人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "豺狼偷猎者",
        ["兼容单位ID"] = "ngna",
        X = -26810.5,
        Y = -21541.2,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "豺狼人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "豺狼偷猎者",
        ["兼容单位ID"] = "ngna",
        X = -27332.4,
        Y = -21381.1,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "豺狼人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "豺狼人长矛手",
        ["兼容单位ID"] = "n004",
        X = -26964.9,
        Y = -20427.1,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "豺狼人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "豺狼人长矛手",
        ["兼容单位ID"] = "n004",
        X = -27296.3,
        Y = -20488,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "地精",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "普通地精",
        ["兼容单位ID"] = "n009",
        X = -28641.9,
        Y = -21774,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "地精",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "普通地精",
        ["兼容单位ID"] = "n009",
        X = -28210.3,
        Y = -21513.6,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "地精",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "普通地精",
        ["兼容单位ID"] = "n009",
        X = -28329.9,
        Y = -21588.2,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "地精",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "普通地精",
        ["兼容单位ID"] = "n009",
        X = -28155.3,
        Y = -20864.3,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "地精",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "普通地精",
        ["兼容单位ID"] = "n009",
        X = -28417.4,
        Y = -20937,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "地精",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "普通地精",
        ["兼容单位ID"] = "n009",
        X = -28670.4,
        Y = -21333.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "地精",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "普通地精",
        ["兼容单位ID"] = "n009",
        X = -28972,
        Y = -21617.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "地精",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "普通地精",
        ["兼容单位ID"] = "n009",
        X = -29510,
        Y = -21406.1,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "地精",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "地精长矛战士",
        ["兼容单位ID"] = "n008",
        X = -28375.1,
        Y = -20573.4,
        ["朝向"] = 290
    },
    {
        ["分组名"] = "地精",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "普通地精",
        ["兼容单位ID"] = "n009",
        X = -29471.7,
        Y = -18700.6,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "地精",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "普通地精",
        ["兼容单位ID"] = "n009",
        X = -29086.1,
        Y = -18322,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "地精",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "普通地精",
        ["兼容单位ID"] = "n009",
        X = -29231.4,
        Y = -19331.4,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "地精",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "普通地精",
        ["兼容单位ID"] = "n009",
        X = -28636.1,
        Y = -19454.4,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "地精",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "普通地精",
        ["兼容单位ID"] = "n009",
        X = -28020,
        Y = -19124.1,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "地精",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "普通地精",
        ["兼容单位ID"] = "n009",
        X = -27487.9,
        Y = -19160.8,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "地精",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "普通地精",
        ["兼容单位ID"] = "n009",
        X = -27953.4,
        Y = -19711.8,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "地精",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "普通地精",
        ["兼容单位ID"] = "n009",
        X = -27177.7,
        Y = -18576.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "地精",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "普通地精",
        ["兼容单位ID"] = "n009",
        X = -27690,
        Y = -18556.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "地精",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "普通地精",
        ["兼容单位ID"] = "n009",
        X = -28069.7,
        Y = -18007,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "地精",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "普通地精",
        ["兼容单位ID"] = "n009",
        X = -27945.8,
        Y = -17873.2,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "地精",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "普通地精",
        ["兼容单位ID"] = "n009",
        X = -28237.8,
        Y = -17880.1,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "地精",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "地精长矛战士",
        ["兼容单位ID"] = "n008",
        X = -28218.6,
        Y = -17355,
        ["朝向"] = 260.53
    },
    {
        ["分组名"] = "地精",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "地精长矛战士",
        ["兼容单位ID"] = "n008",
        X = -28667,
        Y = -17508.3,
        ["朝向"] = 300
    },
    {
        ["分组名"] = "地精",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "地精长矛战士",
        ["兼容单位ID"] = "n008",
        X = -29563.6,
        Y = -14472.8,
        ["朝向"] = 68.42
    },
    {
        ["分组名"] = "地精",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "地精长矛战士",
        ["兼容单位ID"] = "n008",
        X = -29049.1,
        Y = -14526,
        ["朝向"] = 138.83
    },
    {
        ["分组名"] = "地精",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "地精长矛战士",
        ["兼容单位ID"] = "n008",
        X = -29404,
        Y = -15338.3,
        ["朝向"] = 138.83
    },
    {
        ["分组名"] = "地精",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "地精长矛战士",
        ["兼容单位ID"] = "n008",
        X = -28283.5,
        Y = -15944,
        ["朝向"] = 138.83
    },
    {
        ["分组名"] = "地精",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "地精长矛战士",
        ["兼容单位ID"] = "n008",
        X = -27673,
        Y = -15799,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "地精",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "地精长矛战士",
        ["兼容单位ID"] = "n008",
        X = -28472,
        Y = -14643.7,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "地精",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "地精长矛战士",
        ["兼容单位ID"] = "n008",
        X = -27902.2,
        Y = -14266.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "地精",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "地精长矛战士",
        ["兼容单位ID"] = "n008",
        X = -27934.2,
        Y = -13490.3,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "地精",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "地精长矛战士",
        ["兼容单位ID"] = "n008",
        X = -27934.2,
        Y = -13490.3,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "地精",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "地精长矛战士",
        ["兼容单位ID"] = "n008",
        X = -27417.6,
        Y = -15037.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "地精",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "地精长矛战士",
        ["兼容单位ID"] = "n008",
        X = -26381.9,
        Y = -14413.1,
        ["朝向"] = 288.42
    },
    {
        ["分组名"] = "地精",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "地精长矛战士",
        ["兼容单位ID"] = "n008",
        X = -25636.9,
        Y = -14365.2,
        ["朝向"] = 229.12
    },
    {
        ["分组名"] = "史莱姆",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蓝色史莱姆",
        ["兼容单位ID"] = "n000",
        X = -25070,
        Y = -25446.3,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "史莱姆",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蓝色史莱姆",
        ["兼容单位ID"] = "n000",
        X = -23918.9,
        Y = -25304.3,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "史莱姆",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蓝色史莱姆",
        ["兼容单位ID"] = "n000",
        X = -24046.2,
        Y = -24527.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "史莱姆",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蓝色史莱姆",
        ["兼容单位ID"] = "n000",
        X = -24944.5,
        Y = -24329,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "史莱姆",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蓝色史莱姆",
        ["兼容单位ID"] = "n000",
        X = -23742.3,
        Y = -23227.1,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "史莱姆",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蓝色史莱姆",
        ["兼容单位ID"] = "n000",
        X = -24746.3,
        Y = -23162.2,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "史莱姆",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蓝色史莱姆",
        ["兼容单位ID"] = "n000",
        X = -24407.1,
        Y = -22215.1,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "史莱姆",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蓝色史莱姆",
        ["兼容单位ID"] = "n000",
        X = -23461,
        Y = -22283.6,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "史莱姆",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "绿色史莱姆",
        ["兼容单位ID"] = "n002",
        X = -23298.4,
        Y = -25260.4,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "史莱姆",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "绿色史莱姆",
        ["兼容单位ID"] = "n002",
        X = -25013.7,
        Y = -24848.7,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "史莱姆",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "绿色史莱姆",
        ["兼容单位ID"] = "n002",
        X = -24277,
        Y = -24055.2,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "史莱姆",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "绿色史莱姆",
        ["兼容单位ID"] = "n002",
        X = -23622.3,
        Y = -24052.4,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "史莱姆",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "绿色史莱姆",
        ["兼容单位ID"] = "n002",
        X = -24991.1,
        Y = -23729.2,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "史莱姆",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "绿色史莱姆",
        ["兼容单位ID"] = "n002",
        X = -24281.7,
        Y = -22763,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "史莱姆",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "绿色史莱姆",
        ["兼容单位ID"] = "n002",
        X = -25170.8,
        Y = -22377.3,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "史莱姆",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "绿色史莱姆",
        ["兼容单位ID"] = "n002",
        X = -23112.7,
        Y = -22957.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "史莱姆",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "绿色史莱姆",
        ["兼容单位ID"] = "n002",
        X = -23646.1,
        Y = -21782.1,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "螃蟹",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蜘蛛螃蟹",
        ["兼容单位ID"] = "nsc2",
        X = -22867,
        Y = -18899.9,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "螃蟹",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蜘蛛螃蟹",
        ["兼容单位ID"] = "nsc2",
        X = -22590.7,
        Y = -19671.4,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "螃蟹",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蜘蛛螃蟹",
        ["兼容单位ID"] = "nsc2",
        X = -22720.7,
        Y = -20323.1,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "螃蟹",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蜘蛛螃蟹",
        ["兼容单位ID"] = "nsc2",
        X = -21891.6,
        Y = -19354.8,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "螃蟹",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蜘蛛螃蟹",
        ["兼容单位ID"] = "nsc2",
        X = -22252,
        Y = -20472.9,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "螃蟹",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蜘蛛螃蟹",
        ["兼容单位ID"] = "nsc2",
        X = -22118.4,
        Y = -20846.2,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "螃蟹",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蜘蛛螃蟹",
        ["兼容单位ID"] = "nsc2",
        X = -21349.7,
        Y = -21073,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "螃蟹",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蜘蛛螃蟹",
        ["兼容单位ID"] = "nsc2",
        X = -20876.5,
        Y = -20631.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "螃蟹",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蜘蛛螃蟹",
        ["兼容单位ID"] = "nsc2",
        X = -20872.7,
        Y = -21330.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "石头人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "泥潭傀儡",
        ["兼容单位ID"] = "ngrk",
        X = -20074,
        Y = -24176.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "石头人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "泥潭傀儡",
        ["兼容单位ID"] = "ngrk",
        X = -20060,
        Y = -24740.7,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "石头人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "泥潭傀儡",
        ["兼容单位ID"] = "ngrk",
        X = -19547.8,
        Y = -24953,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "石头人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "泥潭傀儡",
        ["兼容单位ID"] = "ngrk",
        X = -19904.9,
        Y = -25315.4,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "石头人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "泥潭傀儡",
        ["兼容单位ID"] = "ngrk",
        X = -19549,
        Y = -25780.3,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "石头人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "泥潭傀儡",
        ["兼容单位ID"] = "ngrk",
        X = -19955,
        Y = -26867.7,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "石头人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "岩石傀儡",
        ["兼容单位ID"] = "ngst",
        X = -19692.6,
        Y = -26317.8,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "石头人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "岩石傀儡",
        ["兼容单位ID"] = "ngst",
        X = -19591,
        Y = -27359.8,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "石头人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "岩石傀儡",
        ["兼容单位ID"] = "ngst",
        X = -18681.2,
        Y = -27598.4,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "石头人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "岩石傀儡",
        ["兼容单位ID"] = "ngst",
        X = -17932.3,
        Y = -27641.1,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "石头人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "岩石傀儡",
        ["兼容单位ID"] = "ngst",
        X = -16855.6,
        Y = -27792.4,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "石头人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "岩石傀儡",
        ["兼容单位ID"] = "ngst",
        X = -15868.5,
        Y = -28092.1,
        ["朝向"] = 145
    },
    {
        ["分组名"] = "石头人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "岩石傀儡",
        ["兼容单位ID"] = "ngst",
        X = -15981.1,
        Y = -26570.7,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "石头人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "岩石傀儡",
        ["兼容单位ID"] = "ngst",
        X = -15812.7,
        Y = -28025.8,
        ["朝向"] = 145
    },
    {
        ["分组名"] = "沙漠蝎子",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "阿卡那瑟德战士",
        ["兼容单位ID"] = "nanw",
        X = -16372.8,
        Y = -22440,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠蝎子",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "阿卡那瑟德战士",
        ["兼容单位ID"] = "nanw",
        X = -14697.5,
        Y = -22159,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠蝎子",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "阿卡那瑟德战士",
        ["兼容单位ID"] = "nanw",
        X = -14200.9,
        Y = -21983.6,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠蝎子",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "阿卡那瑟德战士",
        ["兼容单位ID"] = "nanw",
        X = -12700.7,
        Y = -22054.7,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠蝎子",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "阿卡那瑟德战士",
        ["兼容单位ID"] = "nanw",
        X = -11414.4,
        Y = -22802.2,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠蝎子",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "阿卡那瑟德战士",
        ["兼容单位ID"] = "nanw",
        X = -11667.4,
        Y = -21126.9,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠蝎子",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "阿卡那瑟德战士",
        ["兼容单位ID"] = "nanw",
        X = -10590,
        Y = -22677.1,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠蝎子",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "阿卡那瑟德掘地者",
        ["兼容单位ID"] = "nane",
        X = -15828.7,
        Y = -23004,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠蝎子",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "阿卡那瑟德掘地者",
        ["兼容单位ID"] = "nane",
        X = -15777.5,
        Y = -21572.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠蝎子",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "阿卡那瑟德掘地者",
        ["兼容单位ID"] = "nane",
        X = -16325.4,
        Y = -21105.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠蝎子",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "阿卡那瑟德掘地者",
        ["兼容单位ID"] = "nane",
        X = -15189.5,
        Y = -22535.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠蝎子",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "阿卡那瑟德掘地者",
        ["兼容单位ID"] = "nane",
        X = -13441.4,
        Y = -23111.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠蝎子",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "阿卡那瑟德掘地者",
        ["兼容单位ID"] = "nane",
        X = -12737.2,
        Y = -22470,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠蝎子",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "阿卡那瑟德掘地者",
        ["兼容单位ID"] = "nane",
        X = -11017,
        Y = -21527.4,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠蝎子",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "阿卡那瑟德刺人",
        ["兼容单位ID"] = "nanb",
        X = -14245,
        Y = -22701.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠蝎子",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "阿卡那瑟德刺人",
        ["兼容单位ID"] = "nanb",
        X = -14459.1,
        Y = -21426.8,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠蝎子",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "阿卡那瑟德刺人",
        ["兼容单位ID"] = "nanb",
        X = -13873,
        Y = -20873.1,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠蝎子",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "阿卡那瑟德刺人",
        ["兼容单位ID"] = "nanb",
        X = -13678.5,
        Y = -22088.2,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠蝎子",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "阿卡那瑟德刺人",
        ["兼容单位ID"] = "nanb",
        X = -10597.5,
        Y = -22658.9,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠蝎子",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "阿卡那瑟德刺人",
        ["兼容单位ID"] = "nanb",
        X = -13660.8,
        Y = -22133.1,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠毒液蜘蛛",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "沙漠蜘蛛",
        ["兼容单位ID"] = "nssp",
        X = -11966.2,
        Y = -25241.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠毒液蜘蛛",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "沙漠蜘蛛",
        ["兼容单位ID"] = "nssp",
        X = -10459.6,
        Y = -25208.9,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠毒液蜘蛛",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "沙漠蜘蛛",
        ["兼容单位ID"] = "nssp",
        X = -11482.6,
        Y = -26066.4,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠毒液蜘蛛",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "沙漠蜘蛛",
        ["兼容单位ID"] = "nssp",
        X = -10445.7,
        Y = -26423.2,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠毒液蜘蛛",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "沙漠蜘蛛",
        ["兼容单位ID"] = "nssp",
        X = -11052.5,
        Y = -27782.7,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠毒液蜘蛛",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "沙漠蜘蛛",
        ["兼容单位ID"] = "nssp",
        X = -12495,
        Y = -28638.3,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠毒液蜘蛛",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "沙漠蜘蛛",
        ["兼容单位ID"] = "nssp",
        X = -10920.1,
        Y = -28880.9,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠毒液蜘蛛",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "沙漠蜘蛛",
        ["兼容单位ID"] = "nssp",
        X = -8341.6,
        Y = -28920.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠毒液蜘蛛",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "沙漠蜘蛛",
        ["兼容单位ID"] = "nssp",
        X = -9573.7,
        Y = -27731.6,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠毒液蜘蛛",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "沙漠蜘蛛",
        ["兼容单位ID"] = "nssp",
        X = -8079.2,
        Y = -28025.7,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠毒液蜘蛛",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "沙漠蜘蛛",
        ["兼容单位ID"] = "nssp",
        X = -7110.4,
        Y = -27850.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠毒液蜘蛛",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "沙漠蜘蛛",
        ["兼容单位ID"] = "nssp",
        X = -8938.6,
        Y = -26520.2,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠毒液蜘蛛",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "沙漠蜘蛛",
        ["兼容单位ID"] = "nssp",
        X = -8895,
        Y = -25494.3,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠蛇人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蛇之盗贼",
        ["兼容单位ID"] = "nbdm",
        X = -4804,
        Y = -21388.9,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠蛇人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蛇之盗贼",
        ["兼容单位ID"] = "nbdm",
        X = -4160.1,
        Y = -21142.1,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠蛇人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蛇之盗贼",
        ["兼容单位ID"] = "nbdm",
        X = -3554.3,
        Y = -22019.9,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠蛇人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蛇之盗贼",
        ["兼容单位ID"] = "nbdm",
        X = -1104.5,
        Y = -23739.1,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠蛇人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蛇之盗贼",
        ["兼容单位ID"] = "nbdm",
        X = -2099.2,
        Y = -24073.4,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠蛇人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蛇之盗贼",
        ["兼容单位ID"] = "nbdm",
        X = -933.3,
        Y = -24415.4,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠蛇人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蛇之信徒",
        ["兼容单位ID"] = "nbda",
        X = -4343.1,
        Y = -21827.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠蛇人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蛇之信徒",
        ["兼容单位ID"] = "nbda",
        X = -3546.7,
        Y = -21233.9,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠蛇人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蛇之信徒",
        ["兼容单位ID"] = "nbda",
        X = -2794.3,
        Y = -22738.3,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠蛇人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蛇之信徒",
        ["兼容单位ID"] = "nbda",
        X = -1703.1,
        Y = -23362.7,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠蛇人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蛇之信徒",
        ["兼容单位ID"] = "nbda",
        X = -2222.1,
        Y = -24983.4,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠蛇人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蛇之信徒",
        ["兼容单位ID"] = "nbda",
        X = -1482,
        Y = -25520.1,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠蛇人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蛇之护卫",
        ["兼容单位ID"] = "nbdw",
        X = -2158.9,
        Y = -22023.3,
        ["朝向"] = 216
    },
    {
        ["分组名"] = "沙漠蛇人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蛇之护卫",
        ["兼容单位ID"] = "nbdw",
        X = -1747.8,
        Y = -22093.9,
        ["朝向"] = 356
    },
    {
        ["分组名"] = "沙漠蛇人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蛇之看守者",
        ["兼容单位ID"] = "nbds",
        X = -121.6,
        Y = -22824.3,
        ["朝向"] = 220
    },
    {
        ["分组名"] = "沙漠狼人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "狼人战士",
        ["兼容单位ID"] = "n01W",
        X = 3115.1,
        Y = -25412.2,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠狼人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "狼人战士",
        ["兼容单位ID"] = "n01W",
        X = 3289.2,
        Y = -24786.6,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠狼人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "狼人战士",
        ["兼容单位ID"] = "n01W",
        X = 2332.6,
        Y = -24367.1,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠狼人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "狼人战士",
        ["兼容单位ID"] = "n01W",
        X = 2982,
        Y = -23602.2,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠狼人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "狼人战士",
        ["兼容单位ID"] = "n01W",
        X = 4012.5,
        Y = -23646.2,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠狼人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "狼人战士",
        ["兼容单位ID"] = "n01W",
        X = 3873.2,
        Y = -23130,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠狼人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "狼人战士",
        ["兼容单位ID"] = "n01W",
        X = 3226,
        Y = -22549.7,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠狼人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "狼人骑士",
        ["兼容单位ID"] = "n003",
        X = 3615.6,
        Y = -25494.3,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠狼人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "狼人骑士",
        ["兼容单位ID"] = "n003",
        X = 2573.9,
        Y = -23980.4,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠狼人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "狼人骑士",
        ["兼容单位ID"] = "n003",
        X = 2189.8,
        Y = -24856.6,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "鹰身女妖",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "女妖风暴巫师",
        ["兼容单位ID"] = "nhrh",
        X = 389.4,
        Y = -28240.7,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "鹰身女妖",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "女妖风暴巫师",
        ["兼容单位ID"] = "nhrh",
        X = -491.3,
        Y = -27518.2,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "鹰身女妖",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "女妖侦察者",
        ["兼容单位ID"] = "nhar",
        X = 1028.2,
        Y = -28218.7,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "鹰身女妖",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "女妖侦察者",
        ["兼容单位ID"] = "nhar",
        X = 2014.4,
        Y = -27788.6,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "鹰身女妖",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "女妖侦察者",
        ["兼容单位ID"] = "nhar",
        X = 1028.2,
        Y = -28218.7,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "鹰身女妖",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "女妖侦察者",
        ["兼容单位ID"] = "nhar",
        X = 2014.4,
        Y = -27788.6,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "鹰身女妖",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "女妖侦察者",
        ["兼容单位ID"] = "nhar",
        X = 657.9,
        Y = -27101.8,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "鹰身女妖",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "女妖侦察者",
        ["兼容单位ID"] = "nhar",
        X = 976.1,
        Y = -26443.7,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "鹰身女妖",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "女妖侦察者",
        ["兼容单位ID"] = "nhar",
        X = 3155.9,
        Y = -27695.1,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "鹰身女妖",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "女妖侦察者",
        ["兼容单位ID"] = "nhar",
        X = 1322.9,
        Y = -25890.3,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "鹰身女妖",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "女妖侦察者",
        ["兼容单位ID"] = "nhar",
        X = 3042.4,
        Y = -26407.3,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "鹰身女妖",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "女妖侦察者",
        ["兼容单位ID"] = "nhar",
        X = 1628.5,
        Y = -25648.6,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "鹰身女妖",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "女妖巫婆",
        ["兼容单位ID"] = "nhrw",
        X = 1120,
        Y = -27434.2,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "鹰身女妖",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "女妖巫婆",
        ["兼容单位ID"] = "nhrw",
        X = 1909.5,
        Y = -27176.1,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "鹰身女妖",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "女妖巫婆",
        ["兼容单位ID"] = "nhrw",
        X = -245.1,
        Y = -26148.8,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "鹰身女妖",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "女妖巫婆",
        ["兼容单位ID"] = "nhrw",
        X = 1563.1,
        Y = -26082.1,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "鹰身女妖",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "女妖巫婆",
        ["兼容单位ID"] = "nhrw",
        X = 2229.8,
        Y = -25921,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵蝎子",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "熔岩蝎子",
        ["兼容单位ID"] = "n013",
        X = 6968.9,
        Y = -28613.4,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵蝎子",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "熔岩蝎子",
        ["兼容单位ID"] = "n013",
        X = 8216.3,
        Y = -28689.4,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵蝎子",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "熔岩蝎子",
        ["兼容单位ID"] = "n013",
        X = 7395.7,
        Y = -27014.6,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵蝎子",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "熔岩蝎子",
        ["兼容单位ID"] = "n013",
        X = 7757.7,
        Y = -26470.2,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵蝎子",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "熔岩蝎子",
        ["兼容单位ID"] = "n013",
        X = 9816.3,
        Y = -27608.4,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵蝎子",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "熔岩蝎子",
        ["兼容单位ID"] = "n013",
        X = 10518.4,
        Y = -27348.7,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵蝎子",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "熔岩蝎子",
        ["兼容单位ID"] = "n013",
        X = 9980.4,
        Y = -26568.1,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵蝎子",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "熔岩蝎子",
        ["兼容单位ID"] = "n013",
        X = 11640.3,
        Y = -27322.9,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵火焰狼蛛",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "火焰狼蛛",
        ["兼容单位ID"] = "n00Z",
        X = 6777.6,
        Y = -29192.6,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵火焰狼蛛",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "火焰狼蛛",
        ["兼容单位ID"] = "n00Z",
        X = 8744.6,
        Y = -28265.7,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵火焰狼蛛",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "火焰狼蛛",
        ["兼容单位ID"] = "n00Z",
        X = 10660.3,
        Y = -28152.6,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵火焰狼蛛",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "火焰狼蛛",
        ["兼容单位ID"] = "n00Z",
        X = 10923.1,
        Y = -26822,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵火焰狼蛛",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "火焰狼蛛",
        ["兼容单位ID"] = "n00Z",
        X = 11829.5,
        Y = -26619.9,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵火焰狼蛛",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "火焰狼蛛",
        ["兼容单位ID"] = "n00Z",
        X = 9126.2,
        Y = -26668.1,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵火焰狼蛛",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "火焰狼蛛",
        ["兼容单位ID"] = "n00Z",
        X = 8598.6,
        Y = -24732.2,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵蜥蜴怪物",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蜥蜴怪物",
        ["兼容单位ID"] = "nslr",
        X = 7860.5,
        Y = -25516.2,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵蜥蜴怪物",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蜥蜴怪物",
        ["兼容单位ID"] = "nslr",
        X = 9128.6,
        Y = -26020.9,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵蜥蜴怪物",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蜥蜴怪物",
        ["兼容单位ID"] = "nslr",
        X = 9259.1,
        Y = -25353.3,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵蜥蜴怪物",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蜥蜴怪物",
        ["兼容单位ID"] = "nslr",
        X = 7893.1,
        Y = -24908.6,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵蜥蜴怪物",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蜥蜴怪物",
        ["兼容单位ID"] = "nslr",
        X = 7537.3,
        Y = -24014,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵蜥蜴怪物",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蜥蜴怪物",
        ["兼容单位ID"] = "nslr",
        X = 9600.3,
        Y = -23902.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "女猎恶魔",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "女猎恶魔骑士",
        ["兼容单位ID"] = "n03D",
        X = 17641.5,
        Y = -17579.9,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "女猎恶魔",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "女猎恶魔骑士",
        ["兼容单位ID"] = "n03D",
        X = 18727.3,
        Y = -17396.3,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "女猎恶魔",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "女猎恶魔骑士",
        ["兼容单位ID"] = "n03D",
        X = 18098.9,
        Y = -16967.6,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "女猎恶魔",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "女猎恶魔骑士",
        ["兼容单位ID"] = "n03D",
        X = 18879.4,
        Y = -18062.9,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "女猎恶魔",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "女猎恶魔骑士",
        ["兼容单位ID"] = "n03D",
        X = 19437.4,
        Y = -16756,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "女猎恶魔",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "女猎恶魔骑士",
        ["兼容单位ID"] = "n03D",
        X = 18491,
        Y = -16203.3,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "女猎恶魔",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "女猎恶魔骑士",
        ["兼容单位ID"] = "n03D",
        X = 18859.5,
        Y = -15534.4,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "女猎恶魔",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "女猎恶魔骑士",
        ["兼容单位ID"] = "n03D",
        X = 19371.2,
        Y = -15721.6,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "女猎恶魔",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "女猎恶魔骑士",
        ["兼容单位ID"] = "n03D",
        X = 18226.1,
        Y = -15370.9,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "女猎恶魔",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "女猎恶魔骑士",
        ["兼容单位ID"] = "n03D",
        X = 18542,
        Y = -14874.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "女猎恶魔",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "女猎恶魔骑士",
        ["兼容单位ID"] = "n03D",
        X = 19463.2,
        Y = -15064,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵恶魔犬",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔犬",
        ["兼容单位ID"] = "n037",
        X = 19976.5,
        Y = -20212.2,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵恶魔犬",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔犬",
        ["兼容单位ID"] = "n037",
        X = 19757.8,
        Y = -20482.7,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵恶魔犬",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔犬",
        ["兼容单位ID"] = "n037",
        X = 20661.8,
        Y = -20441.4,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵恶魔犬",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔犬",
        ["兼容单位ID"] = "n037",
        X = 21238.2,
        Y = -20422.6,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵恶魔犬",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔犬",
        ["兼容单位ID"] = "n037",
        X = 21232.6,
        Y = -19982.4,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵恶魔犬",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔犬",
        ["兼容单位ID"] = "n037",
        X = 21721.1,
        Y = -20306.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵恶魔犬",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔犬",
        ["兼容单位ID"] = "n037",
        X = 21720,
        Y = -19755,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵恶魔犬",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔犬",
        ["兼容单位ID"] = "n037",
        X = 21658.5,
        Y = -19325.3,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "地狱犬骑士",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔地狱犬骑士",
        ["兼容单位ID"] = "n03K",
        X = 20307.9,
        Y = -14572.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "地狱犬骑士",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔地狱犬骑士",
        ["兼容单位ID"] = "n03K",
        X = 21000.3,
        Y = -14907.9,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "地狱犬骑士",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔地狱犬骑士",
        ["兼容单位ID"] = "n03K",
        X = 20944,
        Y = -14109.6,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "地狱犬骑士",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔地狱犬骑士",
        ["兼容单位ID"] = "n03K",
        X = 21642,
        Y = -14743.3,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "地狱犬骑士",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔地狱犬骑士",
        ["兼容单位ID"] = "n03K",
        X = 21723.7,
        Y = -14165.6,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "地狱犬骑士",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔地狱犬骑士",
        ["兼容单位ID"] = "n03K",
        X = 22110.6,
        Y = -15485,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "地狱犬骑士",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔地狱犬骑士",
        ["兼容单位ID"] = "n03K",
        X = 22734,
        Y = -14135.9,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "地狱犬骑士",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔地狱犬骑士",
        ["兼容单位ID"] = "n03K",
        X = 22438.5,
        Y = -14718.8,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "地狱犬骑士",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔地狱犬骑士",
        ["兼容单位ID"] = "n03K",
        X = 22681.1,
        Y = -15504,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔岩恶魔巫师",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔巫师",
        ["兼容单位ID"] = "n03I",
        X = 21923.6,
        Y = -16568.7,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔岩恶魔巫师",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔巫师",
        ["兼容单位ID"] = "n03I",
        X = 22028.7,
        Y = -16096.8,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔岩恶魔巫师",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔巫师",
        ["兼容单位ID"] = "n03I",
        X = 22884.8,
        Y = -15965.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔岩恶魔巫师",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔巫师",
        ["兼容单位ID"] = "n03I",
        X = 22438.3,
        Y = -16887.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔岩恶魔巫师",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔巫师",
        ["兼容单位ID"] = "n03I",
        X = 22861.2,
        Y = -16522.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔岩恶魔巫师",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔巫师",
        ["兼容单位ID"] = "n03I",
        X = 22571.5,
        Y = -17318.2,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔岩恶魔巫师",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔巫师",
        ["兼容单位ID"] = "n03I",
        X = 21818.3,
        Y = -17181.3,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔岩恶魔巫师",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔巫师",
        ["兼容单位ID"] = "n03I",
        X = 21798,
        Y = -17705.4,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔岩恶魔战士",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔战士",
        ["兼容单位ID"] = "n03L",
        X = 24307.7,
        Y = -17782.9,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔岩恶魔战士",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔战士",
        ["兼容单位ID"] = "n03L",
        X = 24397.9,
        Y = -17448.3,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔岩恶魔战士",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔战士",
        ["兼容单位ID"] = "n03L",
        X = 24994.2,
        Y = -18182.8,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔岩恶魔战士",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔战士",
        ["兼容单位ID"] = "n03L",
        X = 25749.7,
        Y = -17907.3,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔岩恶魔战士",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔战士",
        ["兼容单位ID"] = "n03L",
        X = 25389.3,
        Y = -17473.7,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔岩恶魔战士",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔战士",
        ["兼容单位ID"] = "n03L",
        X = 26174,
        Y = -16975.9,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔岩恶魔战士",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔战士",
        ["兼容单位ID"] = "n03L",
        X = 26567.4,
        Y = -17677.6,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔岩恶魔战士",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔战士",
        ["兼容单位ID"] = "n03L",
        X = 27194.7,
        Y = -17230.7,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔岩恶魔战士",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔战士",
        ["兼容单位ID"] = "n03L",
        X = 27158.8,
        Y = -17957.7,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔岩恶魔剑客",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔剑客",
        ["兼容单位ID"] = "n03M",
        X = 24713.3,
        Y = -17495.4,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔岩恶魔剑客",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔剑客",
        ["兼容单位ID"] = "n03M",
        X = 24740.4,
        Y = -17799.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔岩恶魔剑客",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔剑客",
        ["兼容单位ID"] = "n03M",
        X = 25205.2,
        Y = -16917.9,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔岩恶魔剑客",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔剑客",
        ["兼容单位ID"] = "n03M",
        X = 25671.5,
        Y = -18959.7,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔岩恶魔剑客",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔剑客",
        ["兼容单位ID"] = "n03M",
        X = 25961.2,
        Y = -17359.8,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔岩恶魔剑客",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔剑客",
        ["兼容单位ID"] = "n03M",
        X = 26225.6,
        Y = -18282.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔岩恶魔剑客",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔剑客",
        ["兼容单位ID"] = "n03M",
        X = 26800.4,
        Y = -18295.9,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔岩恶魔剑客",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔剑客",
        ["兼容单位ID"] = "n03M",
        X = 26819.7,
        Y = -16905.7,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔岩恶魔剑客",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔剑客",
        ["兼容单位ID"] = "n03M",
        X = 27297.5,
        Y = -17511.4,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "野狼",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "森林野狼",
        ["兼容单位ID"] = "nwlt",
        X = -28376.3,
        Y = -11289.1,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "野狼",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "森林野狼",
        ["兼容单位ID"] = "nwlt",
        X = -27980.7,
        Y = -11164.2,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "野狼",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "森林野狼",
        ["兼容单位ID"] = "nwlt",
        X = -27851.8,
        Y = -10749,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "野狼",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "森林野狼",
        ["兼容单位ID"] = "nwlt",
        X = -28233.5,
        Y = -10153.4,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "野狼",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "森林野狼",
        ["兼容单位ID"] = "nwlt",
        X = -28898,
        Y = -10601.6,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "野狼",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "森林野狼",
        ["兼容单位ID"] = "nwlt",
        X = -28817.6,
        Y = -10121.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "野狼",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "森林野狼",
        ["兼容单位ID"] = "nwlt",
        X = -28297.6,
        Y = -9709.9,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "野狼",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "森林野狼",
        ["兼容单位ID"] = "nwlt",
        X = -27736.4,
        Y = -9605.1,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "野猪",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "森林野猪",
        ["兼容单位ID"] = "n012",
        X = -27943.4,
        Y = -8423.9,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "野猪",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "森林野猪",
        ["兼容单位ID"] = "n012",
        X = -28924.5,
        Y = -8529.6,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "野猪",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "森林野猪",
        ["兼容单位ID"] = "n012",
        X = -29037.4,
        Y = -8000.8,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "野猪",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "森林野猪",
        ["兼容单位ID"] = "n012",
        X = -28071.8,
        Y = -7720.1,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "野猪",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "森林野猪",
        ["兼容单位ID"] = "n012",
        X = -28695.3,
        Y = -7460.7,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "野猪",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "森林野猪",
        ["兼容单位ID"] = "n012",
        X = -27820.6,
        Y = -8837.1,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "野猪",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "森林野猪",
        ["兼容单位ID"] = "n012",
        X = -27766.7,
        Y = -7641.3,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "野猪",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "森林野猪",
        ["兼容单位ID"] = "n012",
        X = -28372.6,
        Y = -7304.3,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "食尸鬼",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔食尸鬼",
        ["兼容单位ID"] = "u001",
        X = 14093.4,
        Y = -10462.8,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "食尸鬼",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔食尸鬼",
        ["兼容单位ID"] = "u001",
        X = 14226.2,
        Y = -11024.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "食尸鬼",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔食尸鬼",
        ["兼容单位ID"] = "u001",
        X = 15004,
        Y = -10681.8,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "食尸鬼",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔食尸鬼",
        ["兼容单位ID"] = "u001",
        X = 15781.5,
        Y = -11403.3,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "食尸鬼",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔食尸鬼",
        ["兼容单位ID"] = "u001",
        X = 16217.3,
        Y = -10662.8,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "食尸鬼",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔食尸鬼",
        ["兼容单位ID"] = "u001",
        X = 16675.3,
        Y = -10662.8,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "食尸鬼",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔食尸鬼",
        ["兼容单位ID"] = "u001",
        X = 16675.3,
        Y = -11579.3,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "食尸鬼",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔食尸鬼",
        ["兼容单位ID"] = "u001",
        X = 16995.1,
        Y = -10682.3,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "食尸鬼",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔食尸鬼",
        ["兼容单位ID"] = "u001",
        X = 17328.7,
        Y = -12569.7,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "食尸鬼",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔食尸鬼",
        ["兼容单位ID"] = "u001",
        X = 17762.3,
        Y = -11738.8,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "食尸鬼",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔食尸鬼",
        ["兼容单位ID"] = "u001",
        X = 17962.4,
        Y = -11977.7,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "食尸鬼",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔食尸鬼",
        ["兼容单位ID"] = "u001",
        X = 17400.3,
        Y = -9883.1,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "食尸鬼",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔食尸鬼",
        ["兼容单位ID"] = "u001",
        X = 18013.8,
        Y = -10150.9,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "食尸鬼",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔食尸鬼",
        ["兼容单位ID"] = "u001",
        X = 19371.8,
        Y = -12667.4,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "食尸鬼",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔食尸鬼",
        ["兼容单位ID"] = "u001",
        X = 19975.3,
        Y = -12065.4,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "食尸鬼",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔食尸鬼",
        ["兼容单位ID"] = "u001",
        X = 18329.3,
        Y = -12909,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "食尸鬼",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔食尸鬼",
        ["兼容单位ID"] = "u001",
        X = 20523.8,
        Y = -12833.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔岩火焰恶魔",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "火焰恶魔",
        ["兼容单位ID"] = "n00Y",
        X = 14097.7,
        Y = -10688.1,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔岩火焰恶魔",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "火焰恶魔",
        ["兼容单位ID"] = "n00Y",
        X = 15997.3,
        Y = -10999.1,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔岩火焰恶魔",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "火焰恶魔",
        ["兼容单位ID"] = "n00Y",
        X = 18238.2,
        Y = -11788.2,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔岩火焰恶魔",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "火焰恶魔",
        ["兼容单位ID"] = "n00Y",
        X = 17754.8,
        Y = -9951.9,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔岩火焰恶魔",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "火焰恶魔",
        ["兼容单位ID"] = "n00Y",
        X = 19668.8,
        Y = -12376.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔岩奥术熔灵",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "奥术熔灵",
        ["兼容单位ID"] = "n00L",
        X = 20745,
        Y = -11092.3,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔岩奥术熔灵",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "奥术熔灵",
        ["兼容单位ID"] = "n00L",
        X = 21839.2,
        Y = -12481.4,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔岩奥术熔灵",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "奥术熔灵",
        ["兼容单位ID"] = "n00L",
        X = 19675,
        Y = -10455.2,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔岩奥术熔灵",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "奥术熔灵",
        ["兼容单位ID"] = "n00L",
        X = 18936.4,
        Y = -10747.8,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔岩奥术熔灵",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "奥术熔灵",
        ["兼容单位ID"] = "n00L",
        X = 22684.2,
        Y = -12613.1,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔岩奥术熔灵",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "奥术熔灵",
        ["兼容单位ID"] = "n00L",
        X = 23623.3,
        Y = -12609.3,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔岩奥术熔灵",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "奥术熔灵",
        ["兼容单位ID"] = "n00L",
        X = 23317.9,
        Y = -11206.7,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔岩奥术熔灵",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "奥术熔灵",
        ["兼容单位ID"] = "n00L",
        X = 23214.4,
        Y = -9893,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔岩奥术熔灵",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "奥术熔灵",
        ["兼容单位ID"] = "n00L",
        X = 22272.3,
        Y = -9559.2,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔岩奥术熔灵",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "奥术熔灵",
        ["兼容单位ID"] = "n00L",
        X = 21371.9,
        Y = -9819,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔岩奥术熔灵",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "奥术熔灵",
        ["兼容单位ID"] = "n00L",
        X = 20317.3,
        Y = -9920.4,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵元素",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "熔岩元素",
        ["兼容单位ID"] = "n027",
        X = 16153.9,
        Y = -9735.2,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵元素",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "熔岩元素",
        ["兼容单位ID"] = "n027",
        X = 16528.7,
        Y = -8923.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵元素",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "熔岩元素",
        ["兼容单位ID"] = "n027",
        X = 15871,
        Y = -8399.6,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵元素",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "熔岩元素",
        ["兼容单位ID"] = "n027",
        X = 17255.7,
        Y = -8177.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵元素",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "熔岩元素",
        ["兼容单位ID"] = "n027",
        X = 18099.6,
        Y = -8621.2,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵元素",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "熔岩元素",
        ["兼容单位ID"] = "n027",
        X = 17639.9,
        Y = -7764.3,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵元素",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "熔岩元素",
        ["兼容单位ID"] = "n027",
        X = 16570.8,
        Y = -7828.6,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵恶魔男巫",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔男巫",
        ["兼容单位ID"] = "ners",
        X = 24942.1,
        Y = -2677.1,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵恶魔男巫",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔男巫",
        ["兼容单位ID"] = "ners",
        X = 26600.6,
        Y = -3126.8,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵恶魔男巫",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔男巫",
        ["兼容单位ID"] = "ners",
        X = 23736.5,
        Y = -5165.9,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵恶魔男巫",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔男巫",
        ["兼容单位ID"] = "ners",
        X = 25734,
        Y = -6300.8,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵恶魔男巫",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔男巫",
        ["兼容单位ID"] = "ners",
        X = 25510.6,
        Y = -4998.2,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵恶魔男巫",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔男巫",
        ["兼容单位ID"] = "ners",
        X = 26709.8,
        Y = -5572.9,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵恶魔男巫",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔男巫",
        ["兼容单位ID"] = "ners",
        X = 25676.8,
        Y = -8067.9,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵恶魔男巫",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔男巫",
        ["兼容单位ID"] = "ners",
        X = 26834.7,
        Y = -8739.6,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵恶魔男巫",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔男巫",
        ["兼容单位ID"] = "ners",
        X = 27842.4,
        Y = -10089.4,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵恶魔男巫",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔男巫",
        ["兼容单位ID"] = "ners",
        X = 28022,
        Y = -8869.9,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵恶魔男巫",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "恶魔男巫",
        ["兼容单位ID"] = "ners",
        X = 25996.6,
        Y = -9817.8,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "地狱火",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "熔岩地狱火",
        ["兼容单位ID"] = "n00Q",
        X = 19491.8,
        Y = -8621.2,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "地狱火",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "熔岩地狱火",
        ["兼容单位ID"] = "n00Q",
        X = 20368.5,
        Y = -8599.8,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "地狱火",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "熔岩地狱火",
        ["兼容单位ID"] = "n00Q",
        X = 21462.2,
        Y = -8705.4,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "地狱火",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "熔岩地狱火",
        ["兼容单位ID"] = "n00Q",
        X = 20822.9,
        Y = -7359.7,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "地狱火",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "熔岩地狱火",
        ["兼容单位ID"] = "n00Q",
        X = 18725.6,
        Y = -7482.9,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "地狱火",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "熔岩地狱火",
        ["兼容单位ID"] = "n00Q",
        X = 18442.5,
        Y = -6471.8,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "地狱火",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "熔岩地狱火",
        ["兼容单位ID"] = "n00Q",
        X = 22500,
        Y = -8063.6,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "地狱火",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "熔岩地狱火",
        ["兼容单位ID"] = "n00Q",
        X = 20368.3,
        Y = -5970.2,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "地狱火",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "熔岩地狱火",
        ["兼容单位ID"] = "n00Q",
        X = 19078.7,
        Y = -5761.2,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "地狱火",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "熔岩地狱火",
        ["兼容单位ID"] = "n00Q",
        X = 19517.9,
        Y = -4987.1,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "地狱火",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "熔岩地狱火",
        ["兼容单位ID"] = "n00Q",
        X = 20388.5,
        Y = -5149.7,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵恶魔战士",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "火焰恶魔战士",
        ["兼容单位ID"] = "n03R",
        X = 21733.1,
        Y = -2875.8,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵恶魔战士",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "火焰恶魔战士",
        ["兼容单位ID"] = "n03R",
        X = 22330.8,
        Y = -3272.6,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵恶魔战士",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "火焰恶魔战士",
        ["兼容单位ID"] = "n03R",
        X = 21493.8,
        Y = -4053.3,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵恶魔战士",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "火焰恶魔战士",
        ["兼容单位ID"] = "n03R",
        X = 21457.6,
        Y = -4758.6,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵恶魔战士",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "火焰恶魔战士",
        ["兼容单位ID"] = "n03R",
        X = 21532.4,
        Y = -5930.8,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵恶魔战士",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "火焰恶魔战士",
        ["兼容单位ID"] = "n03R",
        X = 23359.8,
        Y = -6221.9,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵恶魔战士",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "火焰恶魔战士",
        ["兼容单位ID"] = "n03R",
        X = 22756.3,
        Y = -2729.8,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵恶魔战士",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "火焰恶魔战士",
        ["兼容单位ID"] = "n03R",
        X = 23510.2,
        Y = -2551.6,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵恶魔战士",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "火焰恶魔战士",
        ["兼容单位ID"] = "n03R",
        X = 24558.3,
        Y = -8407,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵恶魔战士",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "火焰恶魔战士",
        ["兼容单位ID"] = "n03R",
        X = 25156.8,
        Y = -7274.8,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵恶魔战士",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "火焰恶魔战士",
        ["兼容单位ID"] = "n03R",
        X = 23891.4,
        Y = -7340.7,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵恶魔战士",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "火焰恶魔战士",
        ["兼容单位ID"] = "n03R",
        X = 23416.6,
        Y = -6145,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵恶魔战士",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "火焰恶魔战士",
        ["兼容单位ID"] = "n03R",
        X = 22132.6,
        Y = -6396.4,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "熔灵恶魔战士",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "火焰恶魔战士",
        ["兼容单位ID"] = "n03R",
        X = 24828.1,
        Y = -6203.8,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "墓地亡灵骷髅",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "亡灵骷髅",
        ["兼容单位ID"] = "n041",
        X = 10421.5,
        Y = -16321.3,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "墓地亡灵骷髅",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "亡灵骷髅",
        ["兼容单位ID"] = "n041",
        X = 5912.7,
        Y = -16588.9,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "墓地亡灵骷髅",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "亡灵骷髅",
        ["兼容单位ID"] = "n041",
        X = 6471.7,
        Y = -16490,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "墓地亡灵骷髅",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "亡灵骷髅",
        ["兼容单位ID"] = "n041",
        X = 8932.5,
        Y = -17891.1,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "墓地亡灵骷髅",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "亡灵骷髅",
        ["兼容单位ID"] = "n041",
        X = 8559.4,
        Y = -18375.6,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "墓地亡灵骷髅",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "亡灵骷髅",
        ["兼容单位ID"] = "n041",
        X = 9679.3,
        Y = -18462.6,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "墓地亡灵骷髅",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "亡灵骷髅",
        ["兼容单位ID"] = "n041",
        X = 9498.7,
        Y = -17968.1,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "墓地亡灵骷髅",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "亡灵骷髅",
        ["兼容单位ID"] = "n041",
        X = 9558.1,
        Y = -17098.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "墓地亡灵骷髅",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "亡灵骷髅",
        ["兼容单位ID"] = "n041",
        X = 10224.5,
        Y = -18222,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "墓地亡灵骷髅",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "亡灵骷髅",
        ["兼容单位ID"] = "n041",
        X = 10287.4,
        Y = -17491,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "墓地亡灵骷髅",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "亡灵骷髅",
        ["兼容单位ID"] = "n041",
        X = 10719.1,
        Y = -17039.1,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "墓地亡灵骷髅",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "亡灵骷髅",
        ["兼容单位ID"] = "n041",
        X = 10492.5,
        Y = -16320.9,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "墓地亡灵骷髅",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "亡灵骷髅",
        ["兼容单位ID"] = "n041",
        X = 10786.1,
        Y = -17663.3,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "墓地亡灵骷髅",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "亡灵骷髅",
        ["兼容单位ID"] = "n041",
        X = 11086.5,
        Y = -16559.1,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "墓地亡灵骷髅",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "亡灵骷髅",
        ["兼容单位ID"] = "n041",
        X = 7388.1,
        Y = -17583.3,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "墓地亡灵骷髅",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "亡灵骷髅",
        ["兼容单位ID"] = "n041",
        X = 5969.3,
        Y = -17513.3,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "墓地亡灵骷髅",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "亡灵骷髅",
        ["兼容单位ID"] = "n041",
        X = 5440.1,
        Y = -17218.6,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "墓地亡灵骷髅",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "亡灵骷髅",
        ["兼容单位ID"] = "n041",
        X = 6497.5,
        Y = -17447.1,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "墓地亡灵巫师",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "亡灵巫师",
        ["兼容单位ID"] = "n043",
        X = 5648.8,
        Y = -17723.7,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "墓地亡灵巫师",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "亡灵巫师",
        ["兼容单位ID"] = "n043",
        X = 7087.9,
        Y = -17286.9,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "墓地亡灵巫师",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "亡灵巫师",
        ["兼容单位ID"] = "n043",
        X = 5346.5,
        Y = -16761.4,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "墓地亡灵巫师",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "亡灵巫师",
        ["兼容单位ID"] = "n043",
        X = 9194.3,
        Y = -18263.1,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "墓地亡灵巫师",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "亡灵巫师",
        ["兼容单位ID"] = "n043",
        X = 9897.1,
        Y = -17657.1,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "墓地亡灵巫师",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "亡灵巫师",
        ["兼容单位ID"] = "n043",
        X = 10769.9,
        Y = -17494.1,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "湖底水母",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "水底水母",
        ["兼容单位ID"] = "n01A",
        X = 19506.7,
        Y = -26745.3,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "湖底水母",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "水底水母",
        ["兼容单位ID"] = "n01A",
        X = 20327.8,
        Y = -27695,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "湖底水母",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "水底水母",
        ["兼容单位ID"] = "n01A",
        X = 21685.1,
        Y = -28401.7,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "湖底水母",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "水底水母",
        ["兼容单位ID"] = "n01A",
        X = 22706.5,
        Y = -27399.7,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "湖底水母",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "水底水母",
        ["兼容单位ID"] = "n01A",
        X = 19548.3,
        Y = -27538.4,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "湖底水母",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "水底水母",
        ["兼容单位ID"] = "n01A",
        X = 20119.9,
        Y = -29482.8,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "湖底水母",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "水底水母",
        ["兼容单位ID"] = "n01A",
        X = 19847,
        Y = -28400.3,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "湖底水母",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "水底水母",
        ["兼容单位ID"] = "n01A",
        X = 20619.7,
        Y = -28837.8,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "湖底水母",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "水底水母",
        ["兼容单位ID"] = "n01A",
        X = 21263.3,
        Y = -29631.1,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "湖底水母",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "水底水母",
        ["兼容单位ID"] = "n01A",
        X = 22115.3,
        Y = -29519.8,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "湖底水母",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "水底水母",
        ["兼容单位ID"] = "n01A",
        X = 22806.6,
        Y = -28702.7,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "湖底水母",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "水底水母",
        ["兼容单位ID"] = "n01A",
        X = 23369.7,
        Y = -29490.3,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "湖底水母",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "水底水母",
        ["兼容单位ID"] = "n01A",
        X = 24018.5,
        Y = -29435.2,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "湖底水母",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "水底水母",
        ["兼容单位ID"] = "n01A",
        X = 23529.1,
        Y = -27795.6,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "湖底水母",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "水底水母",
        ["兼容单位ID"] = "n01A",
        X = 24052.7,
        Y = -28208.6,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠蒙面人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蒙面人",
        ["兼容单位ID"] = "n00G",
        X = 24511.2,
        Y = -24168.2,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠蒙面人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蒙面人",
        ["兼容单位ID"] = "n00G",
        X = 24962.4,
        Y = -24174.8,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠蒙面人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蒙面人",
        ["兼容单位ID"] = "n00G",
        X = 24481.8,
        Y = -25524.2,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠蒙面人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蒙面人",
        ["兼容单位ID"] = "n00G",
        X = 25163,
        Y = -25524.2,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠蒙面人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蒙面人",
        ["兼容单位ID"] = "n00G",
        X = 26680,
        Y = -25591.1,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠蒙面人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蒙面人",
        ["兼容单位ID"] = "n00G",
        X = 26354,
        Y = -24504.8,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠蒙面人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蒙面人",
        ["兼容单位ID"] = "n00G",
        X = 26493,
        Y = -26328.6,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠蒙面人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蒙面人",
        ["兼容单位ID"] = "n00G",
        X = 27116.6,
        Y = -26604.9,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠蒙面人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蒙面人",
        ["兼容单位ID"] = "n00G",
        X = 27749.5,
        Y = -25943.7,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠蒙面人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蒙面人",
        ["兼容单位ID"] = "n00G",
        X = 28674.8,
        Y = -24440.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "沙漠蒙面人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蒙面人",
        ["兼容单位ID"] = "n00G",
        X = 29257.8,
        Y = -25186.5,
        ["朝向"] = "278.0"
    },
    {
        ["分组名"] = "沙漠蒙面人",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "蒙面人",
        ["兼容单位ID"] = "n00G",
        X = 29221.8,
        Y = -25883.8,
        ["朝向"] = "90.0"
    },
    {
        ["分组名"] = "双翼恶魔A",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "双翼恶魔",
        ["兼容单位ID"] = "u003",
        X = 24789.4,
        Y = -13069.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "双翼恶魔A",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "双翼恶魔",
        ["兼容单位ID"] = "u003",
        X = 26819.3,
        Y = -13935,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "双翼恶魔A",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "双翼恶魔",
        ["兼容单位ID"] = "u003",
        X = 28032.1,
        Y = -13936.9,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "双翼恶魔A",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "双翼恶魔",
        ["兼容单位ID"] = "u003",
        X = 29688.4,
        Y = -13890.8,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "双翼恶魔A",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "双翼恶魔",
        ["兼容单位ID"] = "u003",
        X = 29818.9,
        Y = -13096.1,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "双翼恶魔A",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "双翼恶魔",
        ["兼容单位ID"] = "u003",
        X = 29743.3,
        Y = -11741.7,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "双翼恶魔A",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "双翼恶魔",
        ["兼容单位ID"] = "u003",
        X = 27399.4,
        Y = -10864.2,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "双翼恶魔A",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "双翼恶魔",
        ["兼容单位ID"] = "u003",
        X = 27985.3,
        Y = -10861.2,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "双翼恶魔A",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "双翼恶魔",
        ["兼容单位ID"] = "u003",
        X = 29867.4,
        Y = -10803.2,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "双翼恶魔A",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "双翼恶魔",
        ["兼容单位ID"] = "u003",
        X = 29647,
        Y = -9865.2,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "双翼恶魔B",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "双翼恶魔demon",
        ["兼容单位ID"] = "u002",
        X = 24978.7,
        Y = -12273.3,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "双翼恶魔B",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "双翼恶魔demon",
        ["兼容单位ID"] = "u002",
        X = 26092.9,
        Y = -11832.1,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "双翼恶魔B",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "双翼恶魔demon",
        ["兼容单位ID"] = "u002",
        X = 26968.3,
        Y = -11976.6,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "双翼恶魔B",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "双翼恶魔demon",
        ["兼容单位ID"] = "u002",
        X = 27798.1,
        Y = -13585.7,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "双翼恶魔B",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "双翼恶魔demon",
        ["兼容单位ID"] = "u002",
        X = 25932.6,
        Y = -14005.9,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "双翼恶魔B",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "双翼恶魔demon",
        ["兼容单位ID"] = "u002",
        X = 26990.6,
        Y = -11727.6,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "双翼恶魔B",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "双翼恶魔demon",
        ["兼容单位ID"] = "u002",
        X = 28962.3,
        Y = -10292.6,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "双翼恶魔B",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "双翼恶魔demon",
        ["兼容单位ID"] = "u002",
        X = 29227.1,
        Y = -11341.1,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "坟墓守卫巫师",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "亡灵守卫巫师",
        ["兼容单位ID"] = "n042",
        X = 10606.4,
        Y = -15820,
        ["朝向"] = 71.42
    },
    {
        ["分组名"] = "坟墓守卫巫师",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "亡灵守卫巫师",
        ["兼容单位ID"] = "n042",
        X = 11316.1,
        Y = -15834,
        ["朝向"] = 139.04
    },
    {
        ["分组名"] = "小蛇",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "小蛇",
        ["兼容单位ID"] = "n01Z",
        X = 1424.9,
        Y = -21709.7,
        ["朝向"] = 122
    },
    {
        ["分组名"] = "小蛇",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "小蛇",
        ["兼容单位ID"] = "n01Z",
        X = 1625.5,
        Y = -22088.8,
        ["朝向"] = 229
    },
    {
        ["分组名"] = "咆哮之熊1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "咆哮之熊",
        ["兼容单位ID"] = "n04G",
        X = -18225.1,
        Y = -15877.7,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "咆哮之熊1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "咆哮之熊",
        ["兼容单位ID"] = "n04G",
        X = -17434.8,
        Y = -16632.2,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "咆哮之熊1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "咆哮之熊",
        ["兼容单位ID"] = "n04G",
        X = -16770.7,
        Y = -14916.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "咆哮之熊1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "咆哮之熊",
        ["兼容单位ID"] = "n04G",
        X = -16647.4,
        Y = -15886.2,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "咆哮之熊1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "咆哮之熊",
        ["兼容单位ID"] = "n04G",
        X = -17854.6,
        Y = -17341.4,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "咆哮之熊1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "咆哮之熊",
        ["兼容单位ID"] = "n04G",
        X = -16528.8,
        Y = -16764.4,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "咆哮之熊1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "咆哮之熊",
        ["兼容单位ID"] = "n04G",
        X = -15952.7,
        Y = -17825.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "咆哮之熊1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "咆哮之熊",
        ["兼容单位ID"] = "n04G",
        X = -15955.7,
        Y = -15747.8,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "咆哮之熊1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "咆哮之熊",
        ["兼容单位ID"] = "n04G",
        X = -15435.1,
        Y = -16731.2,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "食人花1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "食人花",
        ["兼容单位ID"] = "n04J",
        X = -14390,
        Y = -17482,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "食人花1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "食人花",
        ["兼容单位ID"] = "n04J",
        X = -14044.3,
        Y = -16965.2,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "食人花1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "食人花",
        ["兼容单位ID"] = "n04J",
        X = -12724.4,
        Y = -17678.8,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "食人花1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "食人花",
        ["兼容单位ID"] = "n04J",
        X = -12498.7,
        Y = -16967.7,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "食人花1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "食人花",
        ["兼容单位ID"] = "n04J",
        X = -11319.1,
        Y = -17540.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "食人花1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "食人花",
        ["兼容单位ID"] = "n04J",
        X = -10056.3,
        Y = -17192.1,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "食人花1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "食人花",
        ["兼容单位ID"] = "n04J",
        X = -9741.2,
        Y = -17838.8,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "食人花1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "食人花",
        ["兼容单位ID"] = "n04J",
        X = -8737,
        Y = -17303.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "食人花1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "食人花",
        ["兼容单位ID"] = "n04J",
        X = -14684.7,
        Y = -13538.6,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "食人花1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "食人花",
        ["兼容单位ID"] = "n04J",
        X = -13972.3,
        Y = -12797.4,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "食人花1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "食人花",
        ["兼容单位ID"] = "n04J",
        X = -15652.4,
        Y = -11627.7,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "食人花1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "食人花",
        ["兼容单位ID"] = "n04J",
        X = -16844.6,
        Y = -11359.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "大嘴食人花1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "大嘴食人花",
        ["兼容单位ID"] = "n04K",
        X = -14002.5,
        Y = -17660.4,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "大嘴食人花1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "大嘴食人花",
        ["兼容单位ID"] = "n04K",
        X = -13351.7,
        Y = -16838.6,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "大嘴食人花1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "大嘴食人花",
        ["兼容单位ID"] = "n04K",
        X = -12141.3,
        Y = -17988.7,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "大嘴食人花1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "大嘴食人花",
        ["兼容单位ID"] = "n04K",
        X = -11864.2,
        Y = -16858.6,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "大嘴食人花1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "大嘴食人花",
        ["兼容单位ID"] = "n04K",
        X = -10605.3,
        Y = -17064.7,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "大嘴食人花1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "大嘴食人花",
        ["兼容单位ID"] = "n04K",
        X = -8754.4,
        Y = -17930.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "大嘴食人花1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "大嘴食人花",
        ["兼容单位ID"] = "n04K",
        X = -7635.1,
        Y = -16816.2,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "大嘴食人花1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "大嘴食人花",
        ["兼容单位ID"] = "n04K",
        X = -14275.9,
        Y = -12037.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "森林妖精1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "森林妖精",
        ["兼容单位ID"] = "edry",
        X = -15091,
        Y = -13744.2,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "森林妖精1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "森林妖精",
        ["兼容单位ID"] = "edry",
        X = -14395.2,
        Y = -13496.8,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "森林妖精1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "森林妖精",
        ["兼容单位ID"] = "edry",
        X = -13936.4,
        Y = -12281.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "森林妖精1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "森林妖精",
        ["兼容单位ID"] = "edry",
        X = -14509,
        Y = -11958.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "森林妖精1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "森林妖精",
        ["兼容单位ID"] = "edry",
        X = -15336.5,
        Y = -11672.6,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "森林妖精1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "森林妖精",
        ["兼容单位ID"] = "edry",
        X = -16239.5,
        Y = -11442.1,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "森林妖精1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "森林妖精",
        ["兼容单位ID"] = "edry",
        X = -17052.9,
        Y = -10935,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "森林妖精1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "森林妖精",
        ["兼容单位ID"] = "edry",
        X = -17044.2,
        Y = -11599.6,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "变异精灵1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "变异精灵",
        ["兼容单位ID"] = "n053",
        X = -26717.7,
        Y = -2928.4,
        ["朝向"] = 53.15
    },
    {
        ["分组名"] = "变异精灵1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "变异精灵",
        ["兼容单位ID"] = "n053",
        X = -26659.1,
        Y = -3400.7,
        ["朝向"] = 310.44
    },
    {
        ["分组名"] = "变异精灵1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "变异精灵",
        ["兼容单位ID"] = "n053",
        X = -26704.7,
        Y = -3740.9,
        ["朝向"] = 160
    },
    {
        ["分组名"] = "变异精灵1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "变异精灵",
        ["兼容单位ID"] = "n053",
        X = -26314.2,
        Y = -3842.7,
        ["朝向"] = 151.87
    },
    {
        ["分组名"] = "变异精灵1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "变异精灵",
        ["兼容单位ID"] = "n053",
        X = -26672.4,
        Y = -4408.5,
        ["朝向"] = 221
    },
    {
        ["分组名"] = "变异精灵1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "变异精灵",
        ["兼容单位ID"] = "n053",
        X = -27315.5,
        Y = -5184,
        ["朝向"] = 107.33
    },
    {
        ["分组名"] = "变异精灵1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "变异精灵",
        ["兼容单位ID"] = "n053",
        X = -28320.5,
        Y = -5121.1,
        ["朝向"] = 230.46
    },
    {
        ["分组名"] = "森林巨魔1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "森林巨魔",
        ["兼容单位ID"] = "nftr",
        X = -4416.2,
        Y = -15380.7,
        ["朝向"] = 24.68
    },
    {
        ["分组名"] = "森林巨魔1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "森林巨魔",
        ["兼容单位ID"] = "nftr",
        X = -4460.2,
        Y = -15636.8,
        ["朝向"] = 35.94
    },
    {
        ["分组名"] = "森林巨魔1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "森林巨魔",
        ["兼容单位ID"] = "nftr",
        X = -4639.1,
        Y = -16100.2,
        ["朝向"] = 99.04
    },
    {
        ["分组名"] = "森林巨魔1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "森林巨魔",
        ["兼容单位ID"] = "nftr",
        X = -3323.2,
        Y = -15377,
        ["朝向"] = 300.53
    },
    {
        ["分组名"] = "森林巨魔1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "森林巨魔",
        ["兼容单位ID"] = "nftr",
        X = -3073.6,
        Y = -15883.8,
        ["朝向"] = 263.81
    },
    {
        ["分组名"] = "森林巨魔1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "森林巨魔",
        ["兼容单位ID"] = "nftr",
        X = -3545.8,
        Y = -15989.8,
        ["朝向"] = 198
    },
    {
        ["分组名"] = "森林巨魔1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "森林巨魔",
        ["兼容单位ID"] = "nftr",
        X = -2783.5,
        Y = -15861.9,
        ["朝向"] = 248.01
    },
    {
        ["分组名"] = "森林巨魔1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "森林巨魔",
        ["兼容单位ID"] = "nftr",
        X = -3746.1,
        Y = -16725.8,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "森林巨魔1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "森林巨魔",
        ["兼容单位ID"] = "nftr",
        X = -4051.9,
        Y = -16816.9,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "森林巨魔1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "森林巨魔",
        ["兼容单位ID"] = "nftr",
        X = -2784.7,
        Y = -17198.6,
        ["朝向"] = 248.01
    },
    {
        ["分组名"] = "树魔猎手1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "树魔猎手",
        ["兼容单位ID"] = "n04Y",
        X = -1584.6,
        Y = -15202.6,
        ["朝向"] = 288.85
    },
    {
        ["分组名"] = "树魔猎手1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "树魔猎手",
        ["兼容单位ID"] = "n04Y",
        X = -1527.6,
        Y = -14563.7,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "树魔猎手1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "树魔猎手",
        ["兼容单位ID"] = "n04Y",
        X = -971.6,
        Y = -15789.1,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "树魔猎手1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "树魔猎手",
        ["兼容单位ID"] = "n04Y",
        X = -614.2,
        Y = -15102.7,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "树魔猎手1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "树魔猎手",
        ["兼容单位ID"] = "n04Y",
        X = -176,
        Y = -16334,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "树魔猎手1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "树魔猎手",
        ["兼容单位ID"] = "n04Y",
        X = 668,
        Y = -15968.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "树魔猎手1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "树魔猎手",
        ["兼容单位ID"] = "n04Y",
        X = -3121.8,
        Y = -17641.9,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "树魔猎手1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "树魔猎手",
        ["兼容单位ID"] = "n04Y",
        X = -2129.1,
        Y = -17408.8,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "树魔猎手1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "树魔猎手",
        ["兼容单位ID"] = "n04Y",
        X = -562.1,
        Y = -17397.3,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "树魔猎手1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "树魔猎手",
        ["兼容单位ID"] = "n04Y",
        X = -454.6,
        Y = -18001.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "树魔狂战士1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "树魔狂战士",
        ["兼容单位ID"] = "nftb",
        X = 2787.9,
        Y = -13914.6,
        ["朝向"] = 249.77
    },
    {
        ["分组名"] = "树魔狂战士1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "树魔狂战士",
        ["兼容单位ID"] = "nftb",
        X = -2841.7,
        Y = -14397.8,
        ["朝向"] = 180
    },
    {
        ["分组名"] = "树魔狂战士1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "树魔狂战士",
        ["兼容单位ID"] = "nftb",
        X = -258.5,
        Y = -15740,
        ["朝向"] = 249.77
    },
    {
        ["分组名"] = "树魔狂战士1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "树魔狂战士",
        ["兼容单位ID"] = "nftb",
        X = 569.2,
        Y = -15524.5,
        ["朝向"] = 232.95
    },
    {
        ["分组名"] = "树魔狂战士1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "树魔狂战士",
        ["兼容单位ID"] = "nftb",
        X = 452.5,
        Y = -16721.1,
        ["朝向"] = 109.15
    },
    {
        ["分组名"] = "树魔狂战士1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "树魔狂战士",
        ["兼容单位ID"] = "nftb",
        X = 978.4,
        Y = -16191.2,
        ["朝向"] = 135
    },
    {
        ["分组名"] = "树魔狂战士1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "树魔狂战士",
        ["兼容单位ID"] = "nftb",
        X = -1007.2,
        Y = -17420.8,
        ["朝向"] = 145
    },
    {
        ["分组名"] = "树魔狂战士1",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "树魔狂战士",
        ["兼容单位ID"] = "nftb",
        X = -1969.9,
        Y = -17652,
        ["朝向"] = 135
    },
    {
        ["分组名"] = "毒杂草",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "有毒杂草",
        ["兼容单位ID"] = "nsko",
        X = -17245.9,
        Y = -30062.8,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "毒杂草",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "有毒杂草",
        ["兼容单位ID"] = "nsko",
        X = -18258,
        Y = -30077.8,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "毒杂草",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "有毒杂草",
        ["兼容单位ID"] = "nsko",
        X = -17776.3,
        Y = -29358.8,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "毒杂草",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "有毒杂草",
        ["兼容单位ID"] = "nsko",
        X = -18842.8,
        Y = -29463.3,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "毒杂草",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "有毒杂草",
        ["兼容单位ID"] = "nsko",
        X = -19447.6,
        Y = -30082.7,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "毒杂草",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "有毒杂草",
        ["兼容单位ID"] = "nsko",
        X = -20083.1,
        Y = -29385.6,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "毒杂草",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "有毒杂草",
        ["兼容单位ID"] = "nsko",
        X = -20913.6,
        Y = -29584.5,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "毒杂草",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "有毒杂草",
        ["兼容单位ID"] = "nsko",
        X = -21383.3,
        Y = -30044.9,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "毒杂草",
        ["敌人归类"] = "杂鱼",
        ["单位名"] = "有毒杂草",
        ["兼容单位ID"] = "nsko",
        X = -21438.5,
        Y = -29255.2,
        ["朝向"] = "随机"
    }
}
____exports["世界地图杂鱼默认缓步创建选项"] = {["每批创建数量"] = 5, ["批次间隔秒"] = 0.05}
____exports["启动世界地图杂鱼缓步创建"] = function(_____9009_9879)
    _____542F_52A8_4E16_754C_5730_56FE_5355_4F4D_7F13_6B65_521B_5EFA(
        ____exports["世界地图杂鱼出生配置表"],
        __TS__ObjectAssign({}, ____exports["世界地图杂鱼默认缓步创建选项"], _____9009_9879)
    )
end
____exports.default = ____exports["世界地图杂鱼出生配置表"]
return ____exports
