local ____lualib = require("lualib_bundle")
local __TS__ObjectAssign = ____lualib.__TS__ObjectAssign
local ____exports = {}
local ____20_FF0E_4E16_754C_5730_56FE_5355_4F4D_7F13_6B65_521B_5EFA = require("系统.01．单位系统.00．单位初始化创建.02．世界地图单位初始化.20．世界地图单位缓步创建")
local _____542F_52A8_4E16_754C_5730_56FE_5355_4F4D_7F13_6B65_521B_5EFA = ____20_FF0E_4E16_754C_5730_56FE_5355_4F4D_7F13_6B65_521B_5EFA["启动世界地图单位缓步创建"]
____exports["世界地图精英出生配置表"] = {
    {
        ["分组名"] = "精英",
        ["敌人归类"] = "精英",
        ["单位名"] = "ngnw",
        ["兼容单位ID"] = "ngnw",
        X = -29075.9,
        Y = -25613.1,
        ["朝向"] = 90
    },
    {
        ["分组名"] = "精英",
        ["敌人归类"] = "精英",
        ["单位名"] = "ngnv",
        ["兼容单位ID"] = "ngnv",
        X = -27193.5,
        Y = -20209.2,
        ["朝向"] = "随机"
    },
    {
        ["分组名"] = "精英",
        ["敌人归类"] = "精英",
        ["单位名"] = "巨型史莱姆",
        ["兼容单位ID"] = "n01E",
        X = -24497.1,
        Y = -21449.5,
        ["朝向"] = 270
    },
    {
        ["分组名"] = "精英",
        ["敌人归类"] = "精英",
        ["单位名"] = "nsc3",
        ["兼容单位ID"] = "nsc3",
        X = -21402.1,
        Y = -19699,
        ["朝向"] = 270
    },
    {
        ["分组名"] = "精英",
        ["敌人归类"] = "精英",
        ["单位名"] = "nggr",
        ["兼容单位ID"] = "nggr",
        X = -15625.5,
        Y = -28072.9,
        ["朝向"] = 140
    },
    {
        ["分组名"] = "精英",
        ["敌人归类"] = "精英",
        ["单位名"] = "沙漠蝎王",
        ["兼容单位ID"] = "nano",
        X = -12599.5,
        Y = -21307.2,
        ["朝向"] = 280
    },
    {
        ["分组名"] = "精英",
        ["敌人归类"] = "精英",
        ["单位名"] = "nhrq",
        ["兼容单位ID"] = "nhrq",
        X = -298.3,
        Y = -28102.1,
        ["朝向"] = 93.1
    },
    {
        ["分组名"] = "精英",
        ["敌人归类"] = "精英",
        ["单位名"] = "地精剑客",
        ["兼容单位ID"] = "N00B",
        X = -25751.5,
        Y = -15692.1,
        ["朝向"] = 170.27
    },
    {
        ["分组名"] = "精英",
        ["敌人归类"] = "精英",
        ["单位名"] = "森林狼王",
        ["兼容单位ID"] = "nwld",
        X = -29030.1,
        Y = -11275.4,
        ["朝向"] = 45
    },
    {
        ["分组名"] = "精英",
        ["敌人归类"] = "精英",
        ["单位名"] = "nsbm",
        ["兼容单位ID"] = "nsbm",
        X = -13596.1,
        Y = -28874.5,
        ["朝向"] = 45
    },
    {
        ["分组名"] = "精英",
        ["敌人归类"] = "精英",
        ["单位名"] = "狼人魔法师",
        ["兼容单位ID"] = "n005",
        X = 4001.5,
        Y = -22158.5,
        ["朝向"] = 45
    },
    {
        ["分组名"] = "精英",
        ["敌人归类"] = "精英",
        ["单位名"] = "狼人首领",
        ["兼容单位ID"] = "n01V",
        X = 4619.1,
        Y = -24238.1,
        ["朝向"] = 181
    },
    {
        ["分组名"] = "精英",
        ["敌人归类"] = "精英",
        ["单位名"] = "火焰九头蛇",
        ["兼容单位ID"] = "n026",
        X = 12304.2,
        Y = -28267.7,
        ["朝向"] = 180
    },
    {
        ["分组名"] = "精英",
        ["敌人归类"] = "精英",
        ["单位名"] = "nsll",
        ["兼容单位ID"] = "nsll",
        X = 10081.5,
        Y = -24773.3,
        ["朝向"] = 180
    },
    {
        ["分组名"] = "精英",
        ["敌人归类"] = "精英",
        ["单位名"] = "黑暗魔法女王",
        ["兼容单位ID"] = "n00K",
        X = 17530.3,
        Y = -18216.8,
        ["朝向"] = 18.58
    },
    {
        ["分组名"] = "精英",
        ["敌人归类"] = "精英",
        ["单位名"] = "苦难女王",
        ["兼容单位ID"] = "n03E",
        X = 18415.7,
        Y = -18833.2,
        ["朝向"] = 45
    },
    {
        ["分组名"] = "精英",
        ["敌人归类"] = "精英",
        ["单位名"] = "地狱犬（精英)",
        ["兼容单位ID"] = "n038",
        X = 20367.2,
        Y = -19768.6,
        ["朝向"] = 0
    },
    {
        ["分组名"] = "精英",
        ["敌人归类"] = "精英",
        ["单位名"] = "恶魔邪恶巫师（精英）",
        ["兼容单位ID"] = "n03J",
        X = 21981.5,
        Y = -18426.7,
        ["朝向"] = 115
    },
    {
        ["分组名"] = "精英",
        ["敌人归类"] = "精英",
        ["单位名"] = "熔岩元素（精英）",
        ["兼容单位ID"] = "n03T",
        X = 15126.1,
        Y = -9394.1,
        ["朝向"] = 45
    },
    {
        ["分组名"] = "精英",
        ["敌人归类"] = "精英",
        ["单位名"] = "超级地狱火",
        ["兼容单位ID"] = "n00W",
        X = 20367.2,
        Y = -4159.4,
        ["朝向"] = 45
    },
    {
        ["分组名"] = "精英",
        ["敌人归类"] = "精英",
        ["单位名"] = "恶魔使者",
        ["兼容单位ID"] = "N03A",
        X = 23248.6,
        Y = -3649.1,
        ["朝向"] = 150
    },
    {
        ["分组名"] = "精英",
        ["敌人归类"] = "精英",
        ["单位名"] = "nerw",
        ["兼容单位ID"] = "nerw",
        X = 22537.4,
        Y = -4949.3,
        ["朝向"] = 45.29
    },
    {
        ["分组名"] = "精英",
        ["敌人归类"] = "精英",
        ["单位名"] = "无敌黑暗猎人（精英）",
        ["兼容单位ID"] = "nubk",
        X = 29251.3,
        Y = -8505.7,
        ["朝向"] = 270
    },
    {
        ["分组名"] = "精英",
        ["敌人归类"] = "精英",
        ["单位名"] = "恶魔大统领",
        ["兼容单位ID"] = "N039",
        X = 26770.7,
        Y = -10976.7,
        ["朝向"] = 180
    },
    {
        ["分组名"] = "精英",
        ["敌人归类"] = "精英",
        ["单位名"] = "双翼究极恶魔（精英）",
        ["兼容单位ID"] = "u004",
        X = 28815.6,
        Y = -12855.9,
        ["朝向"] = 190.79
    },
    {
        ["分组名"] = "精英",
        ["敌人归类"] = "精英",
        ["单位名"] = "蒙面人队长",
        ["兼容单位ID"] = "n01R",
        X = 27585.3,
        Y = -25028.2,
        ["朝向"] = 95
    },
    {
        ["分组名"] = "精英",
        ["敌人归类"] = "精英",
        ["单位名"] = "亡灵高级巫师（精英）",
        ["兼容单位ID"] = "n044",
        X = 6151.9,
        Y = -15339.4,
        ["朝向"] = 270
    },
    {
        ["分组名"] = "精英",
        ["敌人归类"] = "精英",
        ["单位名"] = "狂啸熊王",
        ["兼容单位ID"] = "n04H",
        X = -17286.4,
        Y = -17946.7,
        ["朝向"] = 90
    },
    {
        ["分组名"] = "精英",
        ["敌人归类"] = "精英",
        ["单位名"] = "远古食人花",
        ["兼容单位ID"] = "n04L",
        X = -6752.2,
        Y = -17525.6,
        ["朝向"] = 180
    }
}
____exports["世界地图精英默认缓步创建选项"] = {["每批创建数量"] = 3, ["批次间隔秒"] = 0.2}
____exports["启动世界地图精英缓步创建"] = function(_____9009_9879)
    _____542F_52A8_4E16_754C_5730_56FE_5355_4F4D_7F13_6B65_521B_5EFA(
        ____exports["世界地图精英出生配置表"],
        __TS__ObjectAssign({}, ____exports["世界地图精英默认缓步创建选项"], _____9009_9879)
    )
end
____exports.default = ____exports["世界地图精英出生配置表"]
return ____exports
