local ____lualib = require("lualib_bundle")
local __TS__ObjectAssign = ____lualib.__TS__ObjectAssign
local ____exports = {}
local ____20_FF0E_4E16_754C_5730_56FE_5355_4F4D_7F13_6B65_521B_5EFA = require("系统.01．单位系统.00．单位初始化创建.02．世界地图单位初始化.20．世界地图单位缓步创建")
local _____542F_52A8_4E16_754C_5730_56FE_5355_4F4D_7F13_6B65_521B_5EFA = ____20_FF0E_4E16_754C_5730_56FE_5355_4F4D_7F13_6B65_521B_5EFA["启动世界地图单位缓步创建"]
____exports["世界地图商人出生配置表"] = {
    {
        ["配置名"] = "NPC商人001",
        ["分组名"] = "商人",
        ["敌人归类"] = "NPC",
        ["单位名"] = "巨魔商人",
        ["兼容单位ID"] = "o004",
        X = -26887.9,
        Y = -7344.1,
        ["朝向"] = 270,
        ["玩家ID"] = 15
    },
    {
        ["分组名"] = "商人",
        ["敌人归类"] = "NPC",
        ["单位名"] = "精灵锻造师",
        ["兼容单位ID"] = "n02M",
        X = -23778.5,
        Y = -29767.4,
        ["朝向"] = 140,
        ["玩家ID"] = 15
    },
    {
        ["分组名"] = "商人",
        ["敌人归类"] = "NPC",
        ["单位名"] = "精灵族仓库长老",
        ["兼容单位ID"] = "e01W",
        X = -22329,
        Y = -28525.6,
        ["朝向"] = 179,
        ["玩家ID"] = 15
    },
    {
        ["分组名"] = "商人",
        ["敌人归类"] = "NPC",
        ["单位名"] = "远足贩卖者",
        ["兼容单位ID"] = "h00B",
        X = -22830.6,
        Y = -28058.6,
        ["朝向"] = 270,
        ["玩家ID"] = 15
    },
    {
        ["分组名"] = "商人",
        ["敌人归类"] = "NPC",
        ["单位名"] = "精灵贩卖者",
        ["兼容单位ID"] = "nbee",
        X = -26269.5,
        Y = -27286.9,
        ["朝向"] = 270,
        ["玩家ID"] = 15
    },
    {
        ["分组名"] = "商人",
        ["敌人归类"] = "NPC",
        ["单位名"] = "n01Q",
        ["兼容单位ID"] = "n01Q",
        X = -18294.5,
        Y = -26190.4,
        ["朝向"] = 0,
        ["玩家ID"] = 15
    },
    {
        ["分组名"] = "商人",
        ["敌人归类"] = "NPC",
        ["单位名"] = "n01O",
        ["兼容单位ID"] = "n01O",
        X = -18292.4,
        Y = -25833.5,
        ["朝向"] = 0,
        ["玩家ID"] = 15
    },
    {
        ["分组名"] = "商人",
        ["敌人归类"] = "NPC",
        ["单位名"] = "矮人兄弟",
        ["兼容单位ID"] = "h007",
        X = -4869.1,
        Y = -22675.9,
        ["朝向"] = 216.5,
        ["玩家ID"] = 15
    },
    {
        ["分组名"] = "商人",
        ["敌人归类"] = "NPC",
        ["单位名"] = "n01M",
        ["兼容单位ID"] = "n01M",
        X = -18301.1,
        Y = -25233.8,
        ["朝向"] = 0,
        ["玩家ID"] = 15
    },
    {
        ["分组名"] = "商人",
        ["敌人归类"] = "NPC",
        ["单位名"] = "矮人火枪手-泽西",
        ["兼容单位ID"] = "h006",
        X = -5554.8,
        Y = -22361.8,
        ["朝向"] = 270,
        ["玩家ID"] = 15
    },
    {
        ["分组名"] = "商人",
        ["敌人归类"] = "NPC",
        ["单位名"] = "沙漠风味水果店",
        ["兼容单位ID"] = "n02H",
        X = -6130.6,
        Y = -23853.4,
        ["朝向"] = 0,
        ["玩家ID"] = 15
    },
    {
        ["分组名"] = "商人",
        ["敌人归类"] = "NPC",
        ["单位名"] = "人类渔夫",
        ["兼容单位ID"] = "n01K",
        X = -6223.6,
        Y = -24524,
        ["朝向"] = 270,
        ["玩家ID"] = 15
    },
    {
        ["分组名"] = "商人",
        ["敌人归类"] = "NPC",
        ["单位名"] = "人类渔夫",
        ["兼容单位ID"] = "n01K",
        X = -19224.1,
        Y = -22030.4,
        ["朝向"] = 0,
        ["玩家ID"] = 15
    },
    {
        ["分组名"] = "商人",
        ["敌人归类"] = "NPC",
        ["单位名"] = "熔岩药剂师",
        ["兼容单位ID"] = "u008",
        X = 13166.4,
        Y = -19756.7,
        ["朝向"] = 130,
        ["玩家ID"] = 15
    },
    {
        ["分组名"] = "商人",
        ["敌人归类"] = "NPC",
        ["单位名"] = "亡灵锻造师",
        ["兼容单位ID"] = "u005",
        X = 13754.3,
        Y = -18922.4,
        ["朝向"] = 235,
        ["玩家ID"] = 15
    },
    {
        ["分组名"] = "商人",
        ["敌人归类"] = "NPC",
        ["单位名"] = "沙漠道具商人",
        ["兼容单位ID"] = "n02J",
        X = -3781.3,
        Y = -24199.2,
        ["朝向"] = 22,
        ["玩家ID"] = 15
    },
    {
        ["分组名"] = "商人",
        ["敌人归类"] = "NPC",
        ["单位名"] = "深渊之影",
        ["兼容单位ID"] = "u007",
        X = 7239.6,
        Y = -19909.9,
        ["朝向"] = 270,
        ["玩家ID"] = 15
    },
    {
        ["分组名"] = "商人",
        ["敌人归类"] = "NPC",
        ["单位名"] = "商人",
        ["兼容单位ID"] = "n028",
        X = 7903.9,
        Y = -22779.7,
        ["朝向"] = 270,
        ["玩家ID"] = 15
    },
    {
        ["分组名"] = "商人",
        ["敌人归类"] = "NPC",
        ["单位名"] = "精灵药水商人",
        ["兼容单位ID"] = "nEPM",
        X = -20179.7,
        Y = -14814.1,
        ["朝向"] = 270,
        ["玩家ID"] = 15
    },
    {
        ["分组名"] = "商人",
        ["敌人归类"] = "NPC",
        ["单位名"] = "游戏机制介绍-尼古劳",
        ["兼容单位ID"] = "n031",
        X = -2777.5,
        Y = 29411.6,
        ["朝向"] = 0,
        ["玩家ID"] = 15
    },
    {
        ["分组名"] = "商人",
        ["敌人归类"] = "NPC",
        ["单位名"] = "伊达灵果",
        ["兼容单位ID"] = "n04I",
        X = -17547.6,
        Y = -19405.6,
        ["朝向"] = 0,
        ["玩家ID"] = 15
    },
    {
        ["分组名"] = "商人",
        ["敌人归类"] = "NPC",
        ["单位名"] = "灵树看守者",
        ["兼容单位ID"] = "e08C",
        X = -26092.1,
        Y = -28877.2,
        ["朝向"] = 144,
        ["玩家ID"] = 15
    },
    {
        ["分组名"] = "商人",
        ["敌人归类"] = "NPC",
        ["单位名"] = "恶魔剑客-亚伯",
        ["兼容单位ID"] = "n03P",
        X = 16361.8,
        Y = -14959.2,
        ["朝向"] = 180,
        ["玩家ID"] = 15
    },
    {
        ["分组名"] = "商人",
        ["敌人归类"] = "NPC",
        ["单位名"] = "蛇族贩卖者-丹尼斯丁",
        ["兼容单位ID"] = "h01G",
        X = -26536.5,
        Y = 2427.6,
        ["朝向"] = 270,
        ["玩家ID"] = 15
    },
    {
        ["分组名"] = "商人",
        ["敌人归类"] = "NPC",
        ["单位名"] = "下级异端审查官-卢修斯",
        ["兼容单位ID"] = "h010",
        ["任务NPC任务ID"] = 10015,
        X = -22800.6,
        Y = -29084.3,
        ["朝向"] = 90,
        ["玩家ID"] = 15
    }
}
____exports["世界地图商人默认缓步创建选项"] = {["每批创建数量"] = 4, ["批次间隔秒"] = 0.08}
____exports["启动世界地图商人缓步创建"] = function(_____9009_9879)
    _____542F_52A8_4E16_754C_5730_56FE_5355_4F4D_7F13_6B65_521B_5EFA(
        ____exports["世界地图商人出生配置表"],
        __TS__ObjectAssign({}, ____exports["世界地图商人默认缓步创建选项"], _____9009_9879)
    )
end
____exports.default = ____exports["世界地图商人出生配置表"]
return ____exports
