--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
____exports["世界地图异界描述石配置表"] = {{
    ["配置名"] = "遗迹之石其一",
    ["单位名"] = "异界描述石",
    ["上架物品名"] = "阅读描述的内容（其一）LV25",
    X = -16825.7,
    Y = -24443.6,
    ["朝向"] = "随机",
    ["玩家ID"] = 15,
    ["当前库存"] = 1,
    ["最大库存"] = 1
}, {
    ["配置名"] = "遗迹之石其二",
    ["单位名"] = "异界描述石",
    ["上架物品名"] = "阅读描述的内容（其二）LV35",
    X = 3821,
    Y = -27432.8,
    ["朝向"] = "随机",
    ["玩家ID"] = 15,
    ["当前库存"] = 1,
    ["最大库存"] = 1
}, {
    ["配置名"] = "遗迹之石其三",
    ["单位名"] = "异界描述石",
    ["上架物品名"] = "阅读描述的内容（其三）LV45",
    X = 20460.1,
    Y = -14333.7,
    ["朝向"] = "随机",
    ["玩家ID"] = 15,
    ["当前库存"] = 1,
    ["最大库存"] = 1
}, {
    ["配置名"] = "遗迹之石其四",
    ["单位名"] = "异界描述石",
    ["上架物品名"] = "阅读描述的内容（其四）LV55",
    X = 28155.1,
    Y = -18123.7,
    ["朝向"] = "随机",
    ["玩家ID"] = 15,
    ["当前库存"] = 1,
    ["最大库存"] = 1
}}
____exports.default = ____exports["世界地图异界描述石配置表"]
return ____exports
