--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
____exports["世界地图Boss初始注册延迟秒"] = 10
____exports["世界地图Boss初始注册配置表"] = {
    {
        ["分组名"] = "Boss初始注册",
        ["敌人归类"] = "Boss",
        ["单位名"] = "|cffffcc99沙漠蜥蜴（变异）|r|cffff0000BossLV29|r",
        ["记录到Boss表键名"] = "变异蜥蜴",
        X = -8976.2,
        Y = -24574.2,
        ["朝向"] = 90,
        ["玩家ID"] = 15
    },
    {
        ["分组名"] = "Boss初始注册",
        ["敌人归类"] = "Boss",
        ["单位名"] = "蛇之领主-奢恩|cffff0000（BossLV30）|r",
        ["记录到Boss表键名"] = "蛇之领主",
        X = -1961.1,
        Y = -21786.9,
        ["朝向"] = 270,
        ["玩家ID"] = 15
    },
    {
        ["分组名"] = "Boss初始注册",
        ["敌人归类"] = "Boss",
        ["单位名"] = "|cffffcc99蛇之遗迹看守者-奢隆|r|cffff0000（BossLV37）|r",
        ["记录到Boss表键名"] = "蛇之遗迹看守者",
        X = 1003.2,
        Y = -22432.4,
        ["朝向"] = 220,
        ["玩家ID"] = 15
    },
    {
        ["分组名"] = "Boss初始注册",
        ["敌人归类"] = "Boss",
        ["单位名"] = "水龙蛇|cffff0000（BossLV33）|r",
        ["记录到Boss表键名"] = "水龙蛇",
        X = 21068.2,
        Y = -27125.8,
        ["朝向"] = 273.75,
        ["玩家ID"] = 15
    },
    {
        ["分组名"] = "Boss初始注册",
        ["敌人归类"] = "Boss",
        ["单位名"] = "沙丘母虫|cffff0000（BossLV25）|r",
        ["记录到Boss表键名"] = "沙丘母虫",
        ["初始隐藏"] = true,
        X = -4255.9,
        Y = -28248.3,
        ["朝向"] = 116.67,
        ["玩家ID"] = 15
    },
    {
        ["分组名"] = "Boss初始注册",
        ["敌人归类"] = "Boss",
        ["单位名"] = "死灵盗贼",
        ["记录到Boss表键名"] = "死灵盗贼",
        X = 28964.7,
        Y = -22667.1,
        ["朝向"] = 92.53,
        ["玩家ID"] = 15
    },
    {
        ["分组名"] = "Boss初始注册",
        ["敌人归类"] = "Boss",
        ["单位名"] = "古木之蚀·莫尔特斯",
        ["记录到Boss表键名"] = "古木之蚀",
        X = 5368.2,
        Y = -13059.7,
        ["朝向"] = 270,
        ["玩家ID"] = 15
    },
    {
        ["分组名"] = "Boss初始注册",
        ["敌人归类"] = "Boss",
        ["单位名"] = "恶魔领袖|cffff0000（Boss）LV45|r",
        ["记录到Boss表键名"] = "恶魔领袖",
        X = 28099.8,
        Y = -17579.5,
        ["朝向"] = 180,
        ["玩家ID"] = 15
    },
    {
        ["分组名"] = "Boss初始注册",
        ["敌人归类"] = "Boss",
        ["单位名"] = "恶魔看守者|cffff0000（Boss，无等级限制）|r",
        ["记录到Boss表键名"] = "恶魔看守者",
        X = 27863.7,
        Y = -7264.5,
        ["朝向"] = 166,
        ["玩家ID"] = 15
    },
    {
        ["分组名"] = "Boss初始注册",
        ["敌人归类"] = "Boss",
        ["单位名"] = "熔岩恶魔王",
        ["记录到Boss表键名"] = "熔岩恶魔王",
        X = 28640,
        Y = -3734.5,
        ["朝向"] = 270,
        ["玩家ID"] = 15
    },
    {
        ["分组名"] = "Boss初始注册",
        ["敌人归类"] = "Boss",
        ["单位名"] = "黑暗恶魔军官|cffff0000（Boss）LV37|r",
        ["记录到Boss表键名"] = "黑暗恶魔军官",
        X = 20783.4,
        Y = -18431.6,
        ["朝向"] = 150,
        ["玩家ID"] = 15
    },
    {
        ["分组名"] = "Boss初始注册",
        ["敌人归类"] = "Boss",
        ["单位名"] = "死亡骑士",
        ["记录到Boss表键名"] = "死亡骑士",
        X = 8322.9,
        Y = -14452.7,
        ["朝向"] = 270,
        ["玩家ID"] = 15
    },
    {
        ["分组名"] = "Boss初始注册",
        ["敌人归类"] = "精英",
        ["单位名"] = "暗影之灵(Boss)",
        ["记录到Boss表键名"] = "暗影之灵",
        ["初始隐藏"] = true,
        X = 8064,
        Y = -27911.1,
        ["朝向"] = 270,
        ["玩家ID"] = 12
    },
    {
        ["分组名"] = "Boss初始注册",
        ["敌人归类"] = "精英",
        ["单位名"] = "泽图（挑战boss）",
        ["记录到Boss表键名"] = "泽图",
        ["初始隐藏"] = true,
        X = 8475.6,
        Y = -26532.6,
        ["朝向"] = 233,
        ["玩家ID"] = 12
    },
    {
        ["分组名"] = "Boss初始注册",
        ["敌人归类"] = "Boss",
        ["单位名"] = "幽冥巫师",
        ["记录到Boss表键名"] = "幽冥巫师",
        X = 5183.2,
        Y = -15078.8,
        ["朝向"] = 270,
        ["玩家ID"] = 15
    }
}
____exports["世界地图Boss初始额外单位配置表"] = {{
    ["分组名"] = "Boss初始注册",
    ["敌人归类"] = "Boss",
    ["单位名"] = "熔岩恶魔",
    X = 19616.6,
    Y = -6856.6,
    ["朝向"] = 270,
    ["玩家ID"] = 12
}, {
    ["分组名"] = "Boss初始注册",
    ["敌人归类"] = "精英",
    ["单位名"] = "熔岩恶魔护卫",
    X = 27948.7,
    Y = -4152.8,
    ["朝向"] = 270,
    ["玩家ID"] = 15
}, {
    ["分组名"] = "Boss初始注册",
    ["敌人归类"] = "精英",
    ["单位名"] = "熔岩恶魔护卫",
    X = 29372.8,
    Y = -4218.6,
    ["朝向"] = 270,
    ["玩家ID"] = 15
}, {
    ["分组名"] = "Boss初始注册",
    ["敌人归类"] = "精英",
    ["单位名"] = "沙漠幽灵|cffff0000（Boss）LV25|r",
    ["初始隐藏"] = true,
    X = -1579.7,
    Y = -28338.2,
    ["朝向"] = 180,
    ["玩家ID"] = 12
}}
____exports.default = ____exports["世界地图Boss初始注册配置表"]
return ____exports
