local ____lualib = require("lualib_bundle")
local __TS__Delete = ____lualib.__TS__Delete
local ____exports = {}
____exports["王宫禁卫缓存键表"] = {"主线NPC.王宫禁卫1", "主线NPC.王宫禁卫2", "主线NPC.王宫禁卫3", "主线NPC.王宫禁卫4"}
local _____4E16_754C_5730_56FE_5F85_7F13_5B58_5355_4F4D_914D_7F6E_8868 = {{
    ["缓存键"] = ____exports["王宫禁卫缓存键表"][1],
    ["分组名"] = "NPC",
    ["单位名"] = "精灵禁军",
    X = 15583.5,
    Y = -24893.1
}, {
    ["缓存键"] = ____exports["王宫禁卫缓存键表"][2],
    ["分组名"] = "NPC",
    ["单位名"] = "精灵禁军",
    X = 15603.4,
    Y = -25352.6
}, {
    ["缓存键"] = ____exports["王宫禁卫缓存键表"][3],
    ["分组名"] = "NPC",
    ["单位名"] = "精灵禁军",
    X = 16218.4,
    Y = -25892.7
}, {
    ["缓存键"] = ____exports["王宫禁卫缓存键表"][4],
    ["分组名"] = "NPC",
    ["单位名"] = "精灵禁军",
    X = 16233.6,
    Y = -25373.4
}}
local _____4E16_754C_5730_56FE_5355_4F4D_7F13_5B58_8868 = {}
local function _____662F_5426_5339_914D_5F85_7F13_5B58_914D_7F6E(_____51FA_751F_914D_7F6E, _____7F13_5B58_914D_7F6E)
    return _____51FA_751F_914D_7F6E["分组名"] == _____7F13_5B58_914D_7F6E["分组名"] and _____51FA_751F_914D_7F6E["单位名"] == _____7F13_5B58_914D_7F6E["单位名"] and _____51FA_751F_914D_7F6E.X == _____7F13_5B58_914D_7F6E.X and _____51FA_751F_914D_7F6E.Y == _____7F13_5B58_914D_7F6E.Y
end
____exports["尝试缓存世界地图单位"] = function(_____51FA_751F_914D_7F6E, unit)
    if unit == nil or unit == 0 then
        return
    end
    do
        local i = 0
        while i < #_____4E16_754C_5730_56FE_5F85_7F13_5B58_5355_4F4D_914D_7F6E_8868 do
            do
                local _____7F13_5B58_914D_7F6E = _____4E16_754C_5730_56FE_5F85_7F13_5B58_5355_4F4D_914D_7F6E_8868[i + 1]
                if not _____662F_5426_5339_914D_5F85_7F13_5B58_914D_7F6E(_____51FA_751F_914D_7F6E, _____7F13_5B58_914D_7F6E) then
                    goto __continue6
                end
                _____4E16_754C_5730_56FE_5355_4F4D_7F13_5B58_8868[_____7F13_5B58_914D_7F6E["缓存键"]] = unit
                return
            end
            ::__continue6::
            i = i + 1
        end
    end
end
____exports["消费世界地图单位缓存"] = function(_____7F13_5B58_952E)
    if _____7F13_5B58_952E == "" then
        return nil
    end
    local ____4E16_754C_5730_56FE_5355_4F4D_7F13_5B58_8868______7F13_5B58_952E_0 = _____4E16_754C_5730_56FE_5355_4F4D_7F13_5B58_8868[_____7F13_5B58_952E]
    if ____4E16_754C_5730_56FE_5355_4F4D_7F13_5B58_8868______7F13_5B58_952E_0 == nil then
        ____4E16_754C_5730_56FE_5355_4F4D_7F13_5B58_8868______7F13_5B58_952E_0 = nil
    end
    local unit = ____4E16_754C_5730_56FE_5355_4F4D_7F13_5B58_8868______7F13_5B58_952E_0
    _____4E16_754C_5730_56FE_5355_4F4D_7F13_5B58_8868[_____7F13_5B58_952E] = nil
    __TS__Delete(_____4E16_754C_5730_56FE_5355_4F4D_7F13_5B58_8868, _____7F13_5B58_952E)
    return unit
end
return ____exports
