--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____01_FF0E_5267_60C5_52A8_4F5C_4E0A_4E0B_6587 = require("系统.11．剧情系统.01．主线任务.00．剧情系统核心工具.01．剧情动作上下文")
local _____8BFB_53D6_5F53_524D_5267_60C5_52A8_4F5C_4E0A_4E0B_6587 = ____01_FF0E_5267_60C5_52A8_4F5C_4E0A_4E0B_6587["读取当前剧情动作上下文"]
local ____06_FF0E_5267_60C5_901A_7528_6267_884C_5DE5_5177 = require("系统.11．剧情系统.01．主线任务.00．剧情系统核心工具.06．剧情通用执行工具")
local _____8BFB_53D6_8BED_4E49_5355_4F4D_5F15_7528 = ____06_FF0E_5267_60C5_901A_7528_6267_884C_5DE5_5177["读取语义单位引用"]
local _____8BBE_7F6E_89E6_53D1_5355_4F4D_63A7_5236_72B6_6001 = ____06_FF0E_5267_60C5_901A_7528_6267_884C_5DE5_5177["设置触发单位控制状态"]
local _____505C_6B62_89E6_53D1_5355_4F4D = ____06_FF0E_5267_60C5_901A_7528_6267_884C_5DE5_5177["停止触发单位"]
local ____26_FF0E_6811_9B54_9996_9886_6218_524D = require("系统.11．剧情系统.01．主线任务.02．剧情步骤.02．第二章.26．树魔首领战前")
local _____6811_9B54_9996_9886_6218_6597_4E2D_5BF9_767D_5217_8868 = ____26_FF0E_6811_9B54_9996_9886_6218_524D["树魔首领战斗中对白列表"]
do
    local ____26_FF0E_6811_9B54_9996_9886_6218_524D = require("系统.11．剧情系统.01．主线任务.02．剧情步骤.02．第二章.26．树魔首领战前")
    ____exports["树魔首领战前剧情片段"] = ____26_FF0E_6811_9B54_9996_9886_6218_524D["树魔首领战前剧情片段"]
end
local ____require_result_0 = require("系统.00．核心系统.05．中心计时器")
local addDelayedCallback = ____require_result_0.addDelayedCallback
local ____require_result_1 = require("系统.09．表现系统.06．广播提示消息.index")
local _____5E7F_64AD_5355_4F4D_63D0_793A = ____require_result_1["广播单位提示"]
local ____require_result_2 = require("lib.扩展函数.Star扩展函数.Star扩展库.08．单位判定与筛选函数")
local SUC_IsUnitAlive = ____require_result_2.SUC_IsUnitAlive
local _____6811_9B54_9996_9886_6218_6597_5BF9_767D_4E16_4EE3 = 0
local _____5F53_524D_6811_9B54_9996_9886_6218_6597_5BF9_767D_72B6_6001
local function ____on_64AD_653E_4E0B_4E00_53E5_6811_9B54_9996_9886_6218_6597_5BF9_767D(_____9884_671F_4E16_4EE3)
    local _____72B6_6001 = _____5F53_524D_6811_9B54_9996_9886_6218_6597_5BF9_767D_72B6_6001
    if _____72B6_6001 == nil or _____72B6_6001["世代"] ~= _____9884_671F_4E16_4EE3 then
        return
    end
    if not SUC_IsUnitAlive(_____72B6_6001["Boss单位"]) then
        _____5F53_524D_6811_9B54_9996_9886_6218_6597_5BF9_767D_72B6_6001 = nil
        return
    end
    local _____5BF9_767D = _____6811_9B54_9996_9886_6218_6597_4E2D_5BF9_767D_5217_8868[_____72B6_6001["下一句索引"] + 1]
    if _____5BF9_767D == nil then
        _____5F53_524D_6811_9B54_9996_9886_6218_6597_5BF9_767D_72B6_6001 = nil
        return
    end
    local ____temp_3
    if _____5BF9_767D["说话者"] == "树魔首领" then
        ____temp_3 = _____72B6_6001["Boss单位"]
    else
        ____temp_3 = _____72B6_6001["玩家单位"]
    end
    local _____6765_6E90_5355_4F4D = ____temp_3
    if _____6765_6E90_5355_4F4D ~= nil and _____6765_6E90_5355_4F4D ~= 0 then
        _____5E7F_64AD_5355_4F4D_63D0_793A(_____6765_6E90_5355_4F4D, _____5BF9_767D["文本"], _____5BF9_767D["持续时间"] * 1000)
    end
    _____72B6_6001["下一句索引"] = _____72B6_6001["下一句索引"] + 1
    if _____72B6_6001["下一句索引"] >= #_____6811_9B54_9996_9886_6218_6597_4E2D_5BF9_767D_5217_8868 then
        _____5F53_524D_6811_9B54_9996_9886_6218_6597_5BF9_767D_72B6_6001 = nil
        return
    end
    addDelayedCallback(_____5BF9_767D["持续时间"] * 1000, ____on_64AD_653E_4E0B_4E00_53E5_6811_9B54_9996_9886_6218_6597_5BF9_767D, _____72B6_6001["世代"])
end
____exports["执行树魔首领战前"] = function()
    _____505C_6B62_89E6_53D1_5355_4F4D()
    _____8BBE_7F6E_89E6_53D1_5355_4F4D_63A7_5236_72B6_6001(true, false)
end
____exports["启动树魔首领战斗对白"] = function()
    local ____Boss_5355_4F4D = _____8BFB_53D6_8BED_4E49_5355_4F4D_5F15_7528("Boss.树魔首领")
    if not SUC_IsUnitAlive(____Boss_5355_4F4D) then
        return
    end
    _____6811_9B54_9996_9886_6218_6597_5BF9_767D_4E16_4EE3 = _____6811_9B54_9996_9886_6218_6597_5BF9_767D_4E16_4EE3 + 1
    _____5F53_524D_6811_9B54_9996_9886_6218_6597_5BF9_767D_72B6_6001 = {
        ["世代"] = _____6811_9B54_9996_9886_6218_6597_5BF9_767D_4E16_4EE3,
        ["Boss单位"] = ____Boss_5355_4F4D,
        ["玩家单位"] = _____8BFB_53D6_5F53_524D_5267_60C5_52A8_4F5C_4E0A_4E0B_6587()["触发单位"],
        ["下一句索引"] = 0
    }
    addDelayedCallback(3400, ____on_64AD_653E_4E0B_4E00_53E5_6811_9B54_9996_9886_6218_6597_5BF9_767D, _____6811_9B54_9996_9886_6218_6597_5BF9_767D_4E16_4EE3)
end
____exports["树魔首领战前剧情动作注册表"] = {["JLC精灵城_树魔首领战前"] = ____exports["执行树魔首领战前"], ["JLC精灵城_启动树魔首领战斗对白"] = ____exports["启动树魔首领战斗对白"]}
return ____exports
