--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____06_FF0E_5267_60C5_901A_7528_6267_884C_5DE5_5177 = require("系统.11．剧情系统.01．主线任务.00．剧情系统核心工具.06．剧情通用执行工具")
local _____8BBE_7F6E_89E6_53D1_5355_4F4D_63A7_5236_72B6_6001 = ____06_FF0E_5267_60C5_901A_7528_6267_884C_5DE5_5177["设置触发单位控制状态"]
local _____505C_6B62_89E6_53D1_5355_4F4D = ____06_FF0E_5267_60C5_901A_7528_6267_884C_5DE5_5177["停止触发单位"]
do
    local ____26_FF0E_5DE8_9B54_9996_9886_6218_524D = require("系统.11．剧情系统.01．主线任务.02．剧情步骤.02．第二章.26．巨魔首领战前")
    ____exports["巨魔首领战前剧情片段"] = ____26_FF0E_5DE8_9B54_9996_9886_6218_524D["巨魔首领战前剧情片段"]
end
____exports["执行巨魔首领战前"] = function()
    _____505C_6B62_89E6_53D1_5355_4F4D()
    _____8BBE_7F6E_89E6_53D1_5355_4F4D_63A7_5236_72B6_6001(true, false)
end
____exports["执行巨魔首领开战承接"] = function()
    _____8BBE_7F6E_89E6_53D1_5355_4F4D_63A7_5236_72B6_6001(false, false)
end
____exports["巨魔首领战前剧情动作注册表"] = {["JLC精灵城_巨魔首领战前"] = ____exports["执行巨魔首领战前"], ["JLC精灵城_巨魔首领开战承接"] = ____exports["执行巨魔首领开战承接"]}
return ____exports
