--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____03_FF0E_5267_60C5Boss_9884_7F6E_6865_63A5 = require("系统.11．剧情系统.01．主线任务.00．剧情系统核心工具.03．剧情Boss预置桥接")
local _____521B_5EFA_5E76_51BB_7ED3_5267_60C5Boss_9884_7F6E = ____03_FF0E_5267_60C5Boss_9884_7F6E_6865_63A5["创建并冻结剧情Boss预置"]
local ____06_FF0E_5267_60C5_901A_7528_6267_884C_5DE5_5177 = require("系统.11．剧情系统.01．主线任务.00．剧情系统核心工具.06．剧情通用执行工具")
local _____8BFB_53D6_8BED_4E49_5355_4F4D_5F15_7528 = ____06_FF0E_5267_60C5_901A_7528_6267_884C_5DE5_5177["读取语义单位引用"]
local ____33A_FF0E_738B_5BAB_5BC6_5BA4_573A_666F_5355_4F4D = require("系统.11．剧情系统.01．主线任务.02．剧情步骤.00．主线剧情.33A．王宫密室场景单位")
local _____5B9A_4F4D_5E76_767B_8BB0_738B_5BAB_5BC6_5BA4_5267_60C5_5355_4F4D = ____33A_FF0E_738B_5BAB_5BC6_5BA4_573A_666F_5355_4F4D["定位并登记王宫密室剧情单位"]
local _____738B_5BAB_5BC6_5BA4_573A_666F_7AD9_4F4D_8868 = ____33A_FF0E_738B_5BAB_5BC6_5BA4_573A_666F_5355_4F4D["王宫密室场景站位表"]
local _____79FB_52A8_73A9_5BB6_82F1_96C4_7EC4_5230_738B_5BAB_5BC6_5BA4 = ____33A_FF0E_738B_5BAB_5BC6_5BA4_573A_666F_5355_4F4D["移动玩家英雄组到王宫密室"]
local _____64AD_653E_738B_5BAB_5BC6_5BA4_6F14_51FA_7279_6548 = ____33A_FF0E_738B_5BAB_5BC6_5BA4_573A_666F_5355_4F4D["播放王宫密室演出特效"]
do
    local ____32_FF0E_7B2C_4E8C_7AE0_738B_5B50Boss_6218_8FC7_7A0B = require("系统.11．剧情系统.01．主线任务.02．剧情步骤.02．第二章.32．第二章王子Boss战过程")
    ____exports["第二章王子Boss战过程剧情片段"] = ____32_FF0E_7B2C_4E8C_7AE0_738B_5B50Boss_6218_8FC7_7A0B["第二章王子Boss战过程剧情片段"]
end
____exports["执行第二章王子Boss战前置"] = function()
    local _____5DF2_6709_91CC_79D1_7279 = _____8BFB_53D6_8BED_4E49_5355_4F4D_5F15_7528("Boss.里科特")
    if _____5DF2_6709_91CC_79D1_7279 ~= nil and _____5DF2_6709_91CC_79D1_7279 ~= 0 then
        return
    end
    _____521B_5EFA_5E76_51BB_7ED3_5267_60C5Boss_9884_7F6E({
        ["Boss键"] = "Boss.里科特",
        ["Boss名"] = "里科特",
        X = _____738B_5BAB_5BC6_5BA4_573A_666F_7AD9_4F4D_8868["里科特密室"].X,
        Y = _____738B_5BAB_5BC6_5BA4_573A_666F_7AD9_4F4D_8868["里科特密室"].Y,
        ["朝向"] = _____738B_5BAB_5BC6_5BA4_573A_666F_7AD9_4F4D_8868["里科特密室"]["朝向"],
        ["预创建后暂停"] = true,
        ["预创建后无敌"] = true
    })
end
____exports["执行进入传承密室"] = function()
    _____79FB_52A8_73A9_5BB6_82F1_96C4_7EC4_5230_738B_5BAB_5BC6_5BA4()
    _____5B9A_4F4D_5E76_767B_8BB0_738B_5BAB_5BC6_5BA4_5267_60C5_5355_4F4D("主线NPC.耶提尔", "主线NPC.耶提尔", _____738B_5BAB_5BC6_5BA4_573A_666F_7AD9_4F4D_8868["耶提尔密室内"])
    _____5B9A_4F4D_5E76_767B_8BB0_738B_5BAB_5BC6_5BA4_5267_60C5_5355_4F4D("主线NPC.里凡特", "主线NPC.里凡特", _____738B_5BAB_5BC6_5BA4_573A_666F_7AD9_4F4D_8868["里凡特密室内"])
end
____exports["执行里凡特开启传承密室门"] = function()
    _____64AD_653E_738B_5BAB_5BC6_5BA4_6F14_51FA_7279_6548("里凡特开启传承密室门", _____738B_5BAB_5BC6_5BA4_573A_666F_7AD9_4F4D_8868["里凡特密室门外"])
end
____exports["执行玩家队伍抵达传承密室"] = function()
    _____64AD_653E_738B_5BAB_5BC6_5BA4_6F14_51FA_7279_6548("玩家队伍抵达传承密室", _____738B_5BAB_5BC6_5BA4_573A_666F_7AD9_4F4D_8868["玩家队伍密室对白"])
end
____exports["第二章王子Boss战过程剧情动作注册表"] = {["JLC精灵城_第二章王子Boss战前置"] = ____exports["执行第二章王子Boss战前置"], ["JLC精灵城_里凡特开启传承密室门"] = ____exports["执行里凡特开启传承密室门"], ["JLC精灵城_进入传承密室"] = ____exports["执行进入传承密室"], ["JLC精灵城_玩家队伍抵达传承密室"] = ____exports["执行玩家队伍抵达传承密室"]}
return ____exports
