local ____lualib = require("lualib_bundle")
local __TS__Number = ____lualib.__TS__Number
local ____exports = {}
local ____10_FF0E_6807_51C6_5267_60C5_52A8_4F5C = require("系统.11．剧情系统.01．主线任务.00．剧情系统核心工具.10．标准剧情动作")
local _____8FDB_5165_4E3B_7EBF_8282_70B9 = ____10_FF0E_6807_51C6_5267_60C5_52A8_4F5C["进入主线节点"]
local ____31B_FF0E_8036_63D0_5C14_534F_6218_63A7_5236_5668 = require("系统.11．剧情系统.01．主线任务.02．剧情步骤.00．主线剧情.31B．耶提尔协战控制器")
local _____5E03_7F6E_8036_63D0_5C14_6218_540E_5956_52B1NPC = ____31B_FF0E_8036_63D0_5C14_534F_6218_63A7_5236_5668["布置耶提尔战后奖励NPC"]
do
    local ____35_FF0E_738B_57CE_6218_540E_4E0E_7B2C_4E09_7AE0_542F_7A0B = require("系统.11．剧情系统.01．主线任务.02．剧情步骤.03．第三章.35．王城战后与第三章启程")
    ____exports["王城战后与第三章启程剧情片段"] = ____35_FF0E_738B_57CE_6218_540E_4E0E_7B2C_4E09_7AE0_542F_7A0B["王城战后与第三章启程剧情片段"]
end
____exports["执行第三章启程布置"] = function(_____53C2_6570)
    _____5E03_7F6E_8036_63D0_5C14_6218_540E_5956_52B1NPC()
    _____8FDB_5165_4E3B_7EBF_8282_70B9(__TS__Number(_____53C2_6570["节点进度"]) or 36)
end
____exports["第三章启程剧情动作注册表"] = {["第三章_启程前往熔岩小镇"] = ____exports["执行第三章启程布置"]}
return ____exports
