--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____12_FF0E_5267_60C5_7535_5F71_955C_5934 = require("系统.11．剧情系统.01．主线任务.00．剧情系统核心工具.12．剧情电影镜头")
local _____5E94_7528_5267_60C5_7535_5F71_955C_5934 = ____12_FF0E_5267_60C5_7535_5F71_955C_5934["应用剧情电影镜头"]
local _____8FDB_5165_5267_60C5_7535_5F71_6A21_5F0F = ____12_FF0E_5267_60C5_7535_5F71_955C_5934["进入剧情电影模式"]
____exports["第三章电影镜头预设表"] = {
    [41] = {
        X = 19430.74,
        Y = -7947.24,
        ["高度偏移"] = 40,
        ["旋转角度"] = 90,
        ["攻角"] = 344,
        ["距离到目标"] = 2523.08,
        ["滚动角度"] = 0,
        ["观察区域"] = 50,
        ["远景剪裁"] = 7000
    },
    [42] = {
        X = 28676.21,
        Y = -3994.94,
        ["高度偏移"] = 100,
        ["旋转角度"] = 90,
        ["攻角"] = 344,
        ["距离到目标"] = 2523.08,
        ["滚动角度"] = 0,
        ["观察区域"] = 50,
        ["远景剪裁"] = 7000
    },
    [43] = {
        X = 15521.01,
        Y = -4025.45,
        ["高度偏移"] = 150,
        ["旋转角度"] = 10,
        ["攻角"] = 344,
        ["距离到目标"] = 3200,
        ["滚动角度"] = 0,
        ["观察区域"] = 70,
        ["远景剪裁"] = 7000
    },
    [46] = {
        X = 8435.27,
        Y = -14704.1,
        ["高度偏移"] = 50,
        ["旋转角度"] = 90,
        ["攻角"] = 350,
        ["距离到目标"] = 3000,
        ["滚动角度"] = 0,
        ["观察区域"] = 70,
        ["远景剪裁"] = 6000
    },
    [48] = {
        X = 1265.97,
        Y = -9787.9,
        ["高度偏移"] = 800,
        ["旋转角度"] = 130,
        ["攻角"] = 330,
        ["距离到目标"] = 5000,
        ["滚动角度"] = 0,
        ["观察区域"] = 65,
        ["远景剪裁"] = 8500
    },
    [50] = {
        X = 1265.97,
        Y = -9787.9,
        ["高度偏移"] = 400,
        ["旋转角度"] = 130,
        ["攻角"] = 350,
        ["距离到目标"] = 2500,
        ["滚动角度"] = 0,
        ["观察区域"] = 55,
        ["远景剪裁"] = 8500
    }
}
____exports["应用第三章电影镜头"] = function(_____8282_70B9)
    local _____9884_8BBE = ____exports["第三章电影镜头预设表"][_____8282_70B9]
    if _____9884_8BBE == nil then
        return
    end
    _____8FDB_5165_5267_60C5_7535_5F71_6A21_5F0F()
    _____5E94_7528_5267_60C5_7535_5F71_955C_5934(_____9884_8BBE, 0)
end
return ____exports
