local ____lualib = require("lualib_bundle")
local __TS__ArraySetLength = ____lualib.__TS__ArraySetLength
local __TS__ArraySplice = ____lualib.__TS__ArraySplice
local ____exports = {}
local _____53E5_67C4_6709_6548, _____5355_4F4D_5B58_6D3B, _____6E05_7406_5C01_5370_5B88_536B_6218_4E0B_4E00_6CE2_5012_8BA1_65F6UI, _____505C_6B62_5C01_5370_5B88_536B_6218_5012_8BA1_65F6, _____66F4_65B0_5C01_5370_5B88_536B_6218_4E0B_4E00_6CE2_5012_8BA1_65F6UI_5BF9_8C61, _____66F4_65B0_5C01_5370_5B88_536B_6218_4E0B_4E00_6CE2_5012_8BA1_65F6UI, _____6E05_7406_5C01_5370_5B88_536B_6218_951A_70B9_8FDB_5EA6UI, _____8BFB_53D6_5C01_5370_5B88_536B_6218_6CE2_6B21_5355_4F4D_7C7B_578BID, _____5E94_7528_5C01_5370_5B88_536B_6218_6CE2_6B21_5C5E_6027, _____521B_5EFA_5C01_5370_5B88_536B_6218_6CE2_6B21_5355_4F4D, _____521B_5EFA_5C01_5370_5B88_536B_6218_6CE2_6B21, _____6E05_7406_5C01_5370_5B88_536B_6218_654C_4EBA, _____79FB_9664_5DF2_6B7B_4EA1_5C01_5370_5B88_536B_6218_654C_4EBA, _____5237_65B0_5C01_5370_5B88_536B_6218_654C_4EBA_76EE_6807, _____63A8_8FDB_5C01_5370_5B88_536B_6218_6CE2_6B21, _____6240_6709_5C01_5370_5B88_536B_6218_951A_70B9_5DF2_5B8C_6210, _____5904_7406_5C01_5370_5B88_536B_6218_5931_8D25, _____5904_7406_5C01_5370_5B88_536B_6218_5B88_62A4_65F6_9650, _____6E05_7406_5C01_5370_5B88_536B_6218_951A_70B9_95EA_7535, DestroyEffect, Player, DestroyLightning, IssueTargetOrder, removePeriodicCallback, _____521B_5EFA_5355_4F4D_5E76_767B_8BB0_6392_6CC4_5B89_5168, _____7ACB_5373_79FB_9664_5355_4F4D_5E76_53D6_6D88_6392_6CC4_767B_8BB0, stringToFourCCSafe, IsUnitAliveBJ, _____6309_540D_5B57_53CD_67E5_603B_5355_4F4DID, GS_LoadUintProperty, GS_UnitPry, _____8BBE_7F6E_5168_4F53_73A9_5BB6_6E38_620F_5931_8D25, _____6E05_7406_5C01_5370_5B88_536B_6218_533A_57DF_97F3_4E50, _____4E2D_7ACB_654C_5BF9_73A9_5BB6ID, _____5C01_5370_5B88_536B_6218_654C_4EBA_76EE_6807_91CD_53D1_95F4_9694_6BEB_79D2, _____5C01_5370_5B88_536B_6218_6CE2_6B21_6700_5927_95F4_9694_79D2, _____5C01_5370_5B88_536B_6218_6CE2_6B21_51FA_751F_504F_79FB_8868, _____5F53_524D_5C01_5370_5B88_536B_6218_4F20_9001_95E8_7279_6548_5217_8868, _____5F53_524D_5C01_5370_5B88_536B_6218_951A_70B9_7279_6548_5217_8868, _____5F53_524D_5C01_5370_5B88_536B_6218_951A_70B9_95EA_7535_5217_8868, _____5F53_524D_5C01_5370_5B88_536B_6218_654C_4EBA_5217_8868, _____5F53_524D_5C01_5370_5B88_536B_6218_951A_70B9_4FEE_590D_79D2_6570, _____5F53_524D_5C01_5370_80FD_91CF_6838_5FC3, _____5F53_524D_5C01_5370_5B88_536B_6218_5012_8BA1_65F6UI, _____5F53_524D_5C01_5370_5B88_536B_6218_4E0B_4E00_6CE2_5012_8BA1_65F6UI, _____5F53_524D_5C01_5370_5B88_536B_6218_5237_65B0_70B9_4E0B_4E00_6CE2_5012_8BA1_65F6UI, _____5F53_524D_5C01_5370_5B88_536B_6218_951A_70B9_8FDB_5EA6UI, _____5F53_524D_5C01_5370_5B88_536B_6218_5012_8BA1_65F6_5468_671FID, _____5F53_524D_5C01_5370_5B88_536B_6218_7ED3_675F_65F6_95F4_6BEB_79D2, _____5F53_524D_5C01_5370_5B88_536B_6218_5F00_59CB_65F6_95F4_6BEB_79D2, _____5F53_524D_5C01_5370_5B88_536B_6218_4E0B_4E00_6CE2_7D22_5F15, _____5F53_524D_5C01_5370_5B88_536B_6218_4E0B_6B21_76EE_6807_91CD_53D1_65F6_95F4_6BEB_79D2, _____5F53_524D_5C01_5370_5B88_536B_6218_8FD0_884C_4E2D
local ____15_FF0E_4E16_754C_5750_6807_8FDB_5EA6UI = require("系统.09．表现系统.15．世界坐标进度UI.index")
local _____521B_5EFA_4E16_754C_5750_6807_8FDB_5EA6UI = ____15_FF0E_4E16_754C_5750_6807_8FDB_5EA6UI["创建世界坐标进度UI"]
local _____66F4_65B0_4E16_754C_5750_6807_8FDB_5EA6UI = ____15_FF0E_4E16_754C_5750_6807_8FDB_5EA6UI["更新世界坐标进度UI"]
local _____8BBE_7F6E_4E16_754C_5750_6807_8FDB_5EA6UI_663E_793A = ____15_FF0E_4E16_754C_5750_6807_8FDB_5EA6UI["设置世界坐标进度UI显示"]
local _____9500_6BC1_4E16_754C_5750_6807_8FDB_5EA6UI = ____15_FF0E_4E16_754C_5750_6807_8FDB_5EA6UI["销毁世界坐标进度UI"]
local ____01_FF0E_5267_60C5_52A8_4F5C_4E0A_4E0B_6587 = require("系统.11．剧情系统.01．主线任务.00．剧情系统核心工具.01．剧情动作上下文")
local _____8BFB_53D6_5267_60C5_8FDB_5EA6 = ____01_FF0E_5267_60C5_52A8_4F5C_4E0A_4E0B_6587["读取剧情进度"]
local ____10_FF0E_6807_51C6_5267_60C5_52A8_4F5C = require("系统.11．剧情系统.01．主线任务.00．剧情系统核心工具.10．标准剧情动作")
local _____8FDB_5165_4E3B_7EBF_8282_70B9 = ____10_FF0E_6807_51C6_5267_60C5_52A8_4F5C["进入主线节点"]
local ____08_FF0E_5267_60C5_8FD0_884C_65F6_5355_4F4D = require("系统.11．剧情系统.01．主线任务.00．剧情系统核心工具.08．剧情运行时单位")
local _____6E05_7406_5267_60C5_8FD0_884C_65F6_5355_4F4D = ____08_FF0E_5267_60C5_8FD0_884C_65F6_5355_4F4D["清理剧情运行时单位"]
local _____6CE8_518C_5267_60C5_8FD0_884C_65F6_5355_4F4D = ____08_FF0E_5267_60C5_8FD0_884C_65F6_5355_4F4D["注册剧情运行时单位"]
function _____53E5_67C4_6709_6548(handle)
    return handle ~= nil and handle ~= 0
end
function _____5355_4F4D_5B58_6D3B(unit)
    return _____53E5_67C4_6709_6548(unit) and IsUnitAliveBJ(unit)
end
function _____6E05_7406_5C01_5370_5B88_536B_6218_4E0B_4E00_6CE2_5012_8BA1_65F6UI()
    _____9500_6BC1_4E16_754C_5750_6807_8FDB_5EA6UI(_____5F53_524D_5C01_5370_5B88_536B_6218_4E0B_4E00_6CE2_5012_8BA1_65F6UI)
    _____5F53_524D_5C01_5370_5B88_536B_6218_4E0B_4E00_6CE2_5012_8BA1_65F6UI = nil
    do
        local i = 0
        while i < #_____5F53_524D_5C01_5370_5B88_536B_6218_5237_65B0_70B9_4E0B_4E00_6CE2_5012_8BA1_65F6UI do
            _____9500_6BC1_4E16_754C_5750_6807_8FDB_5EA6UI(_____5F53_524D_5C01_5370_5B88_536B_6218_5237_65B0_70B9_4E0B_4E00_6CE2_5012_8BA1_65F6UI[i + 1])
            _____5F53_524D_5C01_5370_5B88_536B_6218_5237_65B0_70B9_4E0B_4E00_6CE2_5012_8BA1_65F6UI[i + 1] = nil
            i = i + 1
        end
    end
    __TS__ArraySetLength(_____5F53_524D_5C01_5370_5B88_536B_6218_5237_65B0_70B9_4E0B_4E00_6CE2_5012_8BA1_65F6UI, 0)
end
function _____505C_6B62_5C01_5370_5B88_536B_6218_5012_8BA1_65F6()
    if _____5F53_524D_5C01_5370_5B88_536B_6218_5012_8BA1_65F6_5468_671FID ~= 0 then
        removePeriodicCallback(_____5F53_524D_5C01_5370_5B88_536B_6218_5012_8BA1_65F6_5468_671FID)
        _____5F53_524D_5C01_5370_5B88_536B_6218_5012_8BA1_65F6_5468_671FID = 0
    end
    _____9500_6BC1_4E16_754C_5750_6807_8FDB_5EA6UI(_____5F53_524D_5C01_5370_5B88_536B_6218_5012_8BA1_65F6UI)
    _____5F53_524D_5C01_5370_5B88_536B_6218_5012_8BA1_65F6UI = nil
    _____6E05_7406_5C01_5370_5B88_536B_6218_4E0B_4E00_6CE2_5012_8BA1_65F6UI()
    _____5F53_524D_5C01_5370_5B88_536B_6218_7ED3_675F_65F6_95F4_6BEB_79D2 = 0
    _____5F53_524D_5C01_5370_5B88_536B_6218_5F00_59CB_65F6_95F4_6BEB_79D2 = 0
end
function _____66F4_65B0_5C01_5370_5B88_536B_6218_4E0B_4E00_6CE2_5012_8BA1_65F6UI_5BF9_8C61(ui, _____5269_4F59_79D2, _____662F_5426_663E_793A)
    _____66F4_65B0_4E16_754C_5750_6807_8FDB_5EA6UI(ui, _____5269_4F59_79D2, true)
    _____8BBE_7F6E_4E16_754C_5750_6807_8FDB_5EA6UI_663E_793A(ui, _____662F_5426_663E_793A)
end
function _____66F4_65B0_5C01_5370_5B88_536B_6218_4E0B_4E00_6CE2_5012_8BA1_65F6UI(_____5F53_524D_65F6_95F4_6BEB_79D2)
    local _____4E0B_4E00_6CE2 = ____exports["封印守卫战波次配置表"][_____5F53_524D_5C01_5370_5B88_536B_6218_4E0B_4E00_6CE2_7D22_5F15 + 1]
    if _____4E0B_4E00_6CE2 == nil or _____5F53_524D_5C01_5370_5B88_536B_6218_5F00_59CB_65F6_95F4_6BEB_79D2 <= 0 then
        _____66F4_65B0_5C01_5370_5B88_536B_6218_4E0B_4E00_6CE2_5012_8BA1_65F6UI_5BF9_8C61(_____5F53_524D_5C01_5370_5B88_536B_6218_4E0B_4E00_6CE2_5012_8BA1_65F6UI, 0, false)
        do
            local i = 0
            while i < #_____5F53_524D_5C01_5370_5B88_536B_6218_5237_65B0_70B9_4E0B_4E00_6CE2_5012_8BA1_65F6UI do
                _____66F4_65B0_5C01_5370_5B88_536B_6218_4E0B_4E00_6CE2_5012_8BA1_65F6UI_5BF9_8C61(_____5F53_524D_5C01_5370_5B88_536B_6218_5237_65B0_70B9_4E0B_4E00_6CE2_5012_8BA1_65F6UI[i + 1], 0, false)
                i = i + 1
            end
        end
        return
    end
    local _____5269_4F59_79D2 = (_____5F53_524D_5C01_5370_5B88_536B_6218_5F00_59CB_65F6_95F4_6BEB_79D2 + _____4E0B_4E00_6CE2["开始秒"] * 1000 - _____5F53_524D_65F6_95F4_6BEB_79D2) / 1000
    if _____5269_4F59_79D2 < 0 then
        _____5269_4F59_79D2 = 0
    end
    if _____5269_4F59_79D2 > _____5C01_5370_5B88_536B_6218_6CE2_6B21_6700_5927_95F4_9694_79D2 then
        _____5269_4F59_79D2 = _____5C01_5370_5B88_536B_6218_6CE2_6B21_6700_5927_95F4_9694_79D2
    end
    _____66F4_65B0_5C01_5370_5B88_536B_6218_4E0B_4E00_6CE2_5012_8BA1_65F6UI_5BF9_8C61(_____5F53_524D_5C01_5370_5B88_536B_6218_4E0B_4E00_6CE2_5012_8BA1_65F6UI, _____5269_4F59_79D2, true)
    do
        local i = 0
        while i < #_____5F53_524D_5C01_5370_5B88_536B_6218_5237_65B0_70B9_4E0B_4E00_6CE2_5012_8BA1_65F6UI do
            _____66F4_65B0_5C01_5370_5B88_536B_6218_4E0B_4E00_6CE2_5012_8BA1_65F6UI_5BF9_8C61(_____5F53_524D_5C01_5370_5B88_536B_6218_5237_65B0_70B9_4E0B_4E00_6CE2_5012_8BA1_65F6UI[i + 1], _____5269_4F59_79D2, true)
            i = i + 1
        end
    end
end
function _____6E05_7406_5C01_5370_5B88_536B_6218_951A_70B9_8FDB_5EA6UI()
    do
        local i = 0
        while i < #_____5F53_524D_5C01_5370_5B88_536B_6218_951A_70B9_8FDB_5EA6UI do
            _____9500_6BC1_4E16_754C_5750_6807_8FDB_5EA6UI(_____5F53_524D_5C01_5370_5B88_536B_6218_951A_70B9_8FDB_5EA6UI[i + 1])
            _____5F53_524D_5C01_5370_5B88_536B_6218_951A_70B9_8FDB_5EA6UI[i + 1] = nil
            _____5F53_524D_5C01_5370_5B88_536B_6218_951A_70B9_4FEE_590D_79D2_6570[i + 1] = 0
            i = i + 1
        end
    end
end
function _____8BFB_53D6_5C01_5370_5B88_536B_6218_6CE2_6B21_5355_4F4D_7C7B_578BID(_____5355_4F4D_540D)
    return stringToFourCCSafe(_____6309_540D_5B57_53CD_67E5_603B_5355_4F4DID(_____5355_4F4D_540D))
end
function _____5E94_7528_5C01_5370_5B88_536B_6218_6CE2_6B21_5C5E_6027(unit, _____5C5E_6027_500D_7387)
    if not _____5355_4F4D_5B58_6D3B(unit) or not (_____5C5E_6027_500D_7387 > 0) or _____5C5E_6027_500D_7387 == 1 then
        return
    end
    local _____6700_5927_751F_547D = GS_LoadUintProperty(unit, 0)
    local _____653B_51FB_529B = GS_LoadUintProperty(unit, 2)
    local _____62A4_7532 = GS_LoadUintProperty(unit, 3)
    if _____6700_5927_751F_547D > 0 then
        GS_UnitPry(unit, 0, 0, _____6700_5927_751F_547D * (_____5C5E_6027_500D_7387 - 1))
    end
    if _____653B_51FB_529B > 0 then
        GS_UnitPry(unit, 0, 2, _____653B_51FB_529B * (_____5C5E_6027_500D_7387 - 1))
    end
    if _____62A4_7532 > 0 then
        GS_UnitPry(unit, 0, 3, _____62A4_7532 * (_____5C5E_6027_500D_7387 - 1))
    end
end
function _____521B_5EFA_5C01_5370_5B88_536B_6218_6CE2_6B21_5355_4F4D(_____5355_4F4D_540D, _____51FA_751F_70B9_7D22_5F15, _____51FA_751F_5E8F_53F7, _____5C5E_6027_500D_7387)
    local _____5355_4F4D_7C7B_578BID = _____8BFB_53D6_5C01_5370_5B88_536B_6218_6CE2_6B21_5355_4F4D_7C7B_578BID(_____5355_4F4D_540D)
    local _____51FA_751F_70B9 = ____exports["封印守卫战三路传送门位置表"][_____51FA_751F_70B9_7D22_5F15 % #____exports["封印守卫战三路传送门位置表"] + 1]
    local _____504F_79FB = _____5C01_5370_5B88_536B_6218_6CE2_6B21_51FA_751F_504F_79FB_8868[_____51FA_751F_5E8F_53F7 % #_____5C01_5370_5B88_536B_6218_6CE2_6B21_51FA_751F_504F_79FB_8868 + 1]
    if not (_____5355_4F4D_7C7B_578BID > 0) or _____51FA_751F_70B9 == nil or _____504F_79FB == nil then
        return nil
    end
    local unit = _____521B_5EFA_5355_4F4D_5E76_767B_8BB0_6392_6CC4_5B89_5168(
        Player(_____4E2D_7ACB_654C_5BF9_73A9_5BB6ID),
        _____5355_4F4D_7C7B_578BID,
        _____51FA_751F_70B9.X + _____504F_79FB.X,
        _____51FA_751F_70B9.Y + _____504F_79FB.Y,
        _____51FA_751F_70B9["初始面向"]
    )
    if not _____5355_4F4D_5B58_6D3B(unit) then
        return nil
    end
    _____5E94_7528_5C01_5370_5B88_536B_6218_6CE2_6B21_5C5E_6027(unit, _____5C5E_6027_500D_7387)
    if _____5355_4F4D_5B58_6D3B(_____5F53_524D_5C01_5370_80FD_91CF_6838_5FC3) then
        IssueTargetOrder(unit, "attack", _____5F53_524D_5C01_5370_80FD_91CF_6838_5FC3)
    end
    return unit
end
function _____521B_5EFA_5C01_5370_5B88_536B_6218_6CE2_6B21(_____914D_7F6E)
    local _____51FA_751F_5E8F_53F7 = 0
    do
        local i = 0
        while i < #_____914D_7F6E["单位列表"] do
            local _____5355_4F4D_914D_7F6E = _____914D_7F6E["单位列表"][i + 1]
            do
                local j = 0
                while j < _____5355_4F4D_914D_7F6E["数量"] do
                    local unit = _____521B_5EFA_5C01_5370_5B88_536B_6218_6CE2_6B21_5355_4F4D(_____5355_4F4D_914D_7F6E["单位名"], _____51FA_751F_5E8F_53F7 % #____exports["封印守卫战三路传送门位置表"], _____51FA_751F_5E8F_53F7, _____914D_7F6E["属性倍率"])
                    if _____5355_4F4D_5B58_6D3B(unit) then
                        _____5F53_524D_5C01_5370_5B88_536B_6218_654C_4EBA_5217_8868[#_____5F53_524D_5C01_5370_5B88_536B_6218_654C_4EBA_5217_8868 + 1] = unit
                    end
                    _____51FA_751F_5E8F_53F7 = _____51FA_751F_5E8F_53F7 + 1
                    j = j + 1
                end
            end
            i = i + 1
        end
    end
end
function _____6E05_7406_5C01_5370_5B88_536B_6218_654C_4EBA()
    do
        local i = 0
        while i < #_____5F53_524D_5C01_5370_5B88_536B_6218_654C_4EBA_5217_8868 do
            local unit = _____5F53_524D_5C01_5370_5B88_536B_6218_654C_4EBA_5217_8868[i + 1]
            if _____53E5_67C4_6709_6548(unit) then
                _____7ACB_5373_79FB_9664_5355_4F4D_5E76_53D6_6D88_6392_6CC4_767B_8BB0(unit)
            end
            i = i + 1
        end
    end
    __TS__ArraySetLength(_____5F53_524D_5C01_5370_5B88_536B_6218_654C_4EBA_5217_8868, 0)
end
function _____79FB_9664_5DF2_6B7B_4EA1_5C01_5370_5B88_536B_6218_654C_4EBA()
    do
        local i = #_____5F53_524D_5C01_5370_5B88_536B_6218_654C_4EBA_5217_8868 - 1
        while i >= 0 do
            if not _____5355_4F4D_5B58_6D3B(_____5F53_524D_5C01_5370_5B88_536B_6218_654C_4EBA_5217_8868[i + 1]) then
                __TS__ArraySplice(_____5F53_524D_5C01_5370_5B88_536B_6218_654C_4EBA_5217_8868, i, 1)
            end
            i = i - 1
        end
    end
end
function _____5237_65B0_5C01_5370_5B88_536B_6218_654C_4EBA_76EE_6807(_____5F53_524D_65F6_95F4_6BEB_79D2)
    if _____5F53_524D_65F6_95F4_6BEB_79D2 < _____5F53_524D_5C01_5370_5B88_536B_6218_4E0B_6B21_76EE_6807_91CD_53D1_65F6_95F4_6BEB_79D2 then
        return
    end
    _____5F53_524D_5C01_5370_5B88_536B_6218_4E0B_6B21_76EE_6807_91CD_53D1_65F6_95F4_6BEB_79D2 = _____5F53_524D_65F6_95F4_6BEB_79D2 + _____5C01_5370_5B88_536B_6218_654C_4EBA_76EE_6807_91CD_53D1_95F4_9694_6BEB_79D2
    if not _____5355_4F4D_5B58_6D3B(_____5F53_524D_5C01_5370_80FD_91CF_6838_5FC3) then
        return
    end
    _____79FB_9664_5DF2_6B7B_4EA1_5C01_5370_5B88_536B_6218_654C_4EBA()
    do
        local i = 0
        while i < #_____5F53_524D_5C01_5370_5B88_536B_6218_654C_4EBA_5217_8868 do
            local unit = _____5F53_524D_5C01_5370_5B88_536B_6218_654C_4EBA_5217_8868[i + 1]
            if _____5355_4F4D_5B58_6D3B(unit) then
                IssueTargetOrder(unit, "attack", _____5F53_524D_5C01_5370_80FD_91CF_6838_5FC3)
            end
            i = i + 1
        end
    end
end
function _____63A8_8FDB_5C01_5370_5B88_536B_6218_6CE2_6B21(_____5F53_524D_65F6_95F4_6BEB_79D2)
    while _____5F53_524D_5C01_5370_5B88_536B_6218_4E0B_4E00_6CE2_7D22_5F15 < #____exports["封印守卫战波次配置表"] do
        local _____4E0B_4E00_6CE2 = ____exports["封印守卫战波次配置表"][_____5F53_524D_5C01_5370_5B88_536B_6218_4E0B_4E00_6CE2_7D22_5F15 + 1]
        if _____4E0B_4E00_6CE2 == nil then
            break
        end
        local _____8BA1_5212_65F6_95F4_6BEB_79D2 = _____5F53_524D_5C01_5370_5B88_536B_6218_5F00_59CB_65F6_95F4_6BEB_79D2 + _____4E0B_4E00_6CE2["开始秒"] * 1000
        if _____5F53_524D_65F6_95F4_6BEB_79D2 < _____8BA1_5212_65F6_95F4_6BEB_79D2 then
            break
        end
        _____521B_5EFA_5C01_5370_5B88_536B_6218_6CE2_6B21(_____4E0B_4E00_6CE2)
        _____5F53_524D_5C01_5370_5B88_536B_6218_4E0B_4E00_6CE2_7D22_5F15 = _____5F53_524D_5C01_5370_5B88_536B_6218_4E0B_4E00_6CE2_7D22_5F15 + 1
    end
    _____66F4_65B0_5C01_5370_5B88_536B_6218_4E0B_4E00_6CE2_5012_8BA1_65F6UI(_____5F53_524D_65F6_95F4_6BEB_79D2)
    _____5237_65B0_5C01_5370_5B88_536B_6218_654C_4EBA_76EE_6807(_____5F53_524D_65F6_95F4_6BEB_79D2)
end
function _____6240_6709_5C01_5370_5B88_536B_6218_951A_70B9_5DF2_5B8C_6210()
    do
        local i = 0
        while i < #_____5F53_524D_5C01_5370_5B88_536B_6218_951A_70B9_4FEE_590D_79D2_6570 do
            if _____5F53_524D_5C01_5370_5B88_536B_6218_951A_70B9_4FEE_590D_79D2_6570[i + 1] < ____exports["封印守卫战锚点修复持续秒"] then
                return false
            end
            i = i + 1
        end
    end
    return true
end
function _____5904_7406_5C01_5370_5B88_536B_6218_5931_8D25()
    if not _____5F53_524D_5C01_5370_5B88_536B_6218_8FD0_884C_4E2D then
        return
    end
    _____5F53_524D_5C01_5370_5B88_536B_6218_8FD0_884C_4E2D = false
    _____6E05_7406_5C01_5370_5B88_536B_6218_533A_57DF_97F3_4E50()
    _____6E05_7406_5C01_5370_5B88_536B_6218_654C_4EBA()
    ____exports["清理封印守卫战三路传送门"]()
    ____exports["清理封印能量核心与守护倒计时"]()
    _____8BBE_7F6E_5168_4F53_73A9_5BB6_6E38_620F_5931_8D25()
end
function _____5904_7406_5C01_5370_5B88_536B_6218_5B88_62A4_65F6_9650()
    if not _____5F53_524D_5C01_5370_5B88_536B_6218_8FD0_884C_4E2D then
        return
    end
    _____5F53_524D_5C01_5370_5B88_536B_6218_8FD0_884C_4E2D = false
    _____6E05_7406_5C01_5370_5B88_536B_6218_533A_57DF_97F3_4E50()
    _____505C_6B62_5C01_5370_5B88_536B_6218_5012_8BA1_65F6()
    _____6E05_7406_5C01_5370_5B88_536B_6218_654C_4EBA()
    ____exports["清理封印守卫战三路传送门"]()
    if not _____6240_6709_5C01_5370_5B88_536B_6218_951A_70B9_5DF2_5B8C_6210() then
        ____exports["清理封印能量核心与守护倒计时"]()
        _____8BBE_7F6E_5168_4F53_73A9_5BB6_6E38_620F_5931_8D25()
    end
end
function _____6E05_7406_5C01_5370_5B88_536B_6218_951A_70B9_95EA_7535()
    do
        local i = 0
        while i < #_____5F53_524D_5C01_5370_5B88_536B_6218_951A_70B9_95EA_7535_5217_8868 do
            local _____95EA_7535 = _____5F53_524D_5C01_5370_5B88_536B_6218_951A_70B9_95EA_7535_5217_8868[i + 1]
            if _____53E5_67C4_6709_6548(_____95EA_7535) then
                DestroyLightning(_____95EA_7535)
            end
            i = i + 1
        end
    end
    __TS__ArraySetLength(_____5F53_524D_5C01_5370_5B88_536B_6218_951A_70B9_95EA_7535_5217_8868, 0)
end
____exports["清理封印守卫战锚点特效"] = function()
    do
        local i = 0
        while i < #_____5F53_524D_5C01_5370_5B88_536B_6218_951A_70B9_7279_6548_5217_8868 do
            local _____7279_6548 = _____5F53_524D_5C01_5370_5B88_536B_6218_951A_70B9_7279_6548_5217_8868[i + 1]
            if _____53E5_67C4_6709_6548(_____7279_6548) then
                DestroyEffect(_____7279_6548)
            end
            i = i + 1
        end
    end
    __TS__ArraySetLength(_____5F53_524D_5C01_5370_5B88_536B_6218_951A_70B9_7279_6548_5217_8868, 0)
end
____exports["清理封印守卫战三路传送门"] = function()
    do
        local i = 0
        while i < #_____5F53_524D_5C01_5370_5B88_536B_6218_4F20_9001_95E8_7279_6548_5217_8868 do
            local _____7279_6548 = _____5F53_524D_5C01_5370_5B88_536B_6218_4F20_9001_95E8_7279_6548_5217_8868[i + 1]
            if _____53E5_67C4_6709_6548(_____7279_6548) then
                DestroyEffect(_____7279_6548)
            end
            i = i + 1
        end
    end
    __TS__ArraySetLength(_____5F53_524D_5C01_5370_5B88_536B_6218_4F20_9001_95E8_7279_6548_5217_8868, 0)
end
____exports["清理封印能量核心与守护倒计时"] = function()
    _____505C_6B62_5C01_5370_5B88_536B_6218_5012_8BA1_65F6()
    _____6E05_7406_5C01_5370_5B88_536B_6218_951A_70B9_8FDB_5EA6UI()
    ____exports["清理封印守卫战锚点特效"]()
    _____6E05_7406_5C01_5370_5B88_536B_6218_951A_70B9_95EA_7535()
    if _____53E5_67C4_6709_6548(_____5F53_524D_5C01_5370_80FD_91CF_6838_5FC3) then
        _____7ACB_5373_79FB_9664_5355_4F4D_5E76_53D6_6D88_6392_6CC4_767B_8BB0(_____5F53_524D_5C01_5370_80FD_91CF_6838_5FC3)
    end
    _____5F53_524D_5C01_5370_80FD_91CF_6838_5FC3 = nil
    _____6E05_7406_5267_60C5_8FD0_884C_65F6_5355_4F4D("剧情运行时.封印守卫战能量核心")
end
local jass = require("jass.common")
local ____require_result_0 = require("lib.扩展函数.封装函数.01．通用工具.03．特效")
local _____521B_5EFA_70B9_7279_6548 = ____require_result_0["创建点特效"]
DestroyEffect = jass.DestroyEffect
Player = jass.Player
local AddLightningEx = jass.AddLightningEx
DestroyLightning = jass.DestroyLightning
IssueTargetOrder = jass.IssueTargetOrder
local ____require_result_1 = require("系统.03．技能系统.00．技能模板+函数.02．通用函数.17．闪电效果代码")
local _____95EA_7535_6548_679C_4EE3_7801 = ____require_result_1["闪电效果代码"]
local ____require_result_2 = require("系统.00．核心系统.05．中心计时器")
local addPeriodicCallback = ____require_result_2.addPeriodicCallback
removePeriodicCallback = ____require_result_2.removePeriodicCallback
local getServerTime = ____require_result_2.getServerTime
local ____require_result_3 = require("lib.扩展函数.自定义扩展函数.05．单位相关安全包装")
_____521B_5EFA_5355_4F4D_5E76_767B_8BB0_6392_6CC4_5B89_5168 = ____require_result_3["创建单位并登记排泄安全"]
local ____require_result_4 = require("系统.00．核心系统.01．事件中心.07A．单位排泄")
_____7ACB_5373_79FB_9664_5355_4F4D_5E76_53D6_6D88_6392_6CC4_767B_8BB0 = ____require_result_4["立即移除单位并取消排泄登记"]
local ____require_result_5 = require("lib.扩展函数.Star扩展函数.Star扩展库.06A．X库函数安全版")
local X_FixUnitStandingSafe = ____require_result_5.X_FixUnitStandingSafe
local ____require_result_6 = require("lib.扩展函数.封装函数.01．通用工具.01．FourCC转换安全版")
stringToFourCCSafe = ____require_result_6.stringToFourCCSafe
local ____require_result_7 = require("lib.扩展函数.BJ函数.02．单位与英雄")
IsUnitAliveBJ = ____require_result_7.IsUnitAliveBJ
local ____require_result_8 = require("系统.01．单位系统.08．单位配置表.04．总单位配置表")
_____6309_540D_5B57_53CD_67E5_603B_5355_4F4DID = ____require_result_8["按名字反查总单位ID"]
local ____require_result_9 = require("lib.扩展函数.Star扩展函数.02．GS单位属性")
GS_LoadUintProperty = ____require_result_9.GS_LoadUintProperty
GS_UnitPry = ____require_result_9.GS_UnitPry
local ____require_result_10 = require("系统.00．核心系统.01．事件中心.07．单位死亡事件中心")
local registerDeathListener = ____require_result_10.registerDeathListener
local ____require_result_11 = require("系统.00．核心系统.09．游戏结算开关")
_____8BBE_7F6E_5168_4F53_73A9_5BB6_6E38_620F_5931_8D25 = ____require_result_11["设置全体玩家游戏失败"]
local ____require_result_12 = require("系统.07．地形系统.07．区域背景音乐.03．动态区域背景音乐")
local _____542F_7528_5C01_5370_5B88_536B_6218_533A_57DF_97F3_4E50 = ____require_result_12["启用封印守卫战区域音乐"]
_____6E05_7406_5C01_5370_5B88_536B_6218_533A_57DF_97F3_4E50 = ____require_result_12["清理封印守卫战区域音乐"]
local _____5C01_5370_5B88_536B_6218_4F20_9001_95E8_6A21_578B = "Common\\Effect\\Form\\Portal\\SealGuardWavePortal.mdx"
local _____5C01_5370_5B88_536B_6218_951A_70B9_6A21_578B = "Common\\Effect\\Form\\Marker\\SealAnchorCrystalTower.mdx"
local _____5C01_5370_80FD_91CF_6838_5FC3_5355_4F4DID = stringToFourCCSafe("n06G")
local _____4E2D_7ACB_88AB_52A8_73A9_5BB6ID = 15
_____4E2D_7ACB_654C_5BF9_73A9_5BB6ID = jass.PLAYER_NEUTRAL_AGGRESSIVE
local _____5C01_5370_5B88_536B_6218_5012_8BA1_65F6_5237_65B0_6BEB_79D2 = 100
_____5C01_5370_5B88_536B_6218_654C_4EBA_76EE_6807_91CD_53D1_95F4_9694_6BEB_79D2 = 1800
_____5C01_5370_5B88_536B_6218_6CE2_6B21_6700_5927_95F4_9694_79D2 = 45
____exports["封印守卫战持续秒"] = 300
____exports["封印守卫战锚点修复持续秒"] = 40
____exports["封印守卫战锚点修复退回速度"] = 0.25
____exports["封印能量核心位置"] = {X = 975.9, Y = -9652.2, Z = 250.8, ["朝向"] = 0}
____exports["封印守卫战锚点位置表"] = {{["编号"] = 1, X = 959.6, Y = -9016.9, Z = 230.3}, {["编号"] = 2, X = 396.7, Y = -10096.3, Z = 252.5}, {["编号"] = 3, X = 1588.6, Y = -10146.2, Z = 264.4}}
____exports["封印守卫战锚点闪电连接表"] = {{["锚点编号"] = 1, ["代码"] = _____95EA_7535_6548_679C_4EE3_7801["粉色光束"], ["能量源X"] = 1148.2, ["能量源Y"] = -7998.1}, {["锚点编号"] = 2, ["代码"] = _____95EA_7535_6548_679C_4EE3_7801["绿色光束"], ["能量源X"] = -377.1, ["能量源Y"] = -10973.8}, {["锚点编号"] = 3, ["代码"] = _____95EA_7535_6548_679C_4EE3_7801["青蓝白光束"], ["能量源X"] = 2639.2, ["能量源Y"] = -10680}}
____exports["封印守卫战三路传送门位置表"] = {{["路线"] = "北侧", X = 1193.2, Y = -8251.9, ["初始面向"] = 253.02}, {["路线"] = "西南", X = -114.6, Y = -10868.3, ["初始面向"] = 56.48}, {["路线"] = "东南", X = 2113.4, Y = -11018.6, ["初始面向"] = 121.03}}
____exports["封印守卫战波次配置表"] = {
    {["波次"] = 1, ["开始秒"] = 0, ["属性倍率"] = 1, ["单位列表"] = {{["单位名"] = "失控英灵", ["数量"] = 8}, {["单位名"] = "断誓猎手", ["数量"] = 4}, {["单位名"] = "黑暗残响", ["数量"] = 1}}},
    {["波次"] = 2, ["开始秒"] = 45, ["属性倍率"] = 1.1, ["单位列表"] = {{["单位名"] = "失控英灵", ["数量"] = 10}, {["单位名"] = "夺灵祭司", ["数量"] = 4}, {["单位名"] = "锚蚀兽", ["数量"] = 2}, {["单位名"] = "失律号令者", ["数量"] = 1}}},
    {["波次"] = 3, ["开始秒"] = 90, ["属性倍率"] = 1.22, ["单位列表"] = {{["单位名"] = "失控英灵", ["数量"] = 12}, {["单位名"] = "断誓猎手", ["数量"] = 5}, {["单位名"] = "锚蚀兽", ["数量"] = 2}, {["单位名"] = "裂誓重卫", ["数量"] = 1}}},
    {["波次"] = 4, ["开始秒"] = 135, ["属性倍率"] = 1.36, ["单位列表"] = {
        {["单位名"] = "失控英灵", ["数量"] = 14},
        {["单位名"] = "断誓猎手", ["数量"] = 6},
        {["单位名"] = "夺灵祭司", ["数量"] = 2},
        {["单位名"] = "裂誓重卫", ["数量"] = 1},
        {["单位名"] = "黑暗残响", ["数量"] = 1}
    }},
    {["波次"] = 5, ["开始秒"] = 180, ["属性倍率"] = 1.52, ["单位列表"] = {
        {["单位名"] = "失控英灵", ["数量"] = 16},
        {["单位名"] = "断誓猎手", ["数量"] = 6},
        {["单位名"] = "锚蚀兽", ["数量"] = 3},
        {["单位名"] = "夺灵祭司", ["数量"] = 2},
        {["单位名"] = "裂誓重卫", ["数量"] = 1},
        {["单位名"] = "失律号令者", ["数量"] = 1}
    }},
    {["波次"] = 6, ["开始秒"] = 198, ["属性倍率"] = 1.52, ["单位列表"] = {{["单位名"] = "失控英灵", ["数量"] = 10}, {["单位名"] = "夺灵祭司", ["数量"] = 4}, {["单位名"] = "黑暗残响", ["数量"] = 1}, {["单位名"] = "失律号令者", ["数量"] = 1}}},
    {["波次"] = 7, ["开始秒"] = 230, ["属性倍率"] = 1.7, ["单位列表"] = {
        {["单位名"] = "失控英灵", ["数量"] = 18},
        {["单位名"] = "锚蚀兽", ["数量"] = 6},
        {["单位名"] = "断誓猎手", ["数量"] = 3},
        {["单位名"] = "裂誓重卫", ["数量"] = 2},
        {["单位名"] = "失律号令者", ["数量"] = 1}
    }},
    {["波次"] = 8, ["开始秒"] = 248, ["属性倍率"] = 1.7, ["单位列表"] = {{["单位名"] = "断誓猎手", ["数量"] = 8}, {["单位名"] = "失控英灵", ["数量"] = 4}, {["单位名"] = "夺灵祭司", ["数量"] = 3}, {["单位名"] = "黑暗残响", ["数量"] = 2}}},
    {["波次"] = 9, ["开始秒"] = 266, ["属性倍率"] = 1.7, ["单位列表"] = {
        {["单位名"] = "失控英灵", ["数量"] = 12},
        {["单位名"] = "锚蚀兽", ["数量"] = 4},
        {["单位名"] = "夺灵祭司", ["数量"] = 4},
        {["单位名"] = "裂誓重卫", ["数量"] = 2},
        {["单位名"] = "失律号令者", ["数量"] = 1}
    }}
}
_____5C01_5370_5B88_536B_6218_6CE2_6B21_51FA_751F_504F_79FB_8868 = {
    {X = 0, Y = 0},
    {X = 96, Y = 0},
    {X = -96, Y = 0},
    {X = 0, Y = 96},
    {X = 0, Y = -96},
    {X = 160, Y = 96},
    {X = -160, Y = 96},
    {X = 160, Y = -96},
    {X = -160, Y = -96}
}
_____5F53_524D_5C01_5370_5B88_536B_6218_4F20_9001_95E8_7279_6548_5217_8868 = {}
_____5F53_524D_5C01_5370_5B88_536B_6218_951A_70B9_7279_6548_5217_8868 = {}
_____5F53_524D_5C01_5370_5B88_536B_6218_951A_70B9_95EA_7535_5217_8868 = {}
_____5F53_524D_5C01_5370_5B88_536B_6218_654C_4EBA_5217_8868 = {}
_____5F53_524D_5C01_5370_5B88_536B_6218_951A_70B9_4FEE_590D_79D2_6570 = {0, 0, 0}
_____5F53_524D_5C01_5370_80FD_91CF_6838_5FC3 = nil
_____5F53_524D_5C01_5370_5B88_536B_6218_5012_8BA1_65F6UI = nil
_____5F53_524D_5C01_5370_5B88_536B_6218_4E0B_4E00_6CE2_5012_8BA1_65F6UI = nil
_____5F53_524D_5C01_5370_5B88_536B_6218_5237_65B0_70B9_4E0B_4E00_6CE2_5012_8BA1_65F6UI = {}
_____5F53_524D_5C01_5370_5B88_536B_6218_951A_70B9_8FDB_5EA6UI = {nil, nil, nil}
_____5F53_524D_5C01_5370_5B88_536B_6218_5012_8BA1_65F6_5468_671FID = 0
_____5F53_524D_5C01_5370_5B88_536B_6218_7ED3_675F_65F6_95F4_6BEB_79D2 = 0
_____5F53_524D_5C01_5370_5B88_536B_6218_5F00_59CB_65F6_95F4_6BEB_79D2 = 0
_____5F53_524D_5C01_5370_5B88_536B_6218_4E0B_4E00_6CE2_7D22_5F15 = 0
_____5F53_524D_5C01_5370_5B88_536B_6218_4E0B_6B21_76EE_6807_91CD_53D1_65F6_95F4_6BEB_79D2 = 0
_____5F53_524D_5C01_5370_5B88_536B_6218_8FD0_884C_4E2D = false
local _____5DF2_6CE8_518C_5C01_5370_5B88_536B_6218_6B7B_4EA1_76D1_542C = false
____exports["创建封印守卫战下一波倒计时UI"] = function()
    _____6E05_7406_5C01_5370_5B88_536B_6218_4E0B_4E00_6CE2_5012_8BA1_65F6UI()
    _____5F53_524D_5C01_5370_5B88_536B_6218_4E0B_4E00_6CE2_5012_8BA1_65F6UI = _____521B_5EFA_4E16_754C_5750_6807_8FDB_5EA6UI({
        X = ____exports["封印能量核心位置"].X,
        Y = ____exports["封印能量核心位置"].Y,
        Z = 650,
        ["最大值"] = _____5C01_5370_5B88_536B_6218_6CE2_6B21_6700_5927_95F4_9694_79D2,
        ["当前值"] = 0,
        ["标题"] = "下一波来袭",
        ["数值后缀"] = "秒",
        ["类型"] = "危险",
        ["平滑过渡秒"] = 0.1,
        ["初始显示"] = false,
        ["雾中可见"] = false
    })
    if _____5F53_524D_5C01_5370_5B88_536B_6218_4E0B_4E00_6CE2_5012_8BA1_65F6UI == nil then
        return false
    end
    do
        local i = 0
        while i < #____exports["封印守卫战三路传送门位置表"] do
            local _____4F4D_7F6E = ____exports["封印守卫战三路传送门位置表"][i + 1]
            local _____8FDB_5EA6UI = _____521B_5EFA_4E16_754C_5750_6807_8FDB_5EA6UI({
                X = _____4F4D_7F6E.X,
                Y = _____4F4D_7F6E.Y,
                Z = 520,
                ["最大值"] = _____5C01_5370_5B88_536B_6218_6CE2_6B21_6700_5927_95F4_9694_79D2,
                ["当前值"] = 0,
                ["标题"] = "下一波来袭",
                ["数值后缀"] = "秒",
                ["类型"] = "危险",
                ["平滑过渡秒"] = 0.1,
                ["初始显示"] = false,
                ["雾中可见"] = false
            })
            if _____8FDB_5EA6UI == nil then
                _____6E05_7406_5C01_5370_5B88_536B_6218_4E0B_4E00_6CE2_5012_8BA1_65F6UI()
                return false
            end
            _____5F53_524D_5C01_5370_5B88_536B_6218_5237_65B0_70B9_4E0B_4E00_6CE2_5012_8BA1_65F6UI[#_____5F53_524D_5C01_5370_5B88_536B_6218_5237_65B0_70B9_4E0B_4E00_6CE2_5012_8BA1_65F6UI + 1] = _____8FDB_5EA6UI
            i = i + 1
        end
    end
    return #_____5F53_524D_5C01_5370_5B88_536B_6218_5237_65B0_70B9_4E0B_4E00_6CE2_5012_8BA1_65F6UI == #____exports["封印守卫战三路传送门位置表"]
end
local function _____66F4_65B0_5C01_5370_5B88_536B_6218_5012_8BA1_65F6()
    if not _____5355_4F4D_5B58_6D3B(_____5F53_524D_5C01_5370_80FD_91CF_6838_5FC3) then
        if _____5F53_524D_5C01_5370_5B88_536B_6218_8FD0_884C_4E2D then
            _____5904_7406_5C01_5370_5B88_536B_6218_5931_8D25()
        end
        _____505C_6B62_5C01_5370_5B88_536B_6218_5012_8BA1_65F6()
        return
    end
    local _____5F53_524D_65F6_95F4_6BEB_79D2 = getServerTime()
    local _____5269_4F59_79D2 = (_____5F53_524D_5C01_5370_5B88_536B_6218_7ED3_675F_65F6_95F4_6BEB_79D2 - _____5F53_524D_65F6_95F4_6BEB_79D2) / 1000
    if _____5269_4F59_79D2 < 0 then
        _____5269_4F59_79D2 = 0
    end
    _____66F4_65B0_4E16_754C_5750_6807_8FDB_5EA6UI(_____5F53_524D_5C01_5370_5B88_536B_6218_5012_8BA1_65F6UI, _____5269_4F59_79D2, true)
    if _____5F53_524D_5C01_5370_5B88_536B_6218_8FD0_884C_4E2D then
        _____63A8_8FDB_5C01_5370_5B88_536B_6218_6CE2_6B21(_____5F53_524D_65F6_95F4_6BEB_79D2)
        if _____5269_4F59_79D2 <= 0 then
            _____5904_7406_5C01_5370_5B88_536B_6218_5B88_62A4_65F6_9650()
        end
    end
end
____exports["创建封印守卫战锚点进度UI"] = function()
    _____6E05_7406_5C01_5370_5B88_536B_6218_951A_70B9_8FDB_5EA6UI()
    do
        local i = 0
        while i < #____exports["封印守卫战锚点位置表"] do
            local _____4F4D_7F6E = ____exports["封印守卫战锚点位置表"][i + 1]
            local _____8FDB_5EA6UI = _____521B_5EFA_4E16_754C_5750_6807_8FDB_5EA6UI({
                X = _____4F4D_7F6E.X,
                Y = _____4F4D_7F6E.Y,
                Z = 420,
                ["最大值"] = ____exports["封印守卫战锚点修复持续秒"],
                ["当前值"] = 0,
                ["标题"] = "修复锚点 " .. tostring(_____4F4D_7F6E["编号"]),
                ["数值后缀"] = "秒",
                ["类型"] = "奥术",
                ["平滑过渡秒"] = 0.1,
                ["初始显示"] = true,
                ["雾中可见"] = false
            })
            if _____8FDB_5EA6UI == nil then
                _____6E05_7406_5C01_5370_5B88_536B_6218_951A_70B9_8FDB_5EA6UI()
                return false
            end
            _____5F53_524D_5C01_5370_5B88_536B_6218_951A_70B9_8FDB_5EA6UI[i + 1] = _____8FDB_5EA6UI
            i = i + 1
        end
    end
    return true
end
____exports["更新封印守卫战锚点修复进度"] = function(_____951A_70B9_7F16_53F7, _____5F53_524D_79D2)
    local _____7D22_5F15 = _____951A_70B9_7F16_53F7 - 1
    if _____7D22_5F15 < 0 or _____7D22_5F15 >= #_____5F53_524D_5C01_5370_5B88_536B_6218_951A_70B9_8FDB_5EA6UI then
        return
    end
    local _____76EE_6807_79D2 = _____5F53_524D_79D2
    if _____76EE_6807_79D2 < 0 then
        _____76EE_6807_79D2 = 0
    end
    if _____76EE_6807_79D2 > ____exports["封印守卫战锚点修复持续秒"] then
        _____76EE_6807_79D2 = ____exports["封印守卫战锚点修复持续秒"]
    end
    _____5F53_524D_5C01_5370_5B88_536B_6218_951A_70B9_4FEE_590D_79D2_6570[_____7D22_5F15 + 1] = _____76EE_6807_79D2
    _____66F4_65B0_4E16_754C_5750_6807_8FDB_5EA6UI(_____5F53_524D_5C01_5370_5B88_536B_6218_951A_70B9_8FDB_5EA6UI[_____7D22_5F15 + 1], _____76EE_6807_79D2)
end
____exports["推进封印守卫战锚点修复进度"] = function(_____951A_70B9_7F16_53F7, _____7ECF_8FC7_79D2, _____6B63_5728_4FEE_590D)
    if not (_____7ECF_8FC7_79D2 > 0) then
        return
    end
    local _____7D22_5F15 = _____951A_70B9_7F16_53F7 - 1
    if _____7D22_5F15 < 0 or _____7D22_5F15 >= #_____5F53_524D_5C01_5370_5B88_536B_6218_951A_70B9_8FDB_5EA6UI then
        return
    end
    local _____53D8_5316_91CF = _____6B63_5728_4FEE_590D and _____7ECF_8FC7_79D2 or -_____7ECF_8FC7_79D2 * ____exports["封印守卫战锚点修复退回速度"]
    ____exports["更新封印守卫战锚点修复进度"](_____951A_70B9_7F16_53F7, _____5F53_524D_5C01_5370_5B88_536B_6218_951A_70B9_4FEE_590D_79D2_6570[_____7D22_5F15 + 1] + _____53D8_5316_91CF)
end
____exports["设置封印守卫战锚点进度显示"] = function(_____951A_70B9_7F16_53F7, _____662F_5426_663E_793A)
    local _____7D22_5F15 = _____951A_70B9_7F16_53F7 - 1
    if _____7D22_5F15 < 0 or _____7D22_5F15 >= #_____5F53_524D_5C01_5370_5B88_536B_6218_951A_70B9_8FDB_5EA6UI then
        return
    end
    _____8BBE_7F6E_4E16_754C_5750_6807_8FDB_5EA6UI_663E_793A(_____5F53_524D_5C01_5370_5B88_536B_6218_951A_70B9_8FDB_5EA6UI[_____7D22_5F15 + 1], _____662F_5426_663E_793A)
end
local function ____on_5C01_5370_5B88_536B_6218_5355_4F4D_6B7B_4EA1(dyingUnit, _killingUnit)
    if not _____5F53_524D_5C01_5370_5B88_536B_6218_8FD0_884C_4E2D then
        return
    end
    if dyingUnit == _____5F53_524D_5C01_5370_80FD_91CF_6838_5FC3 then
        _____5904_7406_5C01_5370_5B88_536B_6218_5931_8D25()
        return
    end
    do
        local i = #_____5F53_524D_5C01_5370_5B88_536B_6218_654C_4EBA_5217_8868 - 1
        while i >= 0 do
            if _____5F53_524D_5C01_5370_5B88_536B_6218_654C_4EBA_5217_8868[i + 1] == dyingUnit then
                __TS__ArraySplice(_____5F53_524D_5C01_5370_5B88_536B_6218_654C_4EBA_5217_8868, i, 1)
            end
            i = i - 1
        end
    end
end
local function _____786E_4FDD_5C01_5370_5B88_536B_6218_6B7B_4EA1_76D1_542C()
    if _____5DF2_6CE8_518C_5C01_5370_5B88_536B_6218_6B7B_4EA1_76D1_542C then
        return
    end
    _____5DF2_6CE8_518C_5C01_5370_5B88_536B_6218_6B7B_4EA1_76D1_542C = true
    registerDeathListener(____on_5C01_5370_5B88_536B_6218_5355_4F4D_6B7B_4EA1)
end
____exports["创建封印守卫战锚点闪电"] = function()
    _____6E05_7406_5C01_5370_5B88_536B_6218_951A_70B9_95EA_7535()
    do
        local i = 0
        while i < #____exports["封印守卫战锚点闪电连接表"] do
            do
                local _____914D_7F6E = ____exports["封印守卫战锚点闪电连接表"][i + 1]
                local _____76EE_6807 = ____exports["封印守卫战锚点位置表"][_____914D_7F6E["锚点编号"]]
                if _____76EE_6807 == nil then
                    goto __continue102
                end
                local _____95EA_7535 = AddLightningEx(
                    _____914D_7F6E["代码"],
                    false,
                    _____914D_7F6E["能量源X"],
                    _____914D_7F6E["能量源Y"],
                    1700,
                    _____76EE_6807.X,
                    _____76EE_6807.Y,
                    _____76EE_6807.Z
                )
                if _____53E5_67C4_6709_6548(_____95EA_7535) then
                    _____5F53_524D_5C01_5370_5B88_536B_6218_951A_70B9_95EA_7535_5217_8868[#_____5F53_524D_5C01_5370_5B88_536B_6218_951A_70B9_95EA_7535_5217_8868 + 1] = _____95EA_7535
                end
            end
            ::__continue102::
            i = i + 1
        end
    end
end
____exports["创建封印守卫战锚点特效"] = function()
    ____exports["清理封印守卫战锚点特效"]()
    do
        local i = 0
        while i < #____exports["封印守卫战锚点位置表"] do
            local _____4F4D_7F6E = ____exports["封印守卫战锚点位置表"][i + 1]
            local _____7279_6548 = _____521B_5EFA_70B9_7279_6548({
                ["模型路径"] = _____5C01_5370_5B88_536B_6218_951A_70B9_6A21_578B,
                X = _____4F4D_7F6E.X,
                Y = _____4F4D_7F6E.Y,
                Z = _____4F4D_7F6E.Z,
                ["缩放"] = 1
            })
            if not _____53E5_67C4_6709_6548(_____7279_6548) then
                ____exports["清理封印守卫战锚点特效"]()
                return false
            end
            _____5F53_524D_5C01_5370_5B88_536B_6218_951A_70B9_7279_6548_5217_8868[#_____5F53_524D_5C01_5370_5B88_536B_6218_951A_70B9_7279_6548_5217_8868 + 1] = _____7279_6548
            i = i + 1
        end
    end
    return #_____5F53_524D_5C01_5370_5B88_536B_6218_951A_70B9_7279_6548_5217_8868 == #____exports["封印守卫战锚点位置表"]
end
____exports["创建封印守卫战三路传送门"] = function()
    ____exports["清理封印守卫战三路传送门"]()
    do
        local i = 0
        while i < #____exports["封印守卫战三路传送门位置表"] do
            local _____4F4D_7F6E = ____exports["封印守卫战三路传送门位置表"][i + 1]
            local _____7279_6548 = _____521B_5EFA_70B9_7279_6548({
                ["模型路径"] = _____5C01_5370_5B88_536B_6218_4F20_9001_95E8_6A21_578B,
                X = _____4F4D_7F6E.X,
                Y = _____4F4D_7F6E.Y,
                Z = 0,
                ["缩放"] = 1
            })
            if _____53E5_67C4_6709_6548(_____7279_6548) then
                _____5F53_524D_5C01_5370_5B88_536B_6218_4F20_9001_95E8_7279_6548_5217_8868[#_____5F53_524D_5C01_5370_5B88_536B_6218_4F20_9001_95E8_7279_6548_5217_8868 + 1] = _____7279_6548
            end
            i = i + 1
        end
    end
    return #_____5F53_524D_5C01_5370_5B88_536B_6218_4F20_9001_95E8_7279_6548_5217_8868 == #____exports["封印守卫战三路传送门位置表"]
end
____exports["清理封印守卫战"] = function()
    _____5F53_524D_5C01_5370_5B88_536B_6218_8FD0_884C_4E2D = false
    _____6E05_7406_5C01_5370_5B88_536B_6218_533A_57DF_97F3_4E50()
    _____6E05_7406_5C01_5370_5B88_536B_6218_654C_4EBA()
    ____exports["清理封印守卫战三路传送门"]()
    ____exports["清理封印能量核心与守护倒计时"]()
    _____5F53_524D_5C01_5370_5B88_536B_6218_4E0B_4E00_6CE2_7D22_5F15 = 0
    _____5F53_524D_5C01_5370_5B88_536B_6218_4E0B_6B21_76EE_6807_91CD_53D1_65F6_95F4_6BEB_79D2 = 0
end
____exports["创建封印能量核心与守护倒计时"] = function()
    ____exports["清理封印能量核心与守护倒计时"]()
    if not (_____5C01_5370_80FD_91CF_6838_5FC3_5355_4F4DID > 0) then
        return nil
    end
    local _____4F4D_7F6E = ____exports["封印能量核心位置"]
    local _____6838_5FC3 = _____521B_5EFA_5355_4F4D_5E76_767B_8BB0_6392_6CC4_5B89_5168(
        Player(_____4E2D_7ACB_88AB_52A8_73A9_5BB6ID),
        _____5C01_5370_80FD_91CF_6838_5FC3_5355_4F4DID,
        _____4F4D_7F6E.X,
        _____4F4D_7F6E.Y,
        _____4F4D_7F6E["朝向"]
    )
    if not _____5355_4F4D_5B58_6D3B(_____6838_5FC3) then
        return nil
    end
    _____5F53_524D_5C01_5370_80FD_91CF_6838_5FC3 = _____6838_5FC3
    X_FixUnitStandingSafe(_____6838_5FC3)
    _____6CE8_518C_5267_60C5_8FD0_884C_65F6_5355_4F4D("剧情运行时.封印守卫战能量核心", _____6838_5FC3)
    _____5F53_524D_5C01_5370_5B88_536B_6218_5012_8BA1_65F6UI = _____521B_5EFA_4E16_754C_5750_6807_8FDB_5EA6UI({
        X = _____4F4D_7F6E.X,
        Y = _____4F4D_7F6E.Y,
        Z = 520,
        ["最大值"] = ____exports["封印守卫战持续秒"],
        ["当前值"] = ____exports["封印守卫战持续秒"],
        ["标题"] = "守护封印核心",
        ["数值后缀"] = "秒",
        ["类型"] = "奥术",
        ["平滑过渡秒"] = 0.1,
        ["初始显示"] = true,
        ["雾中可见"] = false
    })
    if _____5F53_524D_5C01_5370_5B88_536B_6218_5012_8BA1_65F6UI == nil then
        ____exports["清理封印能量核心与守护倒计时"]()
        return nil
    end
    if not ____exports["创建封印守卫战锚点进度UI"]() then
        ____exports["清理封印能量核心与守护倒计时"]()
        return nil
    end
    if not ____exports["创建封印守卫战锚点特效"]() then
        ____exports["清理封印能量核心与守护倒计时"]()
        return nil
    end
    if not ____exports["创建封印守卫战下一波倒计时UI"]() then
        ____exports["清理封印能量核心与守护倒计时"]()
        return nil
    end
    ____exports["创建封印守卫战锚点闪电"]()
    _____5F53_524D_5C01_5370_5B88_536B_6218_7ED3_675F_65F6_95F4_6BEB_79D2 = getServerTime() + ____exports["封印守卫战持续秒"] * 1000
    _____5F53_524D_5C01_5370_5B88_536B_6218_5012_8BA1_65F6_5468_671FID = addPeriodicCallback(_____5C01_5370_5B88_536B_6218_5012_8BA1_65F6_5237_65B0_6BEB_79D2, _____66F4_65B0_5C01_5370_5B88_536B_6218_5012_8BA1_65F6)
    return _____6838_5FC3
end
____exports["读取封印守卫战能量核心"] = function()
    return _____5F53_524D_5C01_5370_80FD_91CF_6838_5FC3
end
____exports["启动封印守卫战"] = function()
    if _____5F53_524D_5C01_5370_5B88_536B_6218_8FD0_884C_4E2D then
        return false
    end
    ____exports["清理封印守卫战"]()
    if not ____exports["创建封印守卫战三路传送门"]() then
        ____exports["清理封印守卫战三路传送门"]()
        return false
    end
    if not _____5355_4F4D_5B58_6D3B(____exports["创建封印能量核心与守护倒计时"]()) then
        ____exports["清理封印守卫战三路传送门"]()
        return false
    end
    _____5F53_524D_5C01_5370_5B88_536B_6218_8FD0_884C_4E2D = true
    _____5F53_524D_5C01_5370_5B88_536B_6218_5F00_59CB_65F6_95F4_6BEB_79D2 = getServerTime()
    _____5F53_524D_5C01_5370_5B88_536B_6218_4E0B_4E00_6CE2_7D22_5F15 = 0
    _____5F53_524D_5C01_5370_5B88_536B_6218_4E0B_6B21_76EE_6807_91CD_53D1_65F6_95F4_6BEB_79D2 = 0
    _____542F_7528_5C01_5370_5B88_536B_6218_533A_57DF_97F3_4E50()
    _____786E_4FDD_5C01_5370_5B88_536B_6218_6B7B_4EA1_76D1_542C()
    return true
end
____exports["执行启动封印守卫战"] = function(______53C2_6570)
    local _____5F53_524D_8FDB_5EA6 = _____8BFB_53D6_5267_60C5_8FDB_5EA6()
    if _____5F53_524D_8FDB_5EA6 ~= 48 and _____5F53_524D_8FDB_5EA6 ~= 49 then
        return
    end
    local _____5DF2_542F_52A8 = ____exports["启动封印守卫战"]()
    if _____5DF2_542F_52A8 and _____5F53_524D_8FDB_5EA6 == 48 then
        _____8FDB_5165_4E3B_7EBF_8282_70B9(49)
    end
end
____exports["执行清理封印守卫战"] = function(______53C2_6570)
    ____exports["清理封印守卫战"]()
end
____exports["封印守卫战剧情动作注册表"] = {["第三章_启动封印守卫战"] = ____exports["执行启动封印守卫战"], ["第三章_清理封印守卫战"] = ____exports["执行清理封印守卫战"]}
return ____exports
