/** @noSelfInFile */

import type { 战斗启动属性配置 } from "../00．配置类型";
import { 默认Boss弱点数量基础值 } from "../00．配置类型";

export const 单位N05K战斗启动属性配置: 战斗启动属性配置 = {
    归类: "英雄Boss",
    单位ID: "N05K",
    单位名: "杀戮食人魔",
    战斗音乐变量名: "gg_snd_battleBgm003",
    胜利音乐变量名: "gg_snd_shengliBgm",
    地点变量名: "gg_rct______________047",
    魔抗: 0.30,
    暴击率: 0.30,
    暴击伤害: 0.25,
    伤害吸血: 0.60,
    弱点数量基础值: 默认Boss弱点数量基础值,
    弱点数量每层N增量: 0,
    天生弱点数: 2,
    弓弱: true,
    光弱: true,
    器弱伤害需求生命百分比: 0.03,
    护盾基础值: 8,
    护盾每层N增量: 2,
  };
