/** @noSelfInFile */

import type { 战斗启动属性配置 } from "../00．配置类型";
import { 默认Boss弱点数量基础值 } from "../00．配置类型";

export const 单位N00U战斗启动属性配置: 战斗启动属性配置 = {
  归类: "英雄Boss",
  单位ID: "N00U",
  单位名: "双重凤凰·菲尼克斯尔",
  战斗音乐变量名: "gg_snd_battleBoss3",
  胜利音乐变量名: "gg_snd_shengliBgm2",
  转换场景: true,
  BS移动X轴: 944,
  BS移动Y轴: -9856,
  玩家移动X轴: 944,
  玩家移动Y轴: -10756,
  魔抗: 0.45,
  眩晕抗性: 0.50,
  命中率: 0.25,
  闪避率: 0.18,
  冰弱: true,
  暗弱: true,
  器弱伤害需求生命百分比: 0.03,
  弱点数量基础值: 默认Boss弱点数量基础值,
  弱点数量每层N增量: 0,
  天生弱点数: 2,
  护盾基础值: 12,
  护盾每层N增量: 2,
};
