--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____03_FF0E_53D7_51FB_53CD_5E94_89C2_5BDF = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.09．地精祭祀.03．受击反应观察")
local _____6CE8_518C_5730_7CBE_796D_7940_53D7_51FB_53CD_5E94_89C2_5BDF = ____03_FF0E_53D7_51FB_53CD_5E94_89C2_5BDF["注册地精祭祀受击反应观察"]
local ____04_FF0E_7834_574F_6B7B_5149 = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.09．地精祭祀.04．破坏死光")
local _____6CE8_518C_5730_7CBE_796D_7940_7834_574F_6B7B_5149 = ____04_FF0E_7834_574F_6B7B_5149["注册地精祭祀破坏死光"]
local ____05_FF0E_8840_7206 = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.09．地精祭祀.05．血爆")
local _____6CE8_518C_5730_7CBE_796D_7940_8840_7206 = ____05_FF0E_8840_7206["注册地精祭祀血爆"]
local ____06_FF0E_6BD2_8574 = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.09．地精祭祀.06．毒蕴")
local _____6CE8_518C_5730_7CBE_796D_7940_6BD2_8574 = ____06_FF0E_6BD2_8574["注册地精祭祀毒蕴"]
local _____5730_7CBE_796D_7940_6280_80FD_7ED3_6784_5DF2_6CE8_518C = false
____exports["注册地精祭祀技能结构"] = function()
    if _____5730_7CBE_796D_7940_6280_80FD_7ED3_6784_5DF2_6CE8_518C then
        return
    end
    _____5730_7CBE_796D_7940_6280_80FD_7ED3_6784_5DF2_6CE8_518C = true
    _____6CE8_518C_5730_7CBE_796D_7940_53D7_51FB_53CD_5E94_89C2_5BDF()
    _____6CE8_518C_5730_7CBE_796D_7940_7834_574F_6B7B_5149()
    _____6CE8_518C_5730_7CBE_796D_7940_8840_7206()
    _____6CE8_518C_5730_7CBE_796D_7940_6BD2_8574()
end
return ____exports
