--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
--- 背景框贴图数量（上 4 + 下 4）
____exports["贴图数量"] = 8
--- 文本段落数量
____exports["段落数量"] = 4
--- 每张贴图宽度
____exports["每张贴图宽度"] = 0.2
--- 每张贴图高度
____exports["每张贴图高度"] = 0.3053724
--- 上排贴图 Y 坐标
____exports["上排Y"] = 0.4473138
--- 下排贴图 Y 坐标
____exports["下排Y"] = 0.1526862
--- 段落 X 坐标
____exports["段落X"] = 0.309792
--- 段落 Y 间距
____exports["段落间距"] = 0.0882192
--- 段落宽度
____exports["段落宽度"] = 0.3741664
--- 段落高度
____exports["段落高度"] = 0.0882186
--- 字体文件路径
____exports["字体文件"] = "war3mapImported\\uizt.ttf"
--- 字体大小
____exports["字体大小"] = 1
--- 文字逐行显示间隔（毫秒）
____exports["文字间隔毫秒"] = 1660
--- 淡出动画间隔（毫秒）
____exports["淡出间隔毫秒"] = 30
--- 淡出总帧数（达到后隐藏）
____exports["淡出总帧数"] = 100
--- 最大透明度
____exports["最大透明度"] = 255
--- 异界背景框段落文字
____exports["异界段落文字"] = {"（未知的声音）来到此处旅者啊..", "既然选择接受试炼..", "准备迎接..", "来自异界之人的试炼吧！"}
--- 异界背景框第二句随机文字
____exports["异界第二句随机"] = {"既然选择接受试炼..", "既然拥有这份勇气"}
return ____exports
