/** @noSelfInFile */

export const Boss死亡结算提示文本 = {
  水触须全员奖励: "|cffffff00『系统提示』：|r|cffffffcc所有玩家额外获得500经验和2点全属性奖励|r",
  奇妙鹿全员奖励: "|cffffff00『系统提示』：|r|cffffffcc所有玩家额外获得3点全属性奖励|r",
  驱散灵树邪气奖励: "|cffffff00『系统提示』：|r|cffffffcc『驱散灵树邪气』全体魔法恢复+1，智力+1！|r",
  史莱姆宝箱提示: "|cffffff00『系统提示』：|r|cffffffcc请选择一个『物品』作为击杀奖励（全队只有一次）|r",
  豺狼异变完成奖励: "|cffffff00『系统提示』：|r|cffffffcc完成了『协助调查异端』，奖励击杀者2本学识书|r",
  嗜血兽人宝箱提示: "|cffffff00『系统提示』：|r|cffffffcc请选择一个『物品』作为击杀Boss奖励（全队只有一次）|r",
  嗜血兽人低等级奖励: "|cffffff00『系统提示』：|r|cffffffcc成功17级以下击杀，获得额外5000金币奖励！|r",
  水龙蛇攻击力奖励: "|cffffff00『系统提示』：|r|cffffffcc所有玩家额外获得18点攻击力奖励！|r",
  沙漠Boss宝箱提示: "|cffffff00『系统提示』：|r|cffffffcc请选择一个『物品』作为击杀Boss奖励（全队只有一次）|r",
} as const;

export const Boss死亡结算宝箱备注 = {
  e070: "宝箱 通用",
  e06X: "宝箱 水底",
  e06Z: "宝箱 沙漠",
} as const;

export const Boss死亡结算特殊逻辑标签 = {
  豺狼异变累计: "豺狼异变累计",
  沙漠宝藏击杀者非中立: "沙漠宝藏击杀者非中立",
  变异蜥蜴剧情承接: "变异蜥蜴剧情承接",
  嗜血兽人低等级击杀奖励: "嗜血兽人低等级击杀奖励",
  灵毒王蛇清场聚灵花: "灵毒王蛇清场聚灵花",
  沙漠食人魔一阶段转二阶段: "沙漠食人魔一阶段转二阶段",
} as const;
