--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____00_FF0E_5E38_91CF = require("系统.11．剧情系统.02．支线任务.04．莫尔特斯.00．常量")
local _____83AB_5C14_7279_65AFBoss_5355_4F4DID = ____00_FF0E_5E38_91CF["莫尔特斯Boss单位ID"]
local _____83AB_5C14_7279_65AF_4EFB_52A1ID = ____00_FF0E_5E38_91CF["莫尔特斯任务ID"]
local ____01_FF0E_4EFB_52A1_8FD0_884C = require("系统.11．剧情系统.02．支线任务.04．莫尔特斯.01．任务运行")
local _____63A5_53D7_83AB_5C14_7279_65AF_4EFB_52A1_540E_521D_59CB_5316_6218_573A = ____01_FF0E_4EFB_52A1_8FD0_884C["接受莫尔特斯任务后初始化战场"]
local _____5B8C_6210_83AB_5C14_7279_65AF_4EFB_52A1_540E_6253_5F00_9996_9886_5956_52B1 = ____01_FF0E_4EFB_52A1_8FD0_884C["完成莫尔特斯任务后打开首领奖励"]
____exports["莫尔特斯NPC配置列表"] = {{
    ["NPC名称"] = "术法长老-赫克提尔",
    ["任务ID"] = _____83AB_5C14_7279_65AF_4EFB_52A1ID,
    ["NPC配置名"] = "古木之蚀·莫尔特斯",
    ["单位ID"] = "e020",
    ["类型"] = "任务",
    ["自动创建"] = false,
    ["启用"] = false
}}
____exports["莫尔特斯任务配置列表"] = {{
    ["任务ID"] = _____83AB_5C14_7279_65AF_4EFB_52A1ID,
    ["名称"] = "|cff66cc66古木之蚀·莫尔特斯|r（|cffff0000隐藏Boss战任务|r）",
    ["类型"] = "目标击杀",
    ["开始NPC"] = "术法长老-赫克提尔",
    ["目标单位"] = _____83AB_5C14_7279_65AFBoss_5355_4F4DID,
    ["需求数量"] = 1,
    ["接取条件"] = "英雄等级＞40",
    ["奖励"] = "完成任务的玩家+1能量碎片",
    ["奖励显示"] = "完成任务的玩家+1能量碎片;莫尔特斯首领战利品（任选2件）",
    ["描述"] = "穿过赫克提尔开启的裂隙，前往被封锁的古老林地，终结侵入根系的腐败与古老守卫莫尔特斯。",
    ["进度文本"] = "击败古木之蚀·莫尔特斯 N/1",
    ["NPC开始对白"] = "NPC：旧山谷的根系正在枯黑，腐败已经沿着地脉向精灵城蔓延。\nPlayer：腐败的源头在哪里？\nNPC：在一片被封锁的古老林地。莫尔特斯曾是那里的守护者，长久看守山谷与森林。\nNPC：可泄露的黑暗力量污染了他的躯体，也扭曲了他的意志。如今他已成为侵蚀本身的一部分。\nPlayer：如果放任下去，整片森林都会被拖进腐朽。\nNPC：正是如此。我能在术法协会旁稳定一道裂隙，送你们进入封锁区。请终结这场侵蚀。",
    ["任务接受对白"] = "Player：我会进入裂隙，斩断腐败的源头。\nNPC：裂隙已经稳定。穿过紫色传送门后沿着枯萎的根系前进，莫尔特斯就在林地深处。\nNPC：不要被他残存的守护者外表迷惑，那股黑暗力量早已让他无法回头。",
    ["接取后动作"] = _____63A5_53D7_83AB_5C14_7279_65AF_4EFB_52A1_540E_521D_59CB_5316_6218_573A,
    ["接取失败对白"] = "NPC：那片林地的腐败足以吞噬意志薄弱者。等你拥有更强的力量后再来（英雄等级＞40）。",
    ["NPC完成对白"] = "NPC：地脉中的污浊正在消退……你们成功了。\nPlayer：莫尔特斯已经倒下，封锁区里的根系也开始恢复。\nNPC：他曾守护那片山谷，如今至少不必再被腐败驱使。请收下这些战利品，也替森林记住他最后的名字。",
    ["完成后对白"] = "默认",
    ["完成后动作"] = _____5B8C_6210_83AB_5C14_7279_65AF_4EFB_52A1_540E_6253_5F00_9996_9886_5956_52B1,
    ["可重复"] = false,
    ["启用"] = true
}}
return ____exports
