--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
____exports["剧情物品掉落配置表"] = {{["配置ID"] = "黑暗魔法女王_暗狱之书", ["触发单位名"] = "黑暗魔法女王", ["动作列表"] = {{["动作类型"] = "掉落物品", ["物品名"] = "|cffcc99ff暗狱之书|r", ["掉落概率"] = 10, ["屏蔽条件"] = "德鲁伊学者属于中立被动"}}}, {["配置ID"] = "地精剑客_地精钥匙", ["触发单位名"] = "地精剑客", ["动作列表"] = {{["动作类型"] = "掉落物品", ["物品名"] = "地精钥匙", ["要求剧情进度至少"] = 1}}}, {["配置ID"] = "熔岩恶魔_开启大门", ["触发单位名"] = "熔岩恶魔", ["动作列表"] = {{["动作类型"] = "开启大门", ["大门全局名列表"] = {"gg_dest_ATg3_10381", "gg_dest_B00J_10382"}}}}, {["配置ID"] = "恶魔看守者_死亡开门", ["触发单位名"] = "恶魔看守者|cffff0000（Boss，无等级限制）|r", ["动作列表"] = {{["动作类型"] = "开启大门", ["大门全局名列表"] = {"gg_dest_B00M_13602"}}, {["动作类型"] = "电影消息", ["消息发言名"] = "？？？", ["消息文本"] = "（远处的声音）不错，你们几个小鬼的实力得到了我的认可，进来吧！", ["持续时间"] = 10}}}}
return ____exports
