/** @noSelfInFile */

import { 取最大生命, 开始通用护盾, 第二章后段Boss战利品装备名 } from "../../../03．技能系统/00．技能模板+函数/01．技能函数/20．物品辅助/07．装备辅助";
import { 创建伤害修正阈值触发 } from "../../../03．技能系统/00．技能模板+函数/04．机制组件/09．装备通用机制/13．伤害修正阈值触发";

创建伤害修正阈值触发({
  名称: "神风护体披风",
  装备名: 第二章后段Boss战利品装备名.神风护体披风,
  最大生命比例阈值: 0.12,
  冷却秒数: 14,
  冷却前缀: "第二章后段Boss战利品",
  伤害倍率: 0.68,
  优先级: 26,
  on触发: function on神风护体披风触发(this: void, event): void {
    const target = event.单位;
    开始通用护盾(target, target, 500 + 取最大生命(target) * 0.1, 5, "神风护体披风");
  },
});

export {};
