/** @noSelfInFile */

import { 取最大生命, 开始通用护盾, 临时玩家属性, 第二章后段Boss战利品装备名 } from "../../../03．技能系统/00．技能模板+函数/01．技能函数/20．物品辅助/07．装备辅助";
import { 创建伤害修正阈值触发 } from "../../../03．技能系统/00．技能模板+函数/04．机制组件/09．装备通用机制";

创建伤害修正阈值触发({
  名称: "莫尔特斯树皮盾",
  装备名: 第二章后段Boss战利品装备名.莫尔特斯树皮盾,
  最大生命比例阈值: 0.13,
  冷却秒数: 18,
  冷却前缀: "第二章后段Boss战利品",
  伤害倍率: 0.82,
  优先级: 27,
  on触发: function on莫尔特斯树皮盾触发(this: void, event): void {
    const target = event.单位;
    开始通用护盾(target, target, 600 + 取最大生命(target) * 0.1, 6, "莫尔特斯树皮盾");
    临时玩家属性(target, "木属性抗性", 0.12, 6);
    临时玩家属性(target, "暗属性抗性", 0.12, 6);
  },
});

export {};
