/** @noSelfInFile */
import { 注册持有战斗周期模板 } from '../../../03．技能系统/00．技能模板+函数/00．技能模板/08．装备触发模板/04．持有战斗周期模板';
import { 创建单位驻留进度 } from '../../../03．技能系统/00．技能模板+函数/04．机制组件/09．装备通用机制/28．单位驻留进度';
import {
    取装备物品ID,
    临时玩家属性,
    播放单位特效,
    四Boss战利品装备名,
    四Boss装备特效,
} from '../../../03．技能系统/00．技能模板+函数/01．技能函数/20．物品辅助/07．装备辅助';
const 驻留进度 = 创建单位驻留进度('最后阵地重铠', 160);
注册持有战斗周期模板({
    名称: '最后阵地重铠',
    物品类型ID: 取装备物品ID(四Boss战利品装备名.最后阵地重铠),
    周期秒: 1,
    on丢弃(event): void {
        驻留进度.清空(event.单位);
    },
    on周期(event): void {
        const u = event.单位;
        if (驻留进度.采样(u) >= 3) {
            临时玩家属性(u, '护甲', 18, 2.2);
            临时玩家属性(u, '物理抗性', 0.12, 2.2);
            临时玩家属性(u, '控制抗性', 0.2, 2.2);
            播放单位特效(四Boss装备特效.安魂范围, u, 'origin', 2.2, 0.35);
        }
    },
});
export {};
