/** @noSelfInFile */
import { 注册不同技能伤害序列触发模板 } from '../../../03．技能系统/00．技能模板+函数/00．技能模板/08．装备触发模板/06．不同技能伤害序列触发模板';
import {
    取攻击力,
    造成装备伤害,
    播放单位特效,
    四Boss战利品装备名,
    四Boss装备特效,
    装备伤害类型,
} from '../../../03．技能系统/00．技能模板+函数/01．技能函数/20．物品辅助/07．装备辅助';
注册不同技能伤害序列触发模板({
    名称: '旧誓残响徽记',
    装备名: 四Boss战利品装备名.旧誓残响徽记,
    需要不同技能数: 3,
    时间窗毫秒: 10000,
    作用域: '主体',
    重复策略: '忽略',
    触发时机: '达成时',
    on触发: (e) => {
        播放单位特效(四Boss装备特效.英魂出现, e.目标, 'origin', 0.8, 0.7);
        造成装备伤害(e.攻击者, e.目标, 取攻击力(e.攻击者) * 0.9, 装备伤害类型.魔法, false, undefined, {
            装备技能类型: '装备被动',
            标签: '旧誓残响',
            伤害形态: '单体',
        });
        播放单位特效(四Boss装备特效.英魂消散, e.目标, 'origin', 1, 0.35);
    },
});
export {};
