/** @noSelfInFile */
import { 注册最终伤害触发模板 } from '../../../03．技能系统/00．技能模板+函数/00．技能模板/08．装备触发模板';
import {
    取当前生命,
    取最大生命,
    临时玩家属性,
    播放单位特效,
    四Boss战利品装备名,
    四Boss装备特效,
} from '../../../03．技能系统/00．技能模板+函数/01．技能函数/20．物品辅助/07．装备辅助';
const { SFB_setSlow } = require('lib.扩展函数.Star扩展函数.Star扩展库.04A．快速Buff共享') as any;
注册最终伤害触发模板({
    名称: '裂誓战躯重铠-残誓不退',
    装备名: 四Boss战利品装备名.裂誓战躯重铠,
    持有者: '受击者',
    冷却秒数: 45,
    自定义过滤: (e) => 取当前生命(e.持有者) / 取最大生命(e.持有者) <= 0.35,
    on触发(e): void {
        临时玩家属性(e.持有者, '物理抗性', 0.25, 6);
        临时玩家属性(e.持有者, '魔法抗性', 0.18, 6);
        临时玩家属性(e.持有者, '控制抗性', 0.4, 6);
        SFB_setSlow(e.持有者, e.持有者, 0, 0.25, 6);
        播放单位特效(四Boss装备特效.誓盾, e.持有者, 'origin', 6, 0.32);
    },
});
export {};
