/** @noSelfInFile */
import { 创建重复伤害类型适应 } from '../../../03．技能系统/00．技能模板+函数/04．机制组件/09．装备通用机制/29．重复伤害类型适应';
import {
    播放单位特效,
    四Boss战利品装备名,
    四Boss装备特效,
} from '../../../03．技能系统/00．技能模板+函数/01．技能函数/20．物品辅助/07．装备辅助';
创建重复伤害类型适应({
    名称: '无面记忆面纱-记忆剥落',
    装备名: 四Boss战利品装备名.无面记忆面纱,
    记录持续秒: 6,
    重复伤害倍率: 0.7,
    冷却秒数: 10,
    过滤伤害: (c) => (c.isSkillDamage === true || c.isSkillAttack === true) && c.isEquipmentSkillDamage !== true,
    on适应: (e) => 播放单位特效(四Boss装备特效.灵魂崩解, e.单位, 'overhead', 1, 0.2),
});
export {};
