/** @noSelfInFile */

import { 注册巴尔扎罗斯熔核封印与护卫机制 } from "./04．熔核封印与护卫机制";
import { 注册巴尔扎罗斯护卫塞拉 } from "./02．护卫B塞拉/index";
import { 注册巴尔扎罗斯恶魔咆哮波 } from "./07．恶魔咆哮波";
import { 注册巴尔扎罗斯王者天罚 } from "./08．王者天罚";
import { 注册巴尔扎罗斯熔岩喷发 } from "./09．熔岩喷发";
import { 注册巴尔扎罗斯火焰锁链 } from "./10．火焰锁链";
import { 注册巴尔扎罗斯地核召唤 } from "./11．地核召唤";
import { 注册巴尔扎罗斯熔岩护盾 } from "./12．熔岩护盾";
import { 注册巴尔扎罗斯末日熔爆 } from "./13．末日熔爆";
import { 注册巴尔扎罗斯冷却水晶 } from "./18．冷却水晶";

export function 注册巴尔扎罗斯技能结构(this: void): void {
  注册巴尔扎罗斯熔核封印与护卫机制();
  注册巴尔扎罗斯护卫塞拉();
  注册巴尔扎罗斯恶魔咆哮波();
  注册巴尔扎罗斯王者天罚();
  注册巴尔扎罗斯熔岩喷发();
  注册巴尔扎罗斯火焰锁链();
  注册巴尔扎罗斯地核召唤();
  注册巴尔扎罗斯熔岩护盾();
  注册巴尔扎罗斯末日熔爆();
  注册巴尔扎罗斯冷却水晶();
}
