--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____05_FF0E_7D27_51D1_5267_60C5_7247_6BB5_7F16_8BD1 = require("系统.11．剧情系统.01．主线任务.00．剧情系统核心工具.05．紧凑剧情片段编译")
local _____7F16_8BD1_7D27_51D1_5267_60C5_7247_6BB5 = ____05_FF0E_7D27_51D1_5267_60C5_7247_6BB5_7F16_8BD1["编译紧凑剧情片段"]
____exports["恶魔城初至与神秘呼唤紧凑剧情片段"] = {
    ["片段ID"] = "molten_realm_demon_city_call",
    ["名称"] = "恶魔城初至与神秘呼唤",
    ["触发条件"] = "剧情进度 == 37 且玩家进入恶魔城外围",
    ["可Esc整段跳过"] = true,
    ["默认倍速"] = 1,
    ["默认对白持续时间"] = 3,
    ["对白列表"] = {
        {["序号"] = 1, ["说话者"] = "玩家", ["文本"] = "这里就是恶魔城……不同种类的恶魔竟然生活在同一座城里，而且没有彼此厮杀。", ["持续时间"] = 6},
        {["序号"] = 2, ["说话者"] = "玩家", ["文本"] = "先收起武器。镇长说过，这里有自己的规矩，我们不是来与整座城市开战的。", ["持续时间"] = 5},
        {["序号"] = 3, ["说话者"] = "神秘声音", ["文本"] = "远方的朋友……既然已经来到我的城中，便来我这里吧。", ["持续时间"] = 5.2},
        {["序号"] = 4, ["说话者"] = "玩家", ["文本"] = "声音直接传进了意识……他早就知道我们会来。", ["持续时间"] = 3.8},
        {["序号"] = 5, ["说话者"] = "玩家", ["文本"] = "没有必要在城中盲目搜查。先去见声音的主人，看看他究竟想告诉我们什么。", ["持续时间"] = 5.2}
    },
    ["动作时间线"] = {{
        ["序号"] = 1,
        ["挂点"] = "beforeDialog",
        ["对白序号"] = 1,
        ["动作ID"] = "剧情.设置非Boss复活点",
        ["名称"] = "切换恶魔城非Boss复活点",
        ["跳过也执行"] = true,
        ["参数"] = {["复活点键"] = "恶魔城"}
    }, {
        ["序号"] = 2,
        ["挂点"] = "afterDialog",
        ["对白序号"] = 5,
        ["动作ID"] = "主线.进入节点",
        ["名称"] = "进入恶魔城领主会面节点",
        ["参数"] = {["节点进度"] = 38}
    }}
}
____exports["恶魔城初至与神秘呼唤剧情片段"] = _____7F16_8BD1_7D27_51D1_5267_60C5_7247_6BB5(____exports["恶魔城初至与神秘呼唤紧凑剧情片段"])
return ____exports
