local ____lualib = require("lualib_bundle")
local __TS__ObjectAssign = ____lualib.__TS__ObjectAssign
local ____exports = {}
local ____01B_FF0EBoss_6218_6597_533A_57DF_914D_7F6E_8868 = require("系统.07．地形系统.09．动态矩形区域注册表.01B．Boss战斗区域配置表")
local ____Boss_6218_6597_533A_57DF_914D_7F6E_8868 = ____01B_FF0EBoss_6218_6597_533A_57DF_914D_7F6E_8868["Boss战斗区域配置表"]
--- 地图编辑器预置 gg_rct 的唯一语义登记表。
-- 这里只保存变量名，不创建或销毁地图矩形句柄。
____exports["地图预设矩形区域配置表"] = __TS__ObjectAssign({}, ____Boss_6218_6597_533A_57DF_914D_7F6E_8868, {
    ["沙漠区域.区域1"] = {["名称"] = "沙漠区域.区域1", ["分类"] = "场地区域", ["地图矩形变量名"] = "gg_rct______________055"},
    ["沙漠区域.区域3"] = {["名称"] = "沙漠区域.区域3", ["分类"] = "场地区域", ["地图矩形变量名"] = "gg_rct______________083"},
    ["英雄选择区域"] = {["名称"] = "英雄选择区域", ["分类"] = "其他", ["地图矩形变量名"] = "gg_rct___________________YXXZ"},
    ["精沙战斧.沙漠区域1"] = {["名称"] = "精沙战斧.沙漠区域1", ["分类"] = "其他", ["矩形区域名称列表"] = {
        "沙漠绿洲",
        "沙漠区域.区域1",
        "沙漠区域.区域3",
        "悲风山谷",
        "沙漠区域.Boss战区域"
    }, ["说明"] = "精沙战斧的沙漠区域；覆盖沙漠绿洲、沙漠区域1、沙漠区域3、悲风山谷及沙漠区域Boss战区域"},
    ["怪物刷新区域"] = {["名称"] = "怪物刷新区域", ["分类"] = "其他", ["地图矩形变量名"] = "gg_rct_____________u"}
})
____exports["读取地图预设矩形区域配置"] = function(_____540D_79F0)
    return ____exports["地图预设矩形区域配置表"][_____540D_79F0]
end
return ____exports
