--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
____exports["死灵盗贼奖励池ID"] = "boss.death.死灵盗贼"
____exports["死灵盗贼首领奖励池配置"] = {["奖励池ID"] = ____exports["死灵盗贼奖励池ID"], ["标题"] = "死灵盗贼战利品选择", ["可选数量"] = 1, ["选项"] = {{
    ["装备名"] = "黄金沙裤",
    ["排序"] = 1,
    ["图标"] = "",
    ["描述"] = "击败 Boss 后出现的战利品，具体属性以装备数据为准。",
    ["特效"] = "该奖励的属性、评分与装备效果由装备数据表统一提供。"
}, {
    ["装备名"] = "暴金沙裤",
    ["排序"] = 2,
    ["图标"] = "",
    ["描述"] = "击败 Boss 后出现的战利品，具体属性以装备数据为准。",
    ["特效"] = "该奖励的属性、评分与装备效果由装备数据表统一提供。"
}, {
    ["装备名"] = "幽暗沙裤",
    ["排序"] = 3,
    ["图标"] = "",
    ["描述"] = "击败 Boss 后出现的战利品，具体属性以装备数据为准。",
    ["特效"] = "该奖励的属性、评分与装备效果由装备数据表统一提供。"
}}}
return ____exports
