--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
____exports["主线_杀戮食人魔奖励池ID"] = "boss.death.主线_杀戮食人魔"
____exports["主线_杀戮食人魔首领奖励池配置"] = {["奖励池ID"] = ____exports["主线_杀戮食人魔奖励池ID"], ["标题"] = "主线_杀戮食人魔战利品选择", ["可选数量"] = 1, ["选项"] = {{
    ["装备名"] = "烈魔之裤",
    ["排序"] = 1,
    ["图标"] = "",
    ["描述"] = "击败 Boss 后出现的战利品，具体属性以装备数据为准。",
    ["特效"] = "该奖励的属性、评分与装备效果由装备数据表统一提供。"
}, {
    ["装备名"] = "烈凯肩甲",
    ["排序"] = 2,
    ["图标"] = "",
    ["描述"] = "击败 Boss 后出现的战利品，具体属性以装备数据为准。",
    ["特效"] = "该奖励的属性、评分与装备效果由装备数据表统一提供。"
}, {
    ["装备名"] = "沙烈魔斧",
    ["排序"] = 3,
    ["图标"] = "",
    ["描述"] = "击败 Boss 后出现的战利品，具体属性以装备数据为准。",
    ["特效"] = "该奖励的属性、评分与装备效果由装备数据表统一提供。"
}}}
return ____exports
