--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
____exports["地精祭祀奖励池ID"] = "boss.death.主线_地精祭祀"
____exports["主线_地精祭祀战利品配置"] = {["奖励池ID"] = ____exports["地精祭祀奖励池ID"], ["标题"] = "地精祭祀战利品选择", ["可选数量"] = 1, ["选项"] = {{
    ["装备名"] = "邪恶之心（死亡掉落）",
    ["排序"] = 1,
    ["图标"] = "ReplaceableTextures\\CommandButtons\\BTN000008.blp",
    ["描述"] = "从地精祭坛中取出的危险灵魂核心，蕴含强烈的攻击与生命力量。",
    ["特效"] = "邪恶反噬：每秒损失10点生命值和最大生命值的1%；最大生命值低于1400或当前生命值低于300时，持有者会死亡。"
}, {
    ["装备名"] = "|cff993366祭祀面具（唯一）|r",
    ["排序"] = 2,
    ["图标"] = "ReplaceableTextures\\CommandButtons\\BTN000127.blp",
    ["描述"] = "地精祭祀遗留下来的诅咒面具，增强智力，却会持续吞噬魔力。",
    ["特效"] = "魔力吞噬：每秒损失10点魔法值和最大魔法值的1%；最大魔法值低于1250或当前魔法值低于250时，持有者会死亡。"
}, {
    ["装备名"] = "祭祀之杖",
    ["排序"] = 3,
    ["图标"] = "ReplaceableTextures\\CommandButtons\\BTN000085.blp",
    ["描述"] = "凝聚祭火力量的法杖，能以生命为代价释放破坏死光。",
    ["特效"] = "破坏死光：消耗100点魔法值与200点生命值，对目标造成300点魔法伤害。"
}}}
return ____exports
