--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____00_FF0E_7C7B_578B_5B9A_4E49 = require("系统.02．物品系统.18．首领奖励选择.00．类型定义")
local _____9996_9886_5956_52B1_6700_591A_9009_9879_6570 = ____00_FF0E_7C7B_578B_5B9A_4E49["首领奖励最多选项数"]
local _____9996_9886_5956_52B1_6700_5C11_9009_9879_6570 = ____00_FF0E_7C7B_578B_5B9A_4E49["首领奖励最少选项数"]
local ____01_FF0E_745F_5170_8FEA_5C14_7684_6267_6CD5_9057_7269 = require("系统.02．物品系统.18．首领奖励选择.01．奖励配置表.01．瑟兰迪尔的执法遗物")
local _____745F_5170_8FEA_5C14_7684_6267_6CD5_9057_7269_914D_7F6E = ____01_FF0E_745F_5170_8FEA_5C14_7684_6267_6CD5_9057_7269["瑟兰迪尔的执法遗物配置"]
local ____02_FF0E_53F2_83B1_59C6_6218_5229_54C1 = require("系统.02．物品系统.18．首领奖励选择.01．奖励配置表.02．史莱姆战利品")
local _____53F2_83B1_59C6_9996_9886_5956_52B1_6C60_914D_7F6E = ____02_FF0E_53F2_83B1_59C6_6218_5229_54C1["史莱姆首领奖励池配置"]
local ____03_FF0E_6C99_6F20_5B9D_85CF_6218_5229_54C1 = require("系统.02．物品系统.18．首领奖励选择.01．奖励配置表.03．沙漠宝藏战利品")
local _____6C99_6F20_5B9D_85CF_9996_9886_5956_52B1_6C60_914D_7F6E = ____03_FF0E_6C99_6F20_5B9D_85CF_6218_5229_54C1["沙漠宝藏首领奖励池配置"]
local ____04_FF0E_55DC_8840_517D_4EBA_6218_5229_54C1 = require("系统.02．物品系统.18．首领奖励选择.01．奖励配置表.04．嗜血兽人战利品")
local _____55DC_8840_517D_4EBA_9996_9886_5956_52B1_6C60_914D_7F6E = ____04_FF0E_55DC_8840_517D_4EBA_6218_5229_54C1["嗜血兽人首领奖励池配置"]
local ____05_FF0E_6C34_9F99_86C7_6218_5229_54C1 = require("系统.02．物品系统.18．首领奖励选择.01．奖励配置表.05．水龙蛇战利品")
local _____6C34_9F99_86C7_9996_9886_5956_52B1_6C60_914D_7F6E = ____05_FF0E_6C34_9F99_86C7_6218_5229_54C1["水龙蛇首领奖励池配置"]
local ____06_FF0E_8718_86DB_5973_7687_6218_5229_54C1 = require("系统.02．物品系统.18．首领奖励选择.01．奖励配置表.06．蜘蛛女皇战利品")
local _____8718_86DB_5973_7687_9996_9886_5956_52B1_6C60_914D_7F6E = ____06_FF0E_8718_86DB_5973_7687_6218_5229_54C1["蜘蛛女皇首领奖励池配置"]
local ____07_FF0E_6C99_4E18_6BCD_866B_6218_5229_54C1 = require("系统.02．物品系统.18．首领奖励选择.01．奖励配置表.07．沙丘母虫战利品")
local _____6C99_4E18_6BCD_866B_9996_9886_5956_52B1_6C60_914D_7F6E = ____07_FF0E_6C99_4E18_6BCD_866B_6218_5229_54C1["沙丘母虫首领奖励池配置"]
local ____08_FF0E_6B7B_7075_76D7_8D3C_6218_5229_54C1 = require("系统.02．物品系统.18．首领奖励选择.01．奖励配置表.08．死灵盗贼战利品")
local _____6B7B_7075_76D7_8D3C_9996_9886_5956_52B1_6C60_914D_7F6E = ____08_FF0E_6B7B_7075_76D7_8D3C_6218_5229_54C1["死灵盗贼首领奖励池配置"]
local ____09_FF0E_4E3B_7EBF__6740_622E_98DF_4EBA_9B54_6218_5229_54C1 = require("系统.02．物品系统.18．首领奖励选择.01．奖励配置表.09．主线_杀戮食人魔战利品")
local _____4E3B_7EBF__6740_622E_98DF_4EBA_9B54_9996_9886_5956_52B1_6C60_914D_7F6E = ____09_FF0E_4E3B_7EBF__6740_622E_98DF_4EBA_9B54_6218_5229_54C1["主线_杀戮食人魔首领奖励池配置"]
local ____10_FF0E_4E3B_7EBF__6811_9B54_9996_9886_6218_5229_54C1 = require("系统.02．物品系统.18．首领奖励选择.01．奖励配置表.10．主线_树魔首领战利品")
local _____4E3B_7EBF__6811_9B54_9996_9886_9996_9886_5956_52B1_6C60_914D_7F6E = ____10_FF0E_4E3B_7EBF__6811_9B54_9996_9886_6218_5229_54C1["主线_树魔首领首领奖励池配置"]
local ____11_FF0E_6C61_67D3_4E4B_732B_7C73_4E9A_6218_5229_54C1 = require("系统.02．物品系统.18．首领奖励选择.01．奖励配置表.11．污染之猫米亚战利品")
local _____6C61_67D3_4E4B_732B_7C73_4E9A_6218_5229_54C1_914D_7F6E = ____11_FF0E_6C61_67D3_4E4B_732B_7C73_4E9A_6218_5229_54C1["污染之猫米亚战利品配置"]
do
    local ____01_FF0E_745F_5170_8FEA_5C14_7684_6267_6CD5_9057_7269 = require("系统.02．物品系统.18．首领奖励选择.01．奖励配置表.01．瑟兰迪尔的执法遗物")
    ____exports["瑟兰迪尔奖励池ID"] = ____01_FF0E_745F_5170_8FEA_5C14_7684_6267_6CD5_9057_7269["瑟兰迪尔奖励池ID"]
end
do
    local ____11_FF0E_6C61_67D3_4E4B_732B_7C73_4E9A_6218_5229_54C1 = require("系统.02．物品系统.18．首领奖励选择.01．奖励配置表.11．污染之猫米亚战利品")
    ____exports["米亚奖励池ID"] = ____11_FF0E_6C61_67D3_4E4B_732B_7C73_4E9A_6218_5229_54C1["米亚奖励池ID"]
end
____exports["首领奖励池配置表"] = {
    _____745F_5170_8FEA_5C14_7684_6267_6CD5_9057_7269_914D_7F6E,
    _____53F2_83B1_59C6_9996_9886_5956_52B1_6C60_914D_7F6E,
    _____6C99_6F20_5B9D_85CF_9996_9886_5956_52B1_6C60_914D_7F6E,
    _____55DC_8840_517D_4EBA_9996_9886_5956_52B1_6C60_914D_7F6E,
    _____6C34_9F99_86C7_9996_9886_5956_52B1_6C60_914D_7F6E,
    _____8718_86DB_5973_7687_9996_9886_5956_52B1_6C60_914D_7F6E,
    _____6C99_4E18_6BCD_866B_9996_9886_5956_52B1_6C60_914D_7F6E,
    _____6B7B_7075_76D7_8D3C_9996_9886_5956_52B1_6C60_914D_7F6E,
    _____4E3B_7EBF__6740_622E_98DF_4EBA_9B54_9996_9886_5956_52B1_6C60_914D_7F6E,
    _____4E3B_7EBF__6811_9B54_9996_9886_9996_9886_5956_52B1_6C60_914D_7F6E,
    _____6C61_67D3_4E4B_732B_7C73_4E9A_6218_5229_54C1_914D_7F6E
}
____exports["查找首领奖励池"] = function(_____5956_52B1_6C60ID)
    do
        local _____5E8F_53F7 = 0
        while _____5E8F_53F7 < #____exports["首领奖励池配置表"] do
            local _____5956_52B1_6C60 = ____exports["首领奖励池配置表"][_____5E8F_53F7 + 1]
            if _____5956_52B1_6C60["奖励池ID"] == _____5956_52B1_6C60ID then
                return _____5956_52B1_6C60
            end
            _____5E8F_53F7 = _____5E8F_53F7 + 1
        end
    end
    return nil
end
____exports["校验首领奖励池结构"] = function(_____5956_52B1_6C60)
    local _____9009_9879_6570_91CF = #_____5956_52B1_6C60["选项"]
    if _____9009_9879_6570_91CF < _____9996_9886_5956_52B1_6700_5C11_9009_9879_6570 then
        return false
    end
    if _____9009_9879_6570_91CF > _____9996_9886_5956_52B1_6700_591A_9009_9879_6570 then
        return false
    end
    if _____5956_52B1_6C60["可选数量"] < 1 then
        return false
    end
    if _____5956_52B1_6C60["可选数量"] > _____9009_9879_6570_91CF then
        return false
    end
    return true
end
return ____exports
