/** @noSelfInFile */
/**
 * 自动生成文件，请勿手改。
 * 来源：JASS/世界地图/初始化创建单位.j/异界描述石
 */

export interface 异界描述石配置 {
  配置名: string;
  单位名: string;
  上架物品名: string;
  X: number;
  Y: number;
  朝向?: number | "随机";
  玩家ID?: number;
  当前库存?: number;
  最大库存?: number;
}

export const 世界地图异界描述石配置表: 异界描述石配置[] = [
  {
    配置名: "遗迹之石其一",
    单位名: "异界描述石",
    上架物品名: "阅读描述的内容（其一）LV25",
    X: -16825.7,
    Y: -24443.6,
    朝向: "随机",
    玩家ID: 15,
    当前库存: 1,
    最大库存: 1,
  },
  {
    配置名: "遗迹之石其二",
    单位名: "异界描述石",
    上架物品名: "阅读描述的内容（其二）LV35",
    X: 3821.0,
    Y: -27432.8,
    朝向: "随机",
    玩家ID: 15,
    当前库存: 1,
    最大库存: 1,
  },
  {
    配置名: "遗迹之石其三",
    单位名: "异界描述石",
    上架物品名: "阅读描述的内容（其三）LV45",
    X: 20460.1,
    Y: -14333.7,
    朝向: "随机",
    玩家ID: 15,
    当前库存: 1,
    最大库存: 1,
  },
  {
    配置名: "遗迹之石其四",
    单位名: "异界描述石",
    上架物品名: "阅读描述的内容（其四）LV55",
    X: 28155.1,
    Y: -18123.7,
    朝向: "随机",
    玩家ID: 15,
    当前库存: 1,
    最大库存: 1,
  },
];

export default 世界地图异界描述石配置表;
