--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
---
-- @noSelfInFile
____exports["教派学者单位技能配置"] = {
    ["单位ID"] = "N05M",
    ["技能壳"] = {["深渊之牢"] = "AT08", ["冥神魔门"] = "AN00", ["冥之念欲"] = "AN01", ["邪狱追魂冥法"] = "AN02"},
    ["主动技能提示"] = {{["技能ID"] = "AT08", ["提示"] = "『黑魔法』-深渊之牢"}, {["技能ID"] = "AN00", ["提示"] = "『黑魔法』-冥神魔门"}, {["技能ID"] = "AN01", ["提示"] = "『黑魔法』-冥之念欲"}, {["技能ID"] = "AN02", ["提示"] = "『黑魔法』-邪狱追魂冥法"}},
    ["魔门召唤单位ID"] = {"u00G", "n05P", "n05O"},
    ["广播持续时间Ms"] = 4200,
    ["台词"] = {["深渊之牢"] = {"深渊已经张口，挣扎只会让你们沉得更深。"}, ["冥神魔门"] = {"显现吧！我等信仰的仆从们.."}, ["冥之念欲"] = {"空间的秩序不容违逆，走错一步，就从这个世界消失吧。"}, ["邪狱追魂冥法"] = {"嘿嘿，帝国的忠犬们，祝你们好运..."}}
}
return ____exports
