--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____03_FF0E_6697_5F71_7D22_547D = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.13．教派学者.03．暗影索命")
local _____6CE8_518C_6559_6D3E_5B66_8005_6697_5F71_7D22_547D = ____03_FF0E_6697_5F71_7D22_547D["注册教派学者暗影索命"]
local ____04_FF0E_6DF1_6E0A_4E4B_7262 = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.13．教派学者.04．深渊之牢")
local _____6CE8_518C_6559_6D3E_5B66_8005_6DF1_6E0A_4E4B_7262 = ____04_FF0E_6DF1_6E0A_4E4B_7262["注册教派学者深渊之牢"]
local ____05_FF0E_51A5_795E_9B54_95E8 = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.13．教派学者.05．冥神魔门")
local _____6CE8_518C_6559_6D3E_5B66_8005_51A5_795E_9B54_95E8 = ____05_FF0E_51A5_795E_9B54_95E8["注册教派学者冥神魔门"]
local ____06_FF0E_51A5_4E4B_5FF5_6B32 = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.13．教派学者.06．冥之念欲")
local _____6CE8_518C_6559_6D3E_5B66_8005_51A5_4E4B_5FF5_6B32 = ____06_FF0E_51A5_4E4B_5FF5_6B32["注册教派学者冥之念欲"]
local ____07_FF0E_90AA_72F1_8FFD_9B42_51A5_6CD5 = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.13．教派学者.07．邪狱追魂冥法")
local _____6CE8_518C_6559_6D3E_5B66_8005_90AA_72F1_8FFD_9B42_51A5_6CD5 = ____07_FF0E_90AA_72F1_8FFD_9B42_51A5_6CD5["注册教派学者邪狱追魂冥法"]
local ____10_FF0E_53D7_51FB_53CD_5E94_89C2_5BDF = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.13．教派学者.10．受击反应观察")
local _____6CE8_518C_6559_6D3E_5B66_8005_53D7_51FB_53CD_5E94_89C2_5BDF = ____10_FF0E_53D7_51FB_53CD_5E94_89C2_5BDF["注册教派学者受击反应观察"]
local ____00_FF0E_914D_7F6E = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.13．教派学者.00．配置")
local _____6559_6D3E_5B66_8005_5355_4F4D_6280_80FD_914D_7F6E = ____00_FF0E_914D_7F6E["教派学者单位技能配置"]
local ____01_FF0E_663E_793A_6280_80FD_540D_5B57 = require("系统.03．技能系统.01．显示技能名字")
local _____6CE8_518C_6280_80FD_663E_793A_540D_79F0_8986_76D6 = ____01_FF0E_663E_793A_6280_80FD_540D_5B57["注册技能显示名称覆盖"]
local _____6559_6D3E_5B66_8005_6280_80FD_7ED3_6784_5DF2_6CE8_518C = false
____exports["注册教派学者技能结构"] = function()
    if _____6559_6D3E_5B66_8005_6280_80FD_7ED3_6784_5DF2_6CE8_518C then
        return
    end
    _____6559_6D3E_5B66_8005_6280_80FD_7ED3_6784_5DF2_6CE8_518C = true
    local _____6280_80FD_63D0_793A = _____6559_6D3E_5B66_8005_5355_4F4D_6280_80FD_914D_7F6E["主动技能提示"]
    do
        local i = 0
        while i < #_____6280_80FD_63D0_793A do
            _____6CE8_518C_6280_80FD_663E_793A_540D_79F0_8986_76D6(_____6559_6D3E_5B66_8005_5355_4F4D_6280_80FD_914D_7F6E["单位ID"], _____6280_80FD_63D0_793A[i + 1]["技能ID"], _____6280_80FD_63D0_793A[i + 1]["提示"])
            i = i + 1
        end
    end
    _____6CE8_518C_6559_6D3E_5B66_8005_6697_5F71_7D22_547D()
    _____6CE8_518C_6559_6D3E_5B66_8005_6DF1_6E0A_4E4B_7262()
    _____6CE8_518C_6559_6D3E_5B66_8005_51A5_795E_9B54_95E8()
    _____6CE8_518C_6559_6D3E_5B66_8005_51A5_4E4B_5FF5_6B32()
    _____6CE8_518C_6559_6D3E_5B66_8005_90AA_72F1_8FFD_9B42_51A5_6CD5()
    _____6CE8_518C_6559_6D3E_5B66_8005_53D7_51FB_53CD_5E94_89C2_5BDF()
end
return ____exports
