--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
____exports["额外精英刷怪单位ID列表"] = {"n04A", "n03R"}
____exports["暴击率固定配置表"] = {
    {["单位ID"] = "n01W", ["属性名"] = "暴击率", ["数值"] = 0.2},
    {["单位ID"] = "n003", ["属性名"] = "暴击率", ["数值"] = 0.2},
    {["单位ID"] = "n01R", ["属性名"] = "暴击率", ["数值"] = 0.2},
    {["单位ID"] = "nbds", ["属性名"] = "暴击率", ["数值"] = 0.2},
    {["单位ID"] = "n03M", ["属性名"] = "暴击率", ["数值"] = 0.2},
    {["单位ID"] = "nftb", ["属性名"] = "暴击率", ["数值"] = 0.2}
}
____exports["闪避率固定配置表"] = {{["单位ID"] = "nhrw", ["属性名"] = "闪避率", ["数值"] = 0.15}, {["单位ID"] = "nhrh", ["属性名"] = "闪避率", ["数值"] = 0.15}, {["单位ID"] = "nhrq", ["属性名"] = "闪避率", ["数值"] = 0.15}, {["单位ID"] = "ohun", ["属性名"] = "闪避率", ["数值"] = 0.25}}
____exports["命中率固定配置表"] = {{["单位ID"] = "ohun", ["属性名"] = "命中率", ["数值"] = 125}}
____exports["特殊精英暴击覆写配置表"] = {{["单位ID"] = "N00B", X = -25751.5, Y = -15692.1, ["暴击率"] = 0.3}, {["单位ID"] = "nwld", X = -29030.1, Y = -11275.4, ["暴击率"] = 0.2}, {["单位ID"] = "n01V", X = 4619.1, Y = -24238.1, ["暴击率"] = 0.35}}
return ____exports
