--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
____exports["暴击率固定配置表"] = {
    {["单位名"] = "狼人战士", ["属性名"] = "暴击率", ["数值"] = 0.2},
    {["单位名"] = "狼人骑士", ["属性名"] = "暴击率", ["数值"] = 0.2},
    {["单位名"] = "蒙面人队长", ["属性名"] = "暴击率", ["数值"] = 0.2},
    {["单位名"] = "蛇之看守者", ["属性名"] = "暴击率", ["数值"] = 0.2},
    {["单位名"] = "恶魔剑客", ["属性名"] = "暴击率", ["数值"] = 0.2},
    {["单位名"] = "树魔狂战士", ["属性名"] = "暴击率", ["数值"] = 0.2}
}
____exports["闪避率固定配置表"] = {{["单位名"] = "女妖巫婆", ["属性名"] = "闪避率", ["数值"] = 0.15}, {["单位名"] = "女妖风暴巫师", ["属性名"] = "闪避率", ["数值"] = 0.15}, {["单位名"] = "女妖女皇", ["属性名"] = "闪避率", ["数值"] = 0.15}, {["单位名"] = "巨魔猎头者", ["属性名"] = "闪避率", ["数值"] = 0.25}}
____exports["命中率固定配置表"] = {{["单位名"] = "巨魔猎头者", ["属性名"] = "命中率", ["数值"] = 125}}
____exports["特殊精英暴击覆写配置表"] = {{["单位名"] = "地精剑客", X = -25751.5, Y = -15692.1, ["暴击率"] = 0.3}, {["单位名"] = "森林狼王", X = -29030.1, Y = -11275.4, ["暴击率"] = 0.2}, {["单位名"] = "狼人首领", X = 4619.1, Y = -24238.1, ["暴击率"] = 0.35}}
return ____exports
