/** @noSelfInFile */

import { 注册米亚腐化感染机制 } from "./04．腐化感染";
import { 注册米亚腐化爪击 } from "./05．腐化爪击";
import { 注册米亚污水喷吐 } from "./06．污水喷吐";
import { 注册米亚灵猫分身 } from "./07．灵猫分身";
import { 注册米亚污染标记 } from "./08．污染标记";
import { 注册米亚污染脉冲 } from "./09．污染脉冲";
import { 注册米亚污水柱爆发 } from "./10．污水柱爆发";
import { 注册米亚腐化转移 } from "./11．腐化转移";
import { 注册米亚平台超载惩罚 } from "./12．平台超载惩罚";
import { 注册米亚腐化黏液涂层 } from "./13．腐化黏液涂层";
import { 注册米亚终极污染 } from "./14．终极污染";

export function 注册米亚技能结构(this: void): void {
  注册米亚腐化感染机制();
  注册米亚腐化爪击();
  注册米亚污水喷吐();
  注册米亚灵猫分身();
  注册米亚污染标记();
  注册米亚污染脉冲();
  注册米亚污水柱爆发();
  注册米亚腐化转移();
  注册米亚平台超载惩罚();
  注册米亚腐化黏液涂层();
  注册米亚终极污染();
}
