local ____lualib = require("lualib_bundle")
local __TS__SparseArrayNew = ____lualib.__TS__SparseArrayNew
local __TS__SparseArrayPush = ____lualib.__TS__SparseArrayPush
local __TS__SparseArraySpread = ____lualib.__TS__SparseArraySpread
local ____exports = {}
local ____00_FF0E_5165_53E3_914D_7F6E = require("系统.11．剧情系统.02．支线任务.01．被驱逐的水怪.00．入口配置")
local _____88AB_9A71_9010_7684_6C34_602A_4EFB_52A1_914D_7F6E_5217_8868 = ____00_FF0E_5165_53E3_914D_7F6E["被驱逐的水怪任务配置列表"]
local ____02_FF0E_5165_53E3_914D_7F6E = require("系统.11．剧情系统.02．支线任务.02．污染之猫米亚.02．入口配置")
local _____6C61_67D3_4E4B_732B_7C73_4E9A_4EFB_52A1_914D_7F6E_5217_8868 = ____02_FF0E_5165_53E3_914D_7F6E["污染之猫米亚任务配置列表"]
local ____02_FF0E_5165_53E3_914D_7F6E = require("系统.11．剧情系统.02．支线任务.04．莫尔特斯.02．入口配置")
local _____83AB_5C14_7279_65AF_4EFB_52A1_914D_7F6E_5217_8868 = ____02_FF0E_5165_53E3_914D_7F6E["莫尔特斯任务配置列表"]
local ____array_0 = __TS__SparseArrayNew(
    {
        ["任务ID"] = 10001,
        ["名称"] = "猎杀豺狼人",
        ["类型"] = "击杀",
        ["开始NPC"] = "精灵弓箭手",
        ["目标单位"] = "n004|ngna|ngns|ngno|ngnb|ngnv",
        ["需求数量"] = 10,
        ["奖励"] = "所有玩家+200金币;1能量碎片",
        ["描述"] = "前往精灵森击杀10只豺狼人",
        ["进度文本"] = "击杀豺狼人N/10",
        ["完成后对白"] = "默认",
        ["可重复"] = false,
        ["启用"] = true
    },
    {
        ["任务ID"] = 10002,
        ["名称"] = "采集荧光草",
        ["类型"] = "收集",
        ["开始NPC"] = "精灵村民",
        ["需求物品"] = "shwd",
        ["需求数量"] = 3,
        ["奖励"] = "所有玩家+400经验;1能量碎片",
        ["描述"] = "前往史莱姆草原采集3颗荧光草",
        ["完成后对白"] = "默认",
        ["可重复"] = false,
        ["启用"] = true
    },
    {
        ["任务ID"] = 10003,
        ["名称"] = "收集蜘蛛毒液",
        ["类型"] = "收集",
        ["开始NPC"] = "黑暗巫师",
        ["需求物品"] = "I03L",
        ["需求数量"] = 10,
        ["奖励"] = "所有玩家+1200金币;1等级",
        ["描述"] = "收集10份蜘蛛毒液",
        ["完成后对白"] = "默认",
        ["可重复"] = false,
        ["启用"] = true
    },
    {
        ["任务ID"] = 10004,
        ["名称"] = "收集熔岩能量",
        ["类型"] = "收集",
        ["开始NPC"] = "亡灵法师-安格斯",
        ["需求物品"] = "I05V",
        ["需求数量"] = 3,
        ["奖励"] = "所有玩家+5000金币;1等级",
        ["描述"] = "收集3分熔岩能量",
        ["完成后对白"] = "默认",
        ["可重复"] = false,
        ["启用"] = true
    },
    {
        ["任务ID"] = 1000,
        ["名称"] = "收集豺狼皮2",
        ["类型"] = "收集",
        ["开始NPC"] = "人类农民",
        ["需求物品"] = "I01O",
        ["需求数量"] = 5,
        ["奖励"] = "所有玩家+700经验;400金币",
        ["描述"] = "收集5张豺狼皮",
        ["NPC开始对白"] = "NPC：你好冒险家，我目前急需一些豺狼皮。\nNPC：你愿意帮助我吗?我会给你报酬。",
        ["任务接受对白"] = "Player：好的，有时间我会帮助你\nNPC：多谢帮忙..我会在此地等候的",
        ["NPC完成对白"] = "NPC：这是说好的报酬多谢\n没想到你真的完成了",
        ["完成后对白"] = "默认",
        ["可重复"] = false,
        ["启用"] = true
    },
    {
        ["任务ID"] = 10005,
        ["名称"] = "收集豺狼皮",
        ["类型"] = "收集",
        ["开始NPC"] = "精灵村民",
        ["需求物品"] = "I01O",
        ["需求数量"] = 5,
        ["奖励"] = "所有玩家+700经验;400金币",
        ["描述"] = "收集5张豺狼皮",
        ["完成后对白"] = "默认",
        ["可重复"] = false,
        ["启用"] = true
    },
    {
        ["任务ID"] = 10006,
        ["名称"] = "收集20个蝎肉",
        ["类型"] = "限时收集",
        ["开始NPC"] = "布里强",
        ["需求物品"] = "I0AB",
        ["需求数量"] = 20,
        ["奖励"] = "所有玩家+8000金币;5智力",
        ["描述"] = "收集20个蝎肉",
        ["失败文本"] = "|cffffff00『系统提示』：|r时间已到，此任务失败+NPC:哎...看来只能和兄弟们吃这一点烤肉了",
        ["完成后对白"] = "默认",
        ["可重复"] = false,
        ["启用"] = true
    },
    {
        ["任务ID"] = 10007,
        ["名称"] = "收集7个蝎壳",
        ["类型"] = "收集",
        ["开始NPC"] = "树魔",
        ["需求物品"] = "I03Y",
        ["需求数量"] = 7,
        ["奖励"] = "所有玩家+5000经验;3000金币",
        ["描述"] = "收集20个蝎壳",
        ["完成后对白"] = "默认",
        ["可重复"] = false,
        ["启用"] = true
    },
    {
        ["任务ID"] = 10008,
        ["名称"] = "收集有毒杂草",
        ["类型"] = "收集",
        ["开始NPC"] = "精灵猎手",
        ["需求物品"] = "I0CS",
        ["需求数量"] = 5,
        ["奖励"] = "所有玩家+2500金币;金属性抗性:2%",
        ["描述"] = "收集5个有毒杂草",
        ["完成后对白"] = "默认",
        ["可重复"] = false,
        ["启用"] = true
    },
    {
        ["任务ID"] = 10009,
        ["名称"] = "寻找聚灵花",
        ["类型"] = "收集",
        ["开始NPC"] = "精灵村民",
        ["需求物品"] = "I0A0",
        ["需求数量"] = 1,
        ["奖励"] = "所有玩家+IMaxBJ(20000-(等级-20)*1000, 10000)",
        ["失败文本"] = "完成了|Cffff00ff『寻找聚灵花』|r任务，所有玩家|Cffffcc99英雄经验+20000（根据等级会有所减少)|r，|Cffffff00金币+10000|r",
        ["NPC完成对白"] = "NPC：哇，居然真的是聚灵花，太好了，这下事情有着落了。",
        ["完成后对白"] = "默认",
        ["可重复"] = false,
        ["启用"] = true
    },
    {
        ["任务ID"] = 10010,
        ["名称"] = "送信",
        ["类型"] = "送货",
        ["开始NPC"] = "熔岩术士",
        ["结束NPC位置"] = "createUnit(n03W,12765.50,-19360.30,270.00)",
        ["任务物品"] = "I0AO",
        ["需求物品"] = "I0AO",
        ["需求数量"] = 1,
        ["奖励"] = "所有玩家+10000经验",
        ["描述"] = "将信件送往恶魔城的某人",
        ["NPC完成对白"] = "Player：请问这封信你认识吗？\nNPC：....没错，一眼就认出来了，这确实是我朋友的信，多谢。\nNPC：这是信封上写的报酬，我就替我朋友交付了。\nPlayer：好的。",
        ["完成后对白"] = "默认",
        ["可重复"] = false,
        ["启用"] = true
    },
    {
        ["任务ID"] = 10011,
        ["名称"] = "希望获得品质较好的道具或饰品",
        ["类型"] = "给予",
        ["开始NPC"] = "守望者",
        ["需求物品"] = "装备等级:D+,C-,C,C+",
        ["奖励"] = "外部：\n给予它品质较好的道具或饰品，NPC会给予报酬\n内部：\ntype=道具/戒指/饰品的装备\n装备等级<D+:null\n装备等级>D+&<C:所有玩家+3000金币;1能量碎片\n装备等级=C+:所有玩家+6000金币;2能量碎片\nI067|I08G:所有玩家+3能量碎片",
        ["NPC开始对白"] = "NPC：可以给我一件较好的道具或者饰品吗？不过希望能是我喜欢的，我会给你不错的报酬",
        ["NPC完成对白"] = "这个也太一搬了...还给你，我不需要\n多谢，这是说好的报酬\n此物相当不错，非常好，这是说的好的报酬，另外多送你些\n这就是我想要的，真是太好了！",
        ["完成后对白"] = "默认",
        ["可重复"] = false,
        ["启用"] = true
    },
    {
        ["任务ID"] = 10012,
        ["名称"] = "有提高视力的道具吗",
        ["类型"] = "给予",
        ["开始NPC"] = "精灵弓箭手",
        ["需求物品"] = "I083|I08B",
        ["奖励"] = "英雄等级＞30:所有玩家+10000经验\n英雄等级≤30:所有玩家+1等级",
        ["NPC开始对白"] = "NPC：你好我是精灵村的守望者，但是我近几十年来视力越来越不如以前，如果有能提高视力的道具就好了",
        ["完成后对白"] = "默认",
        ["可重复"] = false,
        ["启用"] = true
    },
    {
        ["任务ID"] = 10013,
        ["名称"] = "消失的笛子",
        ["类型"] = "给予",
        ["开始NPC"] = "冒险者阿利亚",
        ["需求物品"] = "afac",
        ["奖励"] = "所有玩家+18000金币;1能量碎片;12攻击力",
        ["NPC开始对白"] = "NPC：奇怪..我的|cffff6600笛子|r去哪里了..好像是经过|cffff6600飓风沙漠|r后就发现找不到了..",
        ["任务接受对白"] = "NPC：多谢帮忙..我会在此地等候的",
        ["完成后对白"] = "默认",
        ["可重复"] = false,
        ["启用"] = true
    },
    {
        ["任务ID"] = 10014,
        ["名称"] = "暗狱之书",
        ["类型"] = "给予",
        ["开始NPC"] = "德鲁伊学者-卢伊",
        ["需求物品"] = "I0CQ",
        ["需求数量"] = 1,
        ["奖励"] = "所有玩家+25000金币;1能量碎片;2%魔法伤害",
        ["NPC开始对白"] = "NPC：这本|cffffcc99『精灵族远古历史』|r写到上古时期精灵族曾经有族人异端化，但是更为详细资料没有了,如果有更详细的资料就好了",
        ["任务接受对白"] = "NPC：多谢帮忙..我会在此地等候的",
        ["NPC完成对白"] = "NPC：居然真的被你找到了暗狱之书，这是说好的报酬！多谢！\nNPC：....原来是这样，但上面的一些内容还是有些模糊，好像是和帝国相关..",
        ["完成后对白"] = "默认",
        ["可重复"] = false,
        ["启用"] = true
    },
    {
        ["任务ID"] = 10015,
        ["名称"] = "|cffff9900协助异端调查|r（|cffff00008级精英战斗任务|r）",
        ["类型"] = "击杀",
        ["开始NPC"] = "下级异端审查官-卢修斯",
        ["任务物品"] = "I0CN",
        ["接取条件"] = "英雄等级＜10",
        ["NPC开始对白"] = "NPC：被上级派来此地调查精灵森异端的审查官，但调查几天了却没有丝毫进展，最后凭借直觉告诉他可能是|cffff9900豺狼人|r有问题",
        ["任务接受对白"] = "NPC：敬请期待了",
        ["接取失败对白"] = "NPC：我已经调查完成了，多谢你的好意",
        ["完成后对白"] = "默认",
        ["可重复"] = false,
        ["启用"] = true
    },
    {
        ["任务ID"] = 10016,
        ["名称"] = "净化狂霸之熊",
        ["类型"] = "收集",
        ["开始NPC"] = "德鲁伊指引者-阿莫斯",
        ["需求物品"] = "I0BD",
        ["需求数量"] = 20,
        ["奖励"] = "所有玩家+10000金币;(英雄等级)*800经验",
        ["奖励物品"] = "I0BH",
        ["NPC开始对白"] = "NPC：一些同族受到不明原因变得更加原始化了，带上|cffccffff『德鲁伊灯笼（净化）』|r帮我们净化一些同族吧",
        ["任务接受对白"] = "NPC：老朽先提前谢过了",
        ["完成后对白"] = "默认",
        ["可重复"] = false,
        ["启用"] = true
    },
    {
        ["任务ID"] = 10017,
        ["名称"] = "给予圣果",
        ["类型"] = "给予",
        ["开始NPC"] = "德鲁伊看守者-阿尔文",
        ["需求物品"] = "I09M",
        ["需求数量"] = 1,
        ["奖励"] = "所有玩家+2能量碎片;1等级",
        ["NPC开始对白"] = "NPC：咳咳..老朽年事已高，如果有传说中的|cffff9900伊达灵果|r就太好了…年轻人，你愿意帮我吗?",
        ["任务接受对白"] = "NPC：年轻人，这是给你的报酬！",
        ["完成后对白"] = "默认",
        ["可重复"] = false,
        ["启用"] = true
    },
    {
        ["任务ID"] = 10018,
        ["名称"] = "补充生命力",
        ["类型"] = "给予",
        ["开始NPC"] = "知识古树",
        ["需求资源"] = "能量碎片",
        ["需求数量"] = 6,
        ["奖励"] = "所有玩家+(英雄等级*0.6)智力;1智力成长",
        ["NPC开始对白"] = "Player：这颗知识古树似乎没有多少寿命了....可以尝试帮助它补充生命力",
        ["完成后对白"] = "默认",
        ["可重复"] = false,
        ["启用"] = true
    },
    {
        ["任务ID"] = 10019,
        ["名称"] = "|cffff0000失踪的精灵村民（Boss战任务）|r",
        ["类型"] = "目标击杀",
        ["开始NPC"] = "精灵族长-斯韦尔",
        ["奖励"] = "英雄等级≤17:所有玩家+10000金币;暴击伤害+1%;暴击率+1%\n英雄等级＞17:所有玩家+5000金币;暴击伤害+1%",
        ["描述"] = "调查精灵人员为何失踪\n|cffffff00『系统提示』：|r|cffff0000此任务难度特别高，推荐等级：17|r",
        ["NPC开始对白"] = "NPC：最近精灵村陆续失踪一些人员，根据我们目前的线索，|cffffff00初始之森（玩家出生地）|r可能有点踪迹，你愿意帮助我们吗？",
        ["任务接受对白"] = "NPC：感谢你们，有你们的帮助这件事我想一定会有眉目。\nPlayer：长老，可以介绍下具体情况吗\nNPC：嗯..就是精灵村最近1个月开始陆陆续续有村民失踪\nNPC：根据哨手来报，精灵村的空气中混杂着一丝血液，很明显，这件事是人为，不是自然发生的。\nPlayer：居然是血案..\nNPC：来着恐怕不凡，估计是针对我们精灵族而来，目前的踪迹全部指向精灵初始森\nNPC：去哪里调查一下吧，我想会有线索的..\nPlayer：好的，精灵族也是我的朋友..这件事我会当做自己的事情处理..",
        ["完成后对白"] = "默认",
        ["可重复"] = false,
        ["启用"] = true
    },
    table.unpack(_____88AB_9A71_9010_7684_6C34_602A_4EFB_52A1_914D_7F6E_5217_8868)
)
__TS__SparseArrayPush(
    ____array_0,
    table.unpack(_____6C61_67D3_4E4B_732B_7C73_4E9A_4EFB_52A1_914D_7F6E_5217_8868)
)
__TS__SparseArrayPush(
    ____array_0,
    table.unpack(_____83AB_5C14_7279_65AF_4EFB_52A1_914D_7F6E_5217_8868)
)
____exports["任务配置列表"] = {__TS__SparseArraySpread(____array_0)}
____exports.default = ____exports["任务配置列表"]
return ____exports
