/** @noSelfInFile */

import type { 战斗启动属性配置 } from "../00．配置类型";
import { 默认Boss弱点数量基础值 } from "../00．配置类型";

export const 单位n049战斗启动属性配置: 战斗启动属性配置 = {
    归类: "Boss",
    单位ID: "n049",
    单位名: "水触须",
    战斗音乐变量名: "gg_snd_battle01",
    胜利音乐变量名: "gg_snd_shengliBgm",
    地点变量名: "gg_rct______________1524",
    转换场景: true,
    BS移动X轴: 25279.90,
    BS移动Y轴: 10126.00,
    玩家移动X轴: 23647.10,
    玩家移动Y轴: 10225.40,
    弱点数量基础值: 默认Boss弱点数量基础值,
    弱点数量每层N增量: 0,
    器弱伤害需求生命百分比: 0.03,
    护盾基础值: 5,
    护盾每层N增量: 2,
  };
