/** @noSelfInFile */

import type { 战斗启动属性配置 } from "../00．配置类型";
import { 默认Boss弱点数量基础值 } from "../00．配置类型";

export const 单位n011战斗启动属性配置: 战斗启动属性配置 = {
    归类: "Boss",
    单位ID: "n011",
    单位名: "水龙蛇",
    战斗音乐变量名: "gg_snd_battleBoss3",
    胜利音乐变量名: "gg_snd_shengliBgm2",
    地点变量名: "gg_rct______________064",
    魔抗: 0.35,
    闪避率: 0.10,
    弱点数量基础值: 默认Boss弱点数量基础值,
    弱点数量每层N增量: 0,
    天生弱点数: 2,
    枪弱: true,
    风弱: true,
    器弱伤害需求生命百分比: 0.03,
    护盾基础值: 10,
    护盾每层N增量: 2,
  };
