--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____04_FF0E_8150_5316_611F_67D3 = require("系统.03．技能系统.05．单位技能.03．Boss技能.02．挑战与隐藏Boss.02．污染之猫米亚.04．腐化感染")
local _____6CE8_518C_7C73_4E9A_8150_5316_611F_67D3_673A_5236 = ____04_FF0E_8150_5316_611F_67D3["注册米亚腐化感染机制"]
local ____05_FF0E_8150_5316_722A_51FB = require("系统.03．技能系统.05．单位技能.03．Boss技能.02．挑战与隐藏Boss.02．污染之猫米亚.05．腐化爪击")
local _____6CE8_518C_7C73_4E9A_8150_5316_722A_51FB = ____05_FF0E_8150_5316_722A_51FB["注册米亚腐化爪击"]
local ____06_FF0E_6C61_6C34_55B7_5410 = require("系统.03．技能系统.05．单位技能.03．Boss技能.02．挑战与隐藏Boss.02．污染之猫米亚.06．污水喷吐")
local _____6CE8_518C_7C73_4E9A_6C61_6C34_55B7_5410 = ____06_FF0E_6C61_6C34_55B7_5410["注册米亚污水喷吐"]
local ____13_FF0E_8150_5316_9ECF_6DB2_6D82_5C42 = require("系统.03．技能系统.05．单位技能.03．Boss技能.02．挑战与隐藏Boss.02．污染之猫米亚.13．腐化黏液涂层")
local _____6CE8_518C_7C73_4E9A_8150_5316_9ECF_6DB2_6D82_5C42 = ____13_FF0E_8150_5316_9ECF_6DB2_6D82_5C42["注册米亚腐化黏液涂层"]
local ____18_FF0E_6280_80FD_8C03_5EA6 = require("系统.03．技能系统.05．单位技能.03．Boss技能.02．挑战与隐藏Boss.02．污染之猫米亚.18．技能调度")
local _____6CE8_518C_7C73_4E9A_6280_80FD_8C03_5EA6 = ____18_FF0E_6280_80FD_8C03_5EA6["注册米亚技能调度"]
____exports["注册米亚技能结构"] = function()
    _____6CE8_518C_7C73_4E9A_8150_5316_611F_67D3_673A_5236()
    _____6CE8_518C_7C73_4E9A_8150_5316_722A_51FB()
    _____6CE8_518C_7C73_4E9A_6C61_6C34_55B7_5410()
    _____6CE8_518C_7C73_4E9A_8150_5316_9ECF_6DB2_6D82_5C42()
    _____6CE8_518C_7C73_4E9A_6280_80FD_8C03_5EA6()
end
return ____exports
