--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____02_FF0E_6218_6597_533A_57DF = require("系统.03．技能系统.00．技能模板+函数.04．机制组件.02．战斗区域.index")
local _____521B_5EFA_52A8_6001_77E9_5F62_533A_57DF_7EC4 = ____02_FF0E_6218_6597_533A_57DF["创建动态矩形区域组"]
local _____5355_4F4D_6240_5728_52A8_6001_77E9_5F62_533A_57DF = ____02_FF0E_6218_6597_533A_57DF["单位所在动态矩形区域"]
local _____5355_4F4D_662F_5426_5728_52A8_6001_77E9_5F62_533A_57DF_7EC4_5185 = ____02_FF0E_6218_6597_533A_57DF["单位是否在动态矩形区域组内"]
local _____70B9_662F_5426_5728_52A8_6001_77E9_5F62_914D_7F6E_5185 = ____02_FF0E_6218_6597_533A_57DF["点是否在动态矩形配置内"]
local _____9500_6BC1_52A8_6001_77E9_5F62_533A_57DF_7EC4 = ____02_FF0E_6218_6597_533A_57DF["销毁动态矩形区域组"]
____exports["米亚默认安全域配置表"] = {{
    ID = "safe-1",
    ["名称"] = "安全域1",
    ["左"] = 12672,
    ["右"] = 13056,
    ["下"] = -7104,
    ["上"] = -6720
}, {
    ID = "safe-2",
    ["名称"] = "安全域2",
    ["左"] = 12096,
    ["右"] = 12480,
    ["下"] = -8064,
    ["上"] = -7680
}, {
    ID = "safe-3",
    ["名称"] = "安全域3",
    ["左"] = 12928,
    ["右"] = 13312,
    ["下"] = -8704,
    ["上"] = -8320
}, {
    ID = "safe-4",
    ["名称"] = "安全域4",
    ["左"] = 13824,
    ["右"] = 14208,
    ["下"] = -7232,
    ["上"] = -6848
}}
____exports["米亚默认平台中心配置"] = {
    ID = "platform-center",
    ["名称"] = "平台中心",
    ["左"] = 12736,
    ["右"] = 13408,
    ["下"] = -8000,
    ["上"] = -7360
}
____exports["米亚安全域配置表"] = ____exports["米亚默认安全域配置表"]
____exports["米亚平台中心配置"] = ____exports["米亚默认平台中心配置"]
____exports["设置米亚场地配置"] = function(_____5B89_5168_57DF_914D_7F6E_8868, _____5E73_53F0_4E2D_5FC3_914D_7F6E)
    ____exports["米亚安全域配置表"] = _____5B89_5168_57DF_914D_7F6E_8868
    ____exports["米亚平台中心配置"] = _____5E73_53F0_4E2D_5FC3_914D_7F6E
end
____exports["重置米亚场地配置"] = function()
    ____exports["米亚安全域配置表"] = ____exports["米亚默认安全域配置表"]
    ____exports["米亚平台中心配置"] = ____exports["米亚默认平台中心配置"]
end
____exports["取米亚平台中心配置"] = function()
    return ____exports["米亚平台中心配置"]
end
____exports["取米亚平台中心X"] = function()
    return (____exports["米亚平台中心配置"]["左"] + ____exports["米亚平台中心配置"]["右"]) / 2
end
____exports["取米亚平台中心Y"] = function()
    return (____exports["米亚平台中心配置"]["下"] + ____exports["米亚平台中心配置"]["上"]) / 2
end
____exports["创建米亚安全域矩形组"] = function()
    return _____521B_5EFA_52A8_6001_77E9_5F62_533A_57DF_7EC4("米亚安全域", ____exports["米亚安全域配置表"])
end
____exports["清理米亚安全域矩形组"] = function(_____533A_57DF_7EC4)
    _____9500_6BC1_52A8_6001_77E9_5F62_533A_57DF_7EC4(_____533A_57DF_7EC4)
end
____exports["米亚点在矩形配置内"] = function(x, y, rect)
    return _____70B9_662F_5426_5728_52A8_6001_77E9_5F62_914D_7F6E_5185(x, y, rect)
end
____exports["米亚单位在安全域内"] = function(unit, _____533A_57DF_7EC4)
    return _____5355_4F4D_662F_5426_5728_52A8_6001_77E9_5F62_533A_57DF_7EC4_5185(unit, _____533A_57DF_7EC4)
end
____exports["取米亚单位所在安全域"] = function(unit, _____533A_57DF_7EC4)
    return _____5355_4F4D_6240_5728_52A8_6001_77E9_5F62_533A_57DF(unit, _____533A_57DF_7EC4)
end
return ____exports
