--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____04_FF0E_8150_5316_611F_67D3 = require("系统.03．技能系统.05．单位技能.03．Boss技能.04．污染之猫米亚.04．腐化感染")
local _____6CE8_518C_7C73_4E9A_8150_5316_611F_67D3_673A_5236 = ____04_FF0E_8150_5316_611F_67D3["注册米亚腐化感染机制"]
local ____05_FF0E_8150_5316_722A_51FB = require("系统.03．技能系统.05．单位技能.03．Boss技能.04．污染之猫米亚.05．腐化爪击")
local _____6CE8_518C_7C73_4E9A_8150_5316_722A_51FB = ____05_FF0E_8150_5316_722A_51FB["注册米亚腐化爪击"]
local ____06_FF0E_6C61_6C34_55B7_5410 = require("系统.03．技能系统.05．单位技能.03．Boss技能.04．污染之猫米亚.06．污水喷吐")
local _____6CE8_518C_7C73_4E9A_6C61_6C34_55B7_5410 = ____06_FF0E_6C61_6C34_55B7_5410["注册米亚污水喷吐"]
local ____07_FF0E_7075_732B_5206_8EAB = require("系统.03．技能系统.05．单位技能.03．Boss技能.04．污染之猫米亚.07．灵猫分身")
local _____6CE8_518C_7C73_4E9A_7075_732B_5206_8EAB = ____07_FF0E_7075_732B_5206_8EAB["注册米亚灵猫分身"]
local ____08_FF0E_6C61_67D3_6807_8BB0 = require("系统.03．技能系统.05．单位技能.03．Boss技能.04．污染之猫米亚.08．污染标记")
local _____6CE8_518C_7C73_4E9A_6C61_67D3_6807_8BB0 = ____08_FF0E_6C61_67D3_6807_8BB0["注册米亚污染标记"]
local ____09_FF0E_6C61_67D3_8109_51B2 = require("系统.03．技能系统.05．单位技能.03．Boss技能.04．污染之猫米亚.09．污染脉冲")
local _____6CE8_518C_7C73_4E9A_6C61_67D3_8109_51B2 = ____09_FF0E_6C61_67D3_8109_51B2["注册米亚污染脉冲"]
local ____10_FF0E_6C61_6C34_67F1_7206_53D1 = require("系统.03．技能系统.05．单位技能.03．Boss技能.04．污染之猫米亚.10．污水柱爆发")
local _____6CE8_518C_7C73_4E9A_6C61_6C34_67F1_7206_53D1 = ____10_FF0E_6C61_6C34_67F1_7206_53D1["注册米亚污水柱爆发"]
local ____11_FF0E_8150_5316_8F6C_79FB = require("系统.03．技能系统.05．单位技能.03．Boss技能.04．污染之猫米亚.11．腐化转移")
local _____6CE8_518C_7C73_4E9A_8150_5316_8F6C_79FB = ____11_FF0E_8150_5316_8F6C_79FB["注册米亚腐化转移"]
local ____12_FF0E_5E73_53F0_8D85_8F7D_60E9_7F5A = require("系统.03．技能系统.05．单位技能.03．Boss技能.04．污染之猫米亚.12．平台超载惩罚")
local _____6CE8_518C_7C73_4E9A_5E73_53F0_8D85_8F7D_60E9_7F5A = ____12_FF0E_5E73_53F0_8D85_8F7D_60E9_7F5A["注册米亚平台超载惩罚"]
local ____13_FF0E_8150_5316_9ECF_6DB2_6D82_5C42 = require("系统.03．技能系统.05．单位技能.03．Boss技能.04．污染之猫米亚.13．腐化黏液涂层")
local _____6CE8_518C_7C73_4E9A_8150_5316_9ECF_6DB2_6D82_5C42 = ____13_FF0E_8150_5316_9ECF_6DB2_6D82_5C42["注册米亚腐化黏液涂层"]
local ____14_FF0E_7EC8_6781_6C61_67D3 = require("系统.03．技能系统.05．单位技能.03．Boss技能.04．污染之猫米亚.14．终极污染")
local _____6CE8_518C_7C73_4E9A_7EC8_6781_6C61_67D3 = ____14_FF0E_7EC8_6781_6C61_67D3["注册米亚终极污染"]
____exports["注册米亚技能结构"] = function()
    _____6CE8_518C_7C73_4E9A_8150_5316_611F_67D3_673A_5236()
    _____6CE8_518C_7C73_4E9A_8150_5316_722A_51FB()
    _____6CE8_518C_7C73_4E9A_6C61_6C34_55B7_5410()
    _____6CE8_518C_7C73_4E9A_7075_732B_5206_8EAB()
    _____6CE8_518C_7C73_4E9A_6C61_67D3_6807_8BB0()
    _____6CE8_518C_7C73_4E9A_6C61_67D3_8109_51B2()
    _____6CE8_518C_7C73_4E9A_6C61_6C34_67F1_7206_53D1()
    _____6CE8_518C_7C73_4E9A_8150_5316_8F6C_79FB()
    _____6CE8_518C_7C73_4E9A_5E73_53F0_8D85_8F7D_60E9_7F5A()
    _____6CE8_518C_7C73_4E9A_8150_5316_9ECF_6DB2_6D82_5C42()
    _____6CE8_518C_7C73_4E9A_7EC8_6781_6C61_67D3()
end
return ____exports
