--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
____exports["祖地双灵卫副本配置"] = {
    ["开放剧情进度最小值"] = 35,
    ["开放剧情进度最大值"] = 36,
    ["守门单位"] = {
        ["单位ID"] = "e06O",
        X = -16355.1,
        Y = -11711,
        ["朝向"] = 0,
        ["靠近提示"] = "精灵族重地，其他生灵切莫靠近！"
    },
    ["本思雅"] = {["单位ID"] = "e08Q", X = -6145.7, Y = -7502.2, ["朝向"] = 0},
    ["守门闸门变量名"] = "gg_dest_ZTd2_5491",
    ["埃德里安"] = {["单位ID"] = "e082", X = -21310.7, Y = -11173.7, ["朝向"] = 315},
    ["试炼"] = {
        ["靶单位ID"] = "hfoo",
        ["靶模型"] = "Doodads\\LordaeronSummer\\Props\\ArcheryRange\\ArcheryRange.mdl",
        ["伤害靶玩家ID"] = 12,
        ["治疗靶玩家ID"] = 6,
        ["持续伤害"] = {
            X = -20721.5,
            Y = -11048.4,
            ["朝向"] = 270,
            ["持续秒"] = 20,
            ["每秒伤害要求"] = 2000,
            ["最大生命"] = 100000000
        },
        ["单次伤害"] = {
            X = -21172.4,
            Y = -12126.6,
            ["朝向"] = 90,
            ["单次伤害要求"] = 10000,
            ["最大生命"] = 100000000
        },
        ["治疗"] = {
            X = -19677.4,
            Y = -11337.3,
            ["朝向"] = 270,
            ["持续秒"] = 10,
            ["最大生命"] = 5000,
            ["初始生命"] = 1
        }
    },
    ["永久传送点"] = {
        X = -21522.4,
        Y = -11822.2,
        ["朝向"] = 0,
        ["半径"] = 180,
        ["目标X"] = -27872.5,
        ["目标Y"] = -1664.6,
        ["目标朝向"] = 270,
        ["特效"] = "Common\\Effect\\Form\\Portal\\SealGuardWavePortal.mdx"
    },
    ["入口闸门变量名列表"] = {"gg_dest_B00Z_5040", "gg_dest_B00Z_5039"},
    ["道中关卡列表"] = {
        {["关卡名"] = "潮痕外廊", ["通关广播"] = "潮痕外廊已突破，通往碎礁守望的封锁门开启。", ["闸门变量名"] = "gg_dest_Dofw_5579", ["编制"] = {{["单位ID"] = "n056", X = -28131.7, Y = -2943.6, ["朝向"] = 315}, {["单位ID"] = "n056", X = -27756.6, Y = -2936.1, ["朝向"] = 215}, {["单位ID"] = "n056", X = -28118.7, Y = -3244.7, ["朝向"] = 45}, {["单位ID"] = "n056", X = -27799.4, Y = -3261.8, ["朝向"] = 135}}},
        {["关卡名"] = "碎礁守望", ["通关广播"] = "碎礁守望已扫平，通往失名祭坛的封锁门开启。", ["闸门变量名"] = "gg_dest_Dofw_5600", ["编制"] = {
            {["单位ID"] = "n056", X = -29322, Y = -2137, ["朝向"] = 270},
            {["单位ID"] = "n056", X = -28914.8, Y = -2105.1, ["朝向"] = 270},
            {["单位ID"] = "n056", X = -29760.7, Y = -2125.5, ["朝向"] = 270},
            {["单位ID"] = "h00Y", X = -28988.2, Y = -1789.3, ["朝向"] = 270},
            {["单位ID"] = "h00Y", X = -29657.8, Y = -1717.6, ["朝向"] = 270}
        }},
        {["关卡名"] = "失名祭坛", ["通关广播"] = "失名祭坛的潮印已散，通往金鳞封桥的封锁门开启。", ["闸门变量名"] = "gg_dest_Dofw_5694", ["编制"] = {
            {["单位ID"] = "n054", X = -29595.1, Y = -5257.9, ["朝向"] = 45},
            {["单位ID"] = "h00Y", X = -29319.1, Y = -5243.3, ["朝向"] = 45},
            {["单位ID"] = "h00Y", X = -29632.1, Y = -4900.9, ["朝向"] = 45},
            {["单位ID"] = "n056", X = -29642.5, Y = -4719.4, ["朝向"] = 90},
            {["单位ID"] = "n056", X = -29422.1, Y = -4722.3, ["朝向"] = 90},
            {["单位ID"] = "n056", X = -29211.2, Y = -4725.3, ["朝向"] = 90}
        }},
        {["关卡名"] = "金鳞封桥", ["通关广播"] = "金鳞执刑官倒下，金鳞封桥贯通，通往双将压阵的封锁门开启。", ["闸门变量名"] = "gg_dest_Dofw_5692", ["编制"] = {
            {["单位ID"] = "n054", X = -28137.4, Y = -5513.9, ["朝向"] = 90},
            {["单位ID"] = "n052", X = -27554.7, Y = -5528.7, ["朝向"] = 90},
            {["单位ID"] = "h00Y", X = -28561.2, Y = -5168.1, ["朝向"] = 45},
            {["单位ID"] = "h00Y", X = -27105, Y = -5214.9, ["朝向"] = 135},
            {["单位ID"] = "n056", X = -28186.6, Y = -5014.2, ["朝向"] = 90},
            {["单位ID"] = "n056", X = -27846.8, Y = -5063.5, ["朝向"] = 90},
            {["单位ID"] = "n056", X = -27534.5, Y = -5028.8, ["朝向"] = 90}
        }},
        {["关卡名"] = "双将压阵", ["通关广播"] = "双将压阵告破，深渊鳞将沉入潮汐。祖地内门已经解除封锁——双灵卫正在门后等待。", ["闸门变量名"] = "gg_dest_Dofw_5601", ["编制"] = {
            {["单位ID"] = "n054", X = -26715.9, Y = -5208.8, ["朝向"] = 90},
            {["单位ID"] = "n052", X = -26303.4, Y = -5156.3, ["朝向"] = 90},
            {["单位ID"] = "n055", X = -26469.9, Y = -5478, ["朝向"] = 90},
            {["单位ID"] = "n056", X = -26721.8, Y = -4844.9, ["朝向"] = 180},
            {["单位ID"] = "n056", X = -26623.2, Y = -4522.8, ["朝向"] = 180},
            {["单位ID"] = "n056", X = -26267.1, Y = -4641.9, ["朝向"] = 180},
            {["单位ID"] = "h00Y", X = -26696, Y = -4070.1, ["朝向"] = 180},
            {["单位ID"] = "h00Y", X = -26313.1, Y = -3958.9, ["朝向"] = 180}
        }}
    },
    ["Boss入口"] = {X = -25047.2, Y = -2479.5, ["半径"] = 300},
    ["Boss列表"] = {{
        ["Boss键"] = "Boss.赤誓灵卫",
        ["Boss名"] = "赤誓灵卫",
        ["单位ID"] = "U00F",
        X = -24970.2,
        Y = -2037.1,
        ["朝向"] = 270
    }, {
        ["Boss键"] = "Boss.苍影灵卫",
        ["Boss名"] = "苍影灵卫",
        ["单位ID"] = "U00E",
        X = -24989.2,
        Y = -2920.4,
        ["朝向"] = 90
    }},
    ["Boss预警点"] = {X = -24366.3, Y = -2480.5, ["特效"] = "war3mapImported\\MapTest\\file_001098\\file_001098.mdx", ["缩放"] = 3},
    ["Boss脚下特效"] = {["路径"] = "war3mapImported\\MapTest\\file_001138\\file_001138.mdx", ["缩放"] = 2},
    ["Boss前导毫秒"] = 3500,
    ["奖励池ID"] = "chapter2.hidden.ancestral_twin_guards",
    ["全队奖励文本"] = "所有玩家+1能量碎片"
}
return ____exports
