--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
---
-- @noSelfInFile
____exports["卡瑟拉单位技能配置"] = {
    ["单位ID"] = "N05V",
    ["单位名称"] = "深渊巨鱿·卡瑟拉",
    ["Boss单位ID"] = "N05V",
    ["技能壳"] = {
        ["深海涡流"] = "AN00",
        ["触手鞭笞"] = "AN01",
        ["墨汁喷吐"] = "AT08",
        ["高压水炮"] = "CT16",
        ["深渊召唤"] = "代码触发",
        ["共生电击"] = "代码触发"
    },
    ["主动技能提示"] = {{["技能ID"] = "AN00", ["提示"] = "深海涡流", ["扩展提示"] = "在Boss脚下生成半径720码漩涡，持续3秒牵引；随后按距离造成4500×30%~100%伤害并眩晕1秒。（沿Boss面向反方向移动可减弱牵引，尽快离开范围。）"}, {["技能ID"] = "AN01", ["提示"] = "触手鞭笞", ["扩展提示"] = "点名1名玩家，2秒后召唤3条触手，持续8秒、每0.7秒攻击一次；命中附加3秒攻速/移速-40%并禁止位移。（离开红圈并优先击杀触手。）"}, {["技能ID"] = "AT08", ["提示"] = "墨汁喷吐", ["扩展提示"] = "向前方70°、900码扇形喷吐6秒，每秒造成Boss当前攻击力×55%伤害并刷新视野-1200/沉默；落地残留20秒。（离开扇形和残留区域。）"}, {["技能ID"] = "CT16", ["提示"] = "高压水炮", ["扩展提示"] = "锁定最远玩家，1秒后沿2400码×200码直线发射，造成Boss当前攻击力×450%伤害并击退；有效水抗≥35%免除控制。（离开直线路径。）"}},
    ["广播持续时间Ms"] = 4200,
    ["台词"] = {
        ["开场"] = {"深渊的水域，已经吞没你们的退路。", "战斗开始。（留意地面预警和可攻击触手。）"},
        ["深海涡流"] = {"卡瑟拉搅动了深渊之水，将一切拖入它的领域！", "深海涡流将在3秒后爆发。（离开漩涡范围，逆Boss面向移动可减弱牵引。）"},
        ["触手鞭笞"] = {"触手从黑暗中袭来！", "触手将在2秒后出现。（离开红圈，优先击杀触手。）"},
        ["墨汁喷吐"] = {"黑暗笼罩了你的视线。", "墨汁喷吐持续6秒并留下残留。（离开扇形和墨汁区域。）"},
        ["深渊召唤"] = {"卡瑟拉唤来了它的子嗣！", "幼鱿30秒后会被吞噬并为Boss回血。（优先击杀幼鱿。）"},
        ["高压水炮"] = {"高压水流撕裂了水域。", "高压水炮将在1秒后沿直线发射。（离开路径；有效水抗≥35%可免除控制。）"},
        ["触手解放"] = {"卡瑟拉潜入了深渊！", "30秒内击破全部巨型触手，否则Boss回血。（分散集火，限时清场。）"},
        ["共生电击"] = {"电弧在深海中蔓延！", "3秒后全场电击。（进入绝缘珊瑚300码安全区，或消耗3层残片。）"},
        ["触手再生"] = {"卡瑟拉再生一条18秒触手。（优先击杀，避免Boss吸血。）"},
        ["触手残片回收"] = {"地面残片正在回到Boss身边。（尽快拾取。）"},
        ["触手残片吸收"] = {"卡瑟拉正在吸收玩家残片。（及时消耗；4层以上不会被吸收。）"},
        ["死亡"] = {"深渊...还会再次回响...", "战斗结束，请确认奖励与残片。（检查掉落。）"}
    }
}
return ____exports
