--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____03_FF0E_6DF1_6D77_6DA1_6D41 = require("系统.03．技能系统.05．单位技能.03．Boss技能.02．挑战与隐藏Boss.03．深渊巨鱿卡瑟拉.03．深海涡流")
local _____6CE8_518C_5361_745F_62C9_6DF1_6D77_6DA1_6D41 = ____03_FF0E_6DF1_6D77_6DA1_6D41["注册卡瑟拉深海涡流"]
local ____04_FF0E_89E6_624B_97AD_7B1E = require("系统.03．技能系统.05．单位技能.03．Boss技能.02．挑战与隐藏Boss.03．深渊巨鱿卡瑟拉.04．触手鞭笞")
local _____6CE8_518C_5361_745F_62C9_89E6_624B_97AD_7B1E = ____04_FF0E_89E6_624B_97AD_7B1E["注册卡瑟拉触手鞭笞"]
local ____05_FF0E_58A8_6C41_55B7_5410 = require("系统.03．技能系统.05．单位技能.03．Boss技能.02．挑战与隐藏Boss.03．深渊巨鱿卡瑟拉.05．墨汁喷吐")
local _____6CE8_518C_5361_745F_62C9_58A8_6C41_55B7_5410 = ____05_FF0E_58A8_6C41_55B7_5410["注册卡瑟拉墨汁喷吐"]
local ____06_FF0E_6DF1_6E0A_53EC_5524 = require("系统.03．技能系统.05．单位技能.03．Boss技能.02．挑战与隐藏Boss.03．深渊巨鱿卡瑟拉.06．深渊召唤")
local _____6CE8_518C_5361_745F_62C9_6DF1_6E0A_53EC_5524 = ____06_FF0E_6DF1_6E0A_53EC_5524["注册卡瑟拉深渊召唤"]
local ____07_FF0E_9AD8_538B_6C34_70AE = require("系统.03．技能系统.05．单位技能.03．Boss技能.02．挑战与隐藏Boss.03．深渊巨鱿卡瑟拉.07．高压水炮")
local _____6CE8_518C_5361_745F_62C9_9AD8_538B_6C34_70AE = ____07_FF0E_9AD8_538B_6C34_70AE["注册卡瑟拉高压水炮"]
local ____08_FF0E_89E6_624B_89E3_653E = require("系统.03．技能系统.05．单位技能.03．Boss技能.02．挑战与隐藏Boss.03．深渊巨鱿卡瑟拉.08．触手解放")
local _____6CE8_518C_5361_745F_62C9_89E6_624B_89E3_653E = ____08_FF0E_89E6_624B_89E3_653E["注册卡瑟拉触手解放"]
local ____09_FF0E_5171_751F_7535_51FB = require("系统.03．技能系统.05．单位技能.03．Boss技能.02．挑战与隐藏Boss.03．深渊巨鱿卡瑟拉.09．共生电击")
local _____6CE8_518C_5361_745F_62C9_5171_751F_7535_51FB = ____09_FF0E_5171_751F_7535_51FB["注册卡瑟拉共生电击"]
local ____10_FF0E_89E6_624B_518D_751F_4E0E_6B8B_7247 = require("系统.03．技能系统.05．单位技能.03．Boss技能.02．挑战与隐藏Boss.03．深渊巨鱿卡瑟拉.10．触手再生与残片")
local _____6CE8_518C_5361_745F_62C9_89E6_624B_518D_751F_4E0E_6B8B_7247 = ____10_FF0E_89E6_624B_518D_751F_4E0E_6B8B_7247["注册卡瑟拉触手再生与残片"]
____exports["注册卡瑟拉技能结构"] = function()
    _____6CE8_518C_5361_745F_62C9_6DF1_6D77_6DA1_6D41()
    _____6CE8_518C_5361_745F_62C9_89E6_624B_97AD_7B1E()
    _____6CE8_518C_5361_745F_62C9_58A8_6C41_55B7_5410()
    _____6CE8_518C_5361_745F_62C9_6DF1_6E0A_53EC_5524()
    _____6CE8_518C_5361_745F_62C9_9AD8_538B_6C34_70AE()
    _____6CE8_518C_5361_745F_62C9_89E6_624B_89E3_653E()
    _____6CE8_518C_5361_745F_62C9_5171_751F_7535_51FB()
    _____6CE8_518C_5361_745F_62C9_89E6_624B_518D_751F_4E0E_6B8B_7247()
end
return ____exports
