--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____19_FF0E_6218_6597_516C_5171_5DE5_5177 = require("系统.03．技能系统.00．技能模板+函数.02．通用函数.19．战斗公共工具")
local stringToFourCC = ____19_FF0E_6218_6597_516C_5171_5DE5_5177.stringToFourCC
local _____53D6_5355_4F4DID = ____19_FF0E_6218_6597_516C_5171_5DE5_5177["取单位ID"]
local _____5355_4F4D_6709_6548 = ____19_FF0E_6218_6597_516C_5171_5DE5_5177["单位有效"]
local _____8DDD_79BB_5E73_65B9XY = ____19_FF0E_6218_6597_516C_5171_5DE5_5177["距离平方XY"]
local _____8DDD_79BBXY = ____19_FF0E_6218_6597_516C_5171_5DE5_5177["距离XY"]
local _____4E24_70B9_89D2_5EA6 = ____19_FF0E_6218_6597_516C_5171_5DE5_5177["两点角度"]
local _____5355_4F4D_95F4_89D2_5EA6 = ____19_FF0E_6218_6597_516C_5171_5DE5_5177["单位间角度"]
local _____89D2_5EA6_5DEE_7EDD_5BF9_503C = ____19_FF0E_6218_6597_516C_5171_5DE5_5177["角度差绝对值"]
local _____6781_5750_6807X = ____19_FF0E_6218_6597_516C_5171_5DE5_5177["极坐标X"]
local _____6781_5750_6807Y = ____19_FF0E_6218_6597_516C_5171_5DE5_5177["极坐标Y"]
local _____9650_5236_6570_503C = ____19_FF0E_6218_6597_516C_5171_5DE5_5177["限制数值"]
local _____70B9_5230_7EBF_6BB5_8DDD_79BB_5E73_65B9 = ____19_FF0E_6218_6597_516C_5171_5DE5_5177["点到线段距离平方"]
local ____require_result_0 = require("系统.03．技能系统.00．技能模板+函数.02．通用函数.00．单位动画等待")
local _____64AD_653E_9650_65F6_5355_4F4D_52A8_753B = ____require_result_0["播放限时单位动画"]
____exports.stringToFourCC = stringToFourCC
____exports["取单位ID"] = _____53D6_5355_4F4DID
____exports["单位有效"] = _____5355_4F4D_6709_6548
____exports["距离平方XY"] = _____8DDD_79BB_5E73_65B9XY
____exports["距离XY"] = _____8DDD_79BBXY
____exports["极坐标X"] = _____6781_5750_6807X
____exports["极坐标Y"] = _____6781_5750_6807Y
____exports["限制数值"] = _____9650_5236_6570_503C
____exports["点到线段距离平方"] = _____70B9_5230_7EBF_6BB5_8DDD_79BB_5E73_65B9
____exports["取坐标角度"] = _____4E24_70B9_89D2_5EA6
____exports["取单位间角度"] = _____5355_4F4D_95F4_89D2_5EA6
____exports["角度差"] = _____89D2_5EA6_5DEE_7EDD_5BF9_503C
____exports["播放卡瑟拉限时动作"] = function(unit, _____52A8_753B_7F16_53F7, _____52A8_753B_901F_5EA6, _____6301_7EED_79D2, _____6062_590D_52A8_753B_7F16_53F7)
    if _____6062_590D_52A8_753B_7F16_53F7 == nil then
        _____6062_590D_52A8_753B_7F16_53F7 = 5
    end
    _____64AD_653E_9650_65F6_5355_4F4D_52A8_753B({
        ["单位"] = unit,
        ["动画编号"] = _____52A8_753B_7F16_53F7,
        ["动画速度"] = _____52A8_753B_901F_5EA6,
        ["持续秒"] = _____6301_7EED_79D2,
        ["恢复动画编号"] = _____6062_590D_52A8_753B_7F16_53F7
    })
end
return ____exports
