--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____00_FF0E_914D_7F6E_7C7B_578B = require("系统.03．技能系统.06．AI自动使用技能.09．Boss战启动桥接.03．战斗启动属性.00．配置类型")
local _____9ED8_8BA4Boss_5F31_70B9_6570_91CF_57FA_7840_503C = ____00_FF0E_914D_7F6E_7C7B_578B["默认Boss弱点数量基础值"]
____exports["单位N05W战斗启动属性配置"] = {
    ["归类"] = "英雄Boss",
    ["单位ID"] = "N05W",
    ["单位名"] = "古木之蚀·莫尔特斯",
    ["战斗音乐路径"] = "",
    ["胜利音乐路径"] = "",
    ["魔抗"] = 0.38,
    ["眩晕抗性"] = 0.45,
    ["命中率"] = 0.2,
    ["闪避率"] = 0.1,
    ["斧弱"] = true,
    ["火弱"] = true,
    ["器弱伤害需求生命百分比"] = 0.03,
    ["弱点数量基础值"] = _____9ED8_8BA4Boss_5F31_70B9_6570_91CF_57FA_7840_503C,
    ["弱点数量每层N增量"] = 0,
    ["天生弱点数"] = 2,
    ["护盾基础值"] = 9,
    ["护盾每层N增量"] = 2
}
return ____exports
