/** @noSelfInFile */

import type { 战斗启动属性配置 } from "../00．配置类型";
import { 默认Boss弱点数量基础值 } from "../00．配置类型";

export const 单位N05L战斗启动属性配置: 战斗启动属性配置 = {
    归类: "英雄Boss",
    // h01D 是剧情 NPC 壳；Boss 开战后绑定 N05L 实际战斗单位。
    单位ID: "N05L",
    单位名: "利尔·伯特",
    战斗音乐变量名: "gg_snd_battleBoss2",
    胜利音乐变量名: "gg_snd_shengliBgm",
    地点区域名称: "利尔伯特.战斗区域",
    转换场景: true,
    BS移动X轴: 29767.20,
    BS移动Y轴: 5102.20,
    玩家移动X轴: 27710.10,
    玩家移动Y轴: 5054.30,
    魔抗: 0.30,
    暴击率: 0.40,
    暴击伤害: 0.50,
    眩晕抗性: 0.25,
    命中率: 0.20,
    闪避率: 0.30,
    护甲穿透: 0.50,
    弱点数量基础值: 默认Boss弱点数量基础值,
    弱点数量每层N增量: 0,
    天生弱点数: 2,
    额外随机弱点数: 1,
    枪弱: true,
    风弱: true,
    器弱伤害需求生命百分比: 0.03,
    护盾基础值: 7,
    护盾每层N增量: 2,
  };
