/** @noSelfInFile */

import type { 战斗启动属性配置 } from "../00．配置类型";
import { 默认Boss弱点数量基础值 } from "../00．配置类型";

export const 单位N05N战斗启动属性配置: 战斗启动属性配置 = {
    归类: "英雄Boss",
    单位ID: "N05N",
    单位名: "教派剑士",
    战斗音乐变量名: "gg_snd_battleBosszuizhong01",
    胜利音乐变量名: "gg_snd_shengliBgm",
    地点变量名: "gg_rct______________1522",
    转换场景: true,
    玩家移动X轴: 26760.30,
    玩家移动Y轴: 17338.30,
    魔抗: 0.20,
    暴击率: 0.40,
    暴击伤害: 0.25,
    眩晕抗性: 0.35,
    命中率: 0.10,
    闪避率: 0.40,
    弱点数量基础值: 默认Boss弱点数量基础值,
    弱点数量每层N增量: 0,
    天生弱点数: 2,
    额外随机弱点数: 1,
    杖弱: true,
    火弱: true,
    光弱: true,
    器弱伤害需求生命百分比: 0.03,
    护盾基础值: 8,
    护盾每层N增量: 2,
  };
