/** @noSelfInFile */

import type { 战斗启动属性配置 } from "../00．配置类型";
import { 默认Boss弱点数量基础值 } from "../00．配置类型";

export const 单位N057战斗启动属性配置: 战斗启动属性配置 = {
    归类: "英雄Boss",
    单位ID: "N057",
    单位名: "精灵执法队长·瑟兰迪尔",
    战斗音乐变量名: "gg_snd_battleBoss3",
    胜利音乐变量名: "gg_snd_shengliBgm2",
    地点变量名: "gg_rct______________1522",
    转换场景: true,
    玩家移动X轴: 26760.30,
    玩家移动Y轴: 17338.30,
    魔抗: 0.35,
    眩晕抗性: 0.35,
    命中率: 0.20,
    闪避率: 0.20,
    暴击率: 0.15,
    暴击伤害: 0.35,
    护甲穿透: 0.20,
    弱点数量基础值: 默认Boss弱点数量基础值,
    弱点数量每层N增量: 0,
    天生弱点数: 1,
    暗弱: true,
    器弱伤害需求生命百分比: 0.03,
    护盾基础值: 8,
    护盾每层N增量: 2,
  };
