/** @noSelfInFile */

import type { 战斗启动属性配置 } from "../00．配置类型";
import { 默认Boss弱点数量基础值 } from "../00．配置类型";

export const 单位N03G战斗启动属性配置: 战斗启动属性配置 = {
  归类: "英雄Boss",
  单位ID: "N03G",
  单位名: "熔岩恶魔王·巴尔扎罗斯",
  战斗音乐变量名: "gg_snd_battleBoss2",
  胜利音乐变量名: "gg_snd_shengliBgm",
  地点变量名: "gg_rct______________1522",
  转换场景: true,
  BS移动X轴: 28336,
  BS移动Y轴: 880,
  玩家移动X轴: 28336,
  玩家移动Y轴: 320,
  魔抗: 0.34,
  眩晕抗性: 0.45,
  命中率: 0.25,
  闪避率: 0.15,
  魔法穿透: 0.25,
  冰弱: true,
  光弱: true,
  器弱伤害需求生命百分比: 0.03,
  弱点数量基础值: 默认Boss弱点数量基础值,
  弱点数量每层N增量: 0,
  天生弱点数: 2,
  额外随机弱点数: 1,
  护盾基础值: 10,
  护盾每层N增量: 2,
};
