/** @noSelfInFile */

import type { Boss战斗启动护卫单位配置, Boss战斗启动护卫配置, 战斗启动属性配置 } from "../00．配置类型";
import { 默认Boss弱点数量基础值 } from "../00．配置类型";

export const 单位N05T战斗启动属性配置: 战斗启动属性配置 = {
  归类: "英雄Boss",
  单位ID: "N05T",
  单位名: "菲利斯",
  战斗音乐路径: "Sound\\BGM\\Scene\\SealCore\\Falcom Sound Team J.D.K. - Guardian of the Sacred Treasure.mp3",
  战斗音乐变量名: "gg_snd_battleBoss2",
  胜利音乐变量名: "gg_snd_shengliBgm",
  地点变量名: "gg_rct______________1522",
  转换场景: true,
  BS移动X轴: 26503.00,
  BS移动Y轴: 20921.80,
  玩家移动X轴: 26807.50,
  玩家移动Y轴: 17016.80,
  魔抗: 0.30,
  暴击率: 0.20,
  暴击伤害: 0.50,
  眩晕抗性: 0.35,
  命中率: 0.25,
  闪避率: 0.10,
  风弱: true,
  杖弱: true,
  器弱伤害需求生命百分比: 0.03,
  弱点数量基础值: 默认Boss弱点数量基础值,
  弱点数量每层N增量: 0,
  天生弱点数: 2,
  护盾基础值: 8,
  护盾每层N增量: 2,
};

const 第二军团战士护卫配置: Boss战斗启动护卫单位配置 = {
  单位ID: "n060",
  单位名: "第二军团战士",
  每批生成数量: 1,
  同类最大存活数量: 4,
  随机生成位置: { 中心: "Boss战矩形中心", 最小半径: 1800, 最大半径: 2000 },
  主Boss死亡时立刻死亡: true,
};

const 第二军团弓箭手护卫配置: Boss战斗启动护卫单位配置 = {
  单位ID: "n061",
  单位名: "第二军团弓箭手",
  每批生成数量: 1,
  同类最大存活数量: 4,
  随机生成位置: { 中心: "Boss战矩形中心", 最小半径: 1800, 最大半径: 2000 },
  主Boss死亡时立刻死亡: true,
};

const 第二军团护卫护卫配置: Boss战斗启动护卫单位配置 = {
  单位ID: "n063",
  单位名: "第二军团护卫",
  每批生成数量: 1,
  同类最大存活数量: 2,
  随机生成位置: { 中心: "Boss战矩形中心", 最小半径: 1800, 最大半径: 2000 },
  主Boss死亡时立刻死亡: true,
};

const 第二军团术士护卫配置: Boss战斗启动护卫单位配置 = {
  单位ID: "n062",
  单位名: "第二军团术士",
  每批生成数量: 1,
  同类最大存活数量: 2,
  随机生成位置: { 中心: "Boss战矩形中心", 最小半径: 1800, 最大半径: 2000 },
  主Boss死亡时立刻死亡: true,
};

const 菲利斯第二军团护卫列表: Boss战斗启动护卫单位配置[] = [
  第二军团战士护卫配置,
  第二军团弓箭手护卫配置,
  第二军团护卫护卫配置,
  第二军团术士护卫配置,
];

export const 单位N05T战斗启动护卫配置: Boss战斗启动护卫配置 = {
  Boss单位ID: "N05T",
  Boss单位名: "菲利斯",
  护卫血条归属类型: "独立",
  初始护卫批次: {
    单位列表: 菲利斯第二军团护卫列表,
  },
  周期护卫批次: {
    间隔毫秒: 12000,
    单位列表: 菲利斯第二军团护卫列表,
  },
};
