/** @noSelfInFile */

import type { 战斗启动属性配置 } from "../00．配置类型";
import { 默认Boss弱点数量基础值 } from "../00．配置类型";

export const 单位N05U战斗启动属性配置: 战斗启动属性配置 = {
  归类: "英雄Boss",
  单位ID: "N05U",
  单位名: "里科特",
  战斗音乐变量名: "gg_snd_battleBosszuizhong01",
  胜利音乐变量名: "gg_snd_shengliBgm",
  地点变量名: "gg_rct______________1522",
  转换场景: true,
  BS移动X轴: 26503.00,
  BS移动Y轴: 20921.80,
  玩家移动X轴: 26807.50,
  玩家移动Y轴: 17016.80,
  魔抗: 0.20,
  暴击率: 0.30,
  暴击伤害: 2.00,
  眩晕抗性: 0,
  命中率: 0.10,
  闪避率: 0.30,
  风弱: true,
  杖弱: true,
  器弱伤害需求生命百分比: 0.03,
  弱点数量基础值: 默认Boss弱点数量基础值,
  弱点数量每层N增量: 0,
  天生弱点数: 2,
  护盾基础值: 8,
  护盾每层N增量: 2,
};
