--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local _____653B_51FB_6548_679C_914D_7F6E_5217_8868 = {}
____exports["攻击效果测试装备顺序"] = {
    "地精肩甲",
    "毒之铠甲",
    "|cffff0000炽热肩甲|r",
    "统领之甲",
    "光精之甲",
    "齿轮符剑",
    "森魔战斧",
    "|cff333399虚空猎锤|r",
    "狱之刺刃",
    "恶狱断刃",
    "|cffcc99ff黑暗猎人手套|r",
    "|cff993300恶魔王爪|r",
    "狂暴熔刃",
    "魔古战刃",
    "狱炽之刃",
    "矮人火炮",
    "矮人燧发枪",
    "炽热之弹矢",
    "淬血战刃",
    "双翼恶魔之利刃",
    "火药弓",
    "沙之魔弓",
    "沙之猎弓",
    "血浴之母的第一条右腿",
    "远古巫术项链",
    "血浴之母的第一条左腿",
    "火焰段刃",
    "比安断刃",
    "瑟尔之弓",
    "|cffff6800地狱火手套|r"
}
____exports["攻击效果测试命令列表"] = {
    "wp84",
    "wp85",
    "wp86",
    "wp87",
    "wp88",
    "wp89",
    "wp90",
    "wp91",
    "wp92",
    "wp93",
    "wp94",
    "wp95",
    "wp96",
    "wp97",
    "wp98",
    "wp99",
    "wp100",
    "wp101",
    "wp102",
    "wp103",
    "wp104",
    "wp105",
    "wp106",
    "wp107",
    "wp108",
    "wp109",
    "wp110",
    "wp111",
    "wp112",
    "wp114"
}
____exports["注册攻击效果配置"] = function(_____914D_7F6E)
    if _____914D_7F6E == nil or _____914D_7F6E["装备名"] == "" then
        return
    end
    do
        local i = 0
        while i < #_____653B_51FB_6548_679C_914D_7F6E_5217_8868 do
            if _____653B_51FB_6548_679C_914D_7F6E_5217_8868[i + 1]["装备名"] == _____914D_7F6E["装备名"] then
                return
            end
            i = i + 1
        end
    end
    _____653B_51FB_6548_679C_914D_7F6E_5217_8868[#_____653B_51FB_6548_679C_914D_7F6E_5217_8868 + 1] = _____914D_7F6E
end
____exports["获取攻击效果配置列表"] = function()
    return _____653B_51FB_6548_679C_914D_7F6E_5217_8868
end
return ____exports
