--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
____exports["第一章普通小怪额外装备池"] = {
    {["物品ID"] = "I0J0", ["评分"] = 900},
    {["物品ID"] = "I0J1", ["评分"] = 1050},
    {["物品ID"] = "I0J2", ["评分"] = 1150},
    {["物品ID"] = "I0J3", ["评分"] = 1000},
    {["物品ID"] = "I0J4", ["评分"] = 1500},
    {["物品ID"] = "I0J5", ["评分"] = 1600},
    {["物品ID"] = "I0J6", ["评分"] = 1300},
    {["物品ID"] = "I0J7", ["评分"] = 850},
    {["物品ID"] = "I0J8", ["评分"] = 1850},
    {["物品ID"] = "I0J9", ["评分"] = 2200}
}
____exports["第二章普通小怪额外装备池"] = {
    {["物品ID"] = "I0JA", ["评分"] = 3200},
    {["物品ID"] = "I0JB", ["评分"] = 3450},
    {["物品ID"] = "I0JC", ["评分"] = 4350},
    {["物品ID"] = "I0JD", ["评分"] = 4400},
    {["物品ID"] = "I0JE", ["评分"] = 3300},
    {["物品ID"] = "I0JF", ["评分"] = 3750},
    {["物品ID"] = "I0JG", ["评分"] = 3900},
    {["物品ID"] = "I0JH", ["评分"] = 4550},
    {["物品ID"] = "I0JI", ["评分"] = 4900},
    {["物品ID"] = "I0JJ", ["评分"] = 5200}
}
____exports["第三章普通小怪额外装备池"] = {
    {["物品ID"] = "I0JK", ["评分"] = 7200},
    {["物品ID"] = "I0JL", ["评分"] = 6900},
    {["物品ID"] = "I0JM", ["评分"] = 7600},
    {["物品ID"] = "I0JN", ["评分"] = 8200},
    {["物品ID"] = "I0JO", ["评分"] = 9000},
    {["物品ID"] = "I0JP", ["评分"] = 8700},
    {["物品ID"] = "I0JQ", ["评分"] = 6600},
    {["物品ID"] = "I0JR", ["评分"] = 7400},
    {["物品ID"] = "I0JS", ["评分"] = 9200},
    {["物品ID"] = "I0JT", ["评分"] = 8100}
}
____exports["获取章节普通小怪额外装备池"] = function(_____7AE0_8282)
    if _____7AE0_8282 == 1 then
        return ____exports["第一章普通小怪额外装备池"]
    end
    if _____7AE0_8282 == 2 then
        return ____exports["第二章普通小怪额外装备池"]
    end
    return ____exports["第三章普通小怪额外装备池"]
end
return ____exports
