--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____00_FF0E_914D_7F6E = require("系统.03．技能系统.05．单位技能.04．英雄技能.20．爱蜜莉雅.00．配置")
local _____7231_871C_8389_96C5_6280_80FD_914D_7F6E = ____00_FF0E_914D_7F6E["爱蜜莉雅技能配置"]
local jass = require("jass.common")
local ____require_result_0 = require("系统.00．核心系统.00．玩家系统.00．英雄注册联动.00．玩家英雄获取桥接")
local registerPlayerHeroListener = ____require_result_0.registerPlayerHeroListener
local ____require_result_1 = require("系统.03．技能系统.00．技能模板+函数.02．通用函数.16．动态技能数据")
local _____52A8_6001_4FEE_6539_5355_4F4D_6280_80FD_6570_636E = ____require_result_1["动态修改单位技能数据"]
local GetUnitTypeId = jass.GetUnitTypeId
local _____82F1_96C4_5355_4F4D_7C7B_578BID = jass:FourCC("E00C")
local _____663E_793A_914D_7F6E = {
    {
        ["技能ID"] = _____7231_871C_8389_96C5_6280_80FD_914D_7F6E.Q["技能ID"],
        ["名称"] = _____7231_871C_8389_96C5_6280_80FD_914D_7F6E.Q["名称"],
        ["图标"] = _____7231_871C_8389_96C5_6280_80FD_914D_7F6E.Q["图标"],
        ["说明"] = "发射冰之矢；可与场上的冰晶节点产生联动。",
        ["快捷键"] = "Q"
    },
    {
        ["技能ID"] = _____7231_871C_8389_96C5_6280_80FD_914D_7F6E.W["技能ID"],
        ["名称"] = _____7231_871C_8389_96C5_6280_80FD_914D_7F6E.W["名称"],
        ["图标"] = _____7231_871C_8389_96C5_6280_80FD_914D_7F6E.W["图标"],
        ["说明"] = "在目标地点展开冰花与寒气区域，并保留后续冰片选择。",
        ["快捷键"] = "W"
    },
    {
        ["技能ID"] = _____7231_871C_8389_96C5_6280_80FD_914D_7F6E.E["技能ID"],
        ["名称"] = _____7231_871C_8389_96C5_6280_80FD_914D_7F6E.E["名称"],
        ["图标"] = _____7231_871C_8389_96C5_6280_80FD_914D_7F6E.E["图标"],
        ["说明"] = "获得冰晶护身并向目标方向调整位置，结束时处理冰爆。",
        ["快捷键"] = "E"
    },
    {
        ["技能ID"] = _____7231_871C_8389_96C5_6280_80FD_914D_7F6E.R["技能ID"],
        ["名称"] = _____7231_871C_8389_96C5_6280_80FD_914D_7F6E.R["名称"],
        ["图标"] = _____7231_871C_8389_96C5_6280_80FD_914D_7F6E.R["图标"],
        ["说明"] = "展开永冻之庭，读取冰晶并进行冻结结算。",
        ["快捷键"] = "R"
    },
    {
        ["技能ID"] = _____7231_871C_8389_96C5_6280_80FD_914D_7F6E.D["技能ID"],
        ["名称"] = _____7231_871C_8389_96C5_6280_80FD_914D_7F6E.D["名称"],
        ["图标"] = _____7231_871C_8389_96C5_6280_80FD_914D_7F6E.D["图标"],
        ["说明"] = "召唤帕克协战，获得有限次数的技能强化机会。",
        ["快捷键"] = "D"
    }
}
local function _____521D_59CB_5316_7231_871C_8389_96C5_6280_80FD_663E_793A(_player, hero)
    if hero == nil or hero == 0 then
        return
    end
    if GetUnitTypeId(hero) ~= _____82F1_96C4_5355_4F4D_7C7B_578BID then
        return
    end
    _____52A8_6001_4FEE_6539_5355_4F4D_6280_80FD_6570_636E(hero, _____663E_793A_914D_7F6E)
end
registerPlayerHeroListener(_____521D_59CB_5316_7231_871C_8389_96C5_6280_80FD_663E_793A)
return ____exports
