--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
____exports["死亡触发Boss配置表"] = {{
    ["配置ID"] = "沙丘之虫_沙漠母虫",
    ["触发类型"] = "累计数量",
    ["触发单位名"] = "沙丘之虫",
    ["Boss单位名"] = "沙漠母虫",
    ["只触发一次"] = true,
    ["需要加入血条Boss组"] = true,
    ["出现位置类型"] = "击杀者当前位置",
    ["累计数量"] = 10,
    ["出场特效模型"] = "units\\critters\\DuneWorm\\DuneWorm.mdl",
    ["出现提示文本"] = "这...糟糕！准备战斗！",
    ["Boss说话文本"] = "沙海已经苏醒，所有闯入者都会被我吞没。",
    ["Boss说话延迟Ms"] = 350,
    ["广播持续时间Ms"] = 5000
}, {
    ["配置ID"] = "nsbm_蜘蛛女皇",
    ["触发类型"] = "概率",
    ["触发单位名"] = "nsbm",
    ["触发单位ID"] = "nsbm",
    ["Boss单位名"] = "蜘蛛女皇|cffff0000（BossLV25）|r",
    ["只触发一次"] = true,
    ["需要加入血条Boss组"] = true,
    ["出现位置类型"] = "固定坐标",
    ["固定X"] = -12252.6,
    ["固定Y"] = -28635,
    ["出现概率"] = 18,
    ["击杀者最低英雄等级"] = 14,
    ["击杀者最高英雄等级"] = 30,
    ["出场特效模型"] = "war3mapImported\\NerubianCaster.mdl",
    ["出现提示文本"] = "怎么回事！！！？",
    ["Boss说话文本"] = "我的蛛网已经覆盖这片荒地，你们谁也逃不掉。",
    ["Boss说话延迟Ms"] = 350,
    ["广播持续时间Ms"] = 5000
}}
return ____exports
