--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____00_FF0E_4E3B_52A8_6280_80FD_88C5_5907_540D = require("系统.02．物品系统.15．装备技能.03．主动技能.00．公共.00．主动技能装备名")
local _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0 = ____00_FF0E_4E3B_52A8_6280_80FD_88C5_5907_540D["主动技能装备名称"]
____exports["熔岩权杖配置"] = {
    ["装备名称"] = _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["熔岩权杖"],
    ["速度"] = 1000,
    ["弹幕模型"] = "Abilities\\Weapons\\FireBallMissile\\FireBallMissile.mdl",
    ["伤害值"] = 500,
    ["控制时间"] = 1
}
____exports["地狱火卡牌配置"] = {
    ["装备名称"] = _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["地狱火卡牌"],
    ["持续时间"] = 1,
    ["间隔"] = 0.5,
    ["生命恢复百分比"] = 0.1,
    ["固定生命恢复"] = 200,
    ["魔法恢复比例"] = 0.5,
    BuffID = "C027",
    ["图标路径"] = "ReplaceableTextures\\CommandButtons\\BTNRejuvenation.blp",
    ["特效路径"] = "Abilities\\Spells\\NightElf\\Rejuvenation\\RejuvenationTarget.mdl",
    ["特效挂点"] = "origin",
    ["特效键"] = "地狱火卡牌"
}
____exports["指挥之剑配置"] = {["装备名称"] = _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["指挥之剑"], ["持续时间"] = 5, ["易伤百分比"] = 15}
____exports["使者魔轮配置"] = {
    ["装备名称"] = _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["使者魔轮"],
    ["消耗魔法比例"] = 0.25,
    ["作用半径"] = 300,
    ["持续时间"] = 10,
    ["特效路径"] = "war3mapImported\\Energy Shield.mdl",
    ["特效尺寸"] = 6.5
}
____exports["破血之戒配置"] = {
    ["装备名称"] = _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["破血之戒"],
    ["充能时间"] = 0.5,
    ["作用范围"] = 400,
    ["基础伤害"] = 1000,
    ["力量系数"] = 3,
    ["施法特效路径"] = "war3mapImported\\CorpseBomb.mdl",
    ["选取特效路径"] = "war3mapImported\\CrimsonWake.mdl"
}
____exports["远古毒咒护符配置"] = {
    ["装备名称"] = _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["远古毒咒护符"],
    ["作用范围"] = 350,
    ["力量系数"] = 2,
    ["特效路径"] = "war3mapImported\\[AKE]war3AKE.com - 6158867876016216905550325.mdl",
    ["特效持续时间"] = 2
}
____exports["史莱姆粘液瓶配置"] = {["装备名称"] = _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["史莱姆粘液瓶"], ["攻速减幅"] = 0.5, ["移速减幅"] = 0.5, ["持续时间"] = 5}
____exports["地精钥匙配置"] = {["装备名称"] = _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["地精钥匙"]}
____exports["祭祀之杖配置"] = {["装备名称"] = _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["祭祀之杖"], ["生命消耗"] = 200}
____exports["幽冥法杖配置"] = {
    ["装备名称"] = _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["幽冥法杖"],
    ["斩杀生命比例"] = 0.1,
    ["特效路径"] = "war3mapImported\\blood2022720203813.mdx",
    ["特效挂点"] = "overhead",
    ["特效持续时间"] = 2
}
____exports["熔岩恶魔之灵眼配置"] = {
    ["装备名称"] = _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["熔岩恶魔之灵眼"],
    ["闪电持续时间"] = 1,
    ["魔力之焰闪电"] = "MBUR",
    ["死亡之指闪电"] = "AFOD",
    ["魔法消耗比例"] = 0.3,
    ["伤害魔法系数"] = 2,
    ["命中率削减"] = 1,
    ["命中率恢复延迟"] = 1,
    ["特效路径"] = "war3mapImported\\[AKE]war3AKE.com - 2477249006985228464610934.mdx",
    ["特效挂点"] = "overhead",
    ["特效持续时间"] = 2.5
}
____exports["暗幽亡戒配置"] = {
    ["装备名称"] = _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["暗幽亡戒"],
    ["魔法转移比例"] = 0.2,
    ["特效路径"] = "Abilities\\Spells\\Other\\Drain\\ManaDrainCaster.mdl",
    ["特效挂点"] = "origin",
    ["特效持续时间"] = 2
}
____exports["使者魔炉配置"] = {
    ["装备名称"] = _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["使者魔炉"],
    ["作用范围"] = 500,
    ["命中率削减"] = 1,
    ["恢复延迟"] = 1,
    ["特效路径"] = "Abilities\\Weapons\\WitchDoctorMissile\\WitchDoctorMissile.mdl",
    ["特效挂点"] = "overhead",
    ["特效放大周期"] = 0.02,
    ["特效放大次数"] = 30,
    ["特效放大基值"] = 0.2
}
____exports["汭冥血杖配置"] = {
    ["装备名称"] = _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["汭冥血杖"],
    ["强化装备名称"] = _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["汭冥血杖强化"],
    ["普通等级上限"] = 30,
    ["强化等级上限"] = 35,
    ["普通生命恢复比例"] = 0.5,
    ["强化生命恢复比例"] = 1,
    ["强化魔法恢复比例"] = 0.35,
    ["恢复持续时间"] = 1,
    ["恢复间隔"] = 1,
    ["作用范围"] = 400,
    ["伤害生命系数"] = 1,
    ["特效路径"] = "war3mapImported\\CorpseBomb.mdl",
    ["特效挂点"] = "overhead",
    ["特效持续时间"] = 2,
    BuffID = "C027",
    ["图标路径"] = "ReplaceableTextures\\CommandButtons\\BTNRejuvenation.blp",
    ["恢复特效路径"] = "Abilities\\Spells\\NightElf\\Rejuvenation\\RejuvenationTarget.mdl",
    ["恢复特效挂点"] = "origin",
    ["恢复特效键"] = "汭冥血杖"
}
____exports["使者精神魔杖配置"] = {["装备名称"] = _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["使者精神魔杖"], ["存储字段"] = "使者精神魔杖", ["存储持续时间"] = 3600, ["召唤持续时间"] = 20}
____exports["史诗远古魔刃配置"] = {
    ["装备名称"] = _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["史诗远古魔刃"],
    ["周期"] = 0.02,
    ["最大次数"] = 34,
    ["每次距离"] = 33.33,
    ["作用范围"] = 333,
    ["力量系数"] = 3,
    ["眩晕时间"] = 1,
    ["特效路径"] = "war3mapImported\\[AKE]war3AKE.com - 6158867876016216905550325.mdl",
    ["特效持续时间"] = 0.6
}
____exports["焰虚宝珠配置"] = {
    ["装备名称"] = _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["焰虚宝珠"],
    ["特效路径"] = "Abilities\\Spells\\Orc\\HealingWave\\HealingWaveTarget.mdl",
    ["特效挂点"] = "overhead",
    ["特效持续时间"] = 2,
    ["特效大小"] = 2
}
____exports["先祖之狱杖配置"] = {
    ["装备名称"] = _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["先祖之狱杖"],
    ["特效路径"] = "war3mapImported\\[AKE]war3AKE.com - 0207194794849369616067742.mdx",
    ["特效持续时间"] = 1,
    ["眩晕时间"] = 0.5,
    ["延迟伤害时间"] = 0.21,
    ["伤害生命比例"] = 0.03
}
____exports["咆哮之心配置"] = {
    ["装备名称"] = _____4E3B_52A8_6280_80FD_88C5_5907_540D_79F0["咆哮之心"],
    ["力量转攻击除数"] = 10,
    ["周期"] = 1,
    ["次数"] = 5,
    ["每跳伤害"] = 250,
    ["特效路径"] = "Abilities\\Spells\\NightElf\\BattleRoar\\RoarCaster.mdl",
    ["特效持续时间"] = 1
}
return ____exports
