--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local _____4E3B_52A8_6280_80FD_7269_54C1ID = require("系统.02．物品系统.15．装备技能.03．主动技能.00．公共.01．主动技能物品ID")
local ____05_FF0E_7834_8840_4E4B_6212 = require("系统.02．物品系统.15．装备技能.00．物品.05．破血之戒")
local _____5904_7406_7834_8840_4E4B_6212_4F7F_7528 = ____05_FF0E_7834_8840_4E4B_6212["处理破血之戒使用"]
local ____10_FF0E_8FDC_53E4_6BD2_5492_62A4_7B26 = require("系统.02．物品系统.15．装备技能.00．物品.10．远古毒咒护符")
local _____5904_7406_8FDC_53E4_6BD2_5492_62A4_7B26_4F7F_7528 = ____10_FF0E_8FDC_53E4_6BD2_5492_62A4_7B26["处理远古毒咒护符使用"]
local ____11_FF0E_53F2_83B1_59C6_7C98_6DB2_74F6 = require("系统.02．物品系统.15．装备技能.00．物品.11．史莱姆粘液瓶")
local _____5904_7406_53F2_83B1_59C6_7C98_6DB2_74F6_4F7F_7528 = ____11_FF0E_53F2_83B1_59C6_7C98_6DB2_74F6["处理史莱姆粘液瓶使用"]
local ____12_FF0E_5730_7CBE_94A5_5319 = require("系统.02．物品系统.15．装备技能.00．物品.12．地精钥匙")
local _____5904_7406_5730_7CBE_94A5_5319_4F7F_7528 = ____12_FF0E_5730_7CBE_94A5_5319["处理地精钥匙使用"]
local ____13_FF0E_796D_7940_4E4B_6756 = require("系统.02．物品系统.15．装备技能.00．物品.13．祭祀之杖")
local _____5904_7406_796D_7940_4E4B_6756_4F7F_7528 = ____13_FF0E_796D_7940_4E4B_6756["处理祭祀之杖使用"]
local ____14_FF0E_5E7D_51A5_6CD5_6756 = require("系统.02．物品系统.15．装备技能.00．物品.14．幽冥法杖")
local _____5904_7406_5E7D_51A5_6CD5_6756_4F7F_7528 = ____14_FF0E_5E7D_51A5_6CD5_6756["处理幽冥法杖使用"]
local ____15_FF0E_7194_5CA9_6076_9B54_4E4B_7075_773C = require("系统.02．物品系统.15．装备技能.00．物品.15．熔岩恶魔之灵眼")
local _____5904_7406_7194_5CA9_6076_9B54_4E4B_7075_773C_4F7F_7528 = ____15_FF0E_7194_5CA9_6076_9B54_4E4B_7075_773C["处理熔岩恶魔之灵眼使用"]
local ____16_FF0E_6697_5E7D_4EA1_6212 = require("系统.02．物品系统.15．装备技能.00．物品.16．暗幽亡戒")
local _____5904_7406_6697_5E7D_4EA1_6212_4F7F_7528 = ____16_FF0E_6697_5E7D_4EA1_6212["处理暗幽亡戒使用"]
local ____17_FF0E_4F7F_8005_9B54_7089 = require("系统.02．物品系统.15．装备技能.00．物品.17．使者魔炉")
local _____5904_7406_4F7F_8005_9B54_7089_4F7F_7528 = ____17_FF0E_4F7F_8005_9B54_7089["处理使者魔炉使用"]
local ____18_FF0E_6C6D_51A5_8840_6756 = require("系统.02．物品系统.15．装备技能.00．物品.18．汭冥血杖")
local _____5904_7406_6C6D_51A5_8840_6756_4F7F_7528 = ____18_FF0E_6C6D_51A5_8840_6756["处理汭冥血杖使用"]
local ____19_FF0E_6C6D_51A5_8840_6756_5F3A_5316 = require("系统.02．物品系统.15．装备技能.00．物品.19．汭冥血杖强化")
local _____5904_7406_6C6D_51A5_8840_6756_5F3A_5316_4F7F_7528 = ____19_FF0E_6C6D_51A5_8840_6756_5F3A_5316["处理汭冥血杖强化使用"]
local ____20_FF0E_4F7F_8005_7CBE_795E_9B54_6756 = require("系统.02．物品系统.15．装备技能.00．物品.20．使者精神魔杖")
local _____5904_7406_4F7F_8005_7CBE_795E_9B54_6756_4F7F_7528 = ____20_FF0E_4F7F_8005_7CBE_795E_9B54_6756["处理使者精神魔杖使用"]
local ____21_FF0E_53F2_8BD7_8FDC_53E4_9B54_5203 = require("系统.02．物品系统.15．装备技能.00．物品.21．史诗远古魔刃")
local _____5904_7406_53F2_8BD7_8FDC_53E4_9B54_5203_4F7F_7528 = ____21_FF0E_53F2_8BD7_8FDC_53E4_9B54_5203["处理史诗远古魔刃使用"]
local ____22_FF0E_7130_865A_5B9D_73E0 = require("系统.02．物品系统.15．装备技能.00．物品.22．焰虚宝珠")
local _____5904_7406_7130_865A_5B9D_73E0_4F7F_7528 = ____22_FF0E_7130_865A_5B9D_73E0["处理焰虚宝珠使用"]
local ____23_FF0E_5148_7956_4E4B_72F1_6756 = require("系统.02．物品系统.15．装备技能.00．物品.23．先祖之狱杖")
local _____5904_7406_5148_7956_4E4B_72F1_6756_4F7F_7528 = ____23_FF0E_5148_7956_4E4B_72F1_6756["处理先祖之狱杖使用"]
local ____24_FF0E_5486_54EE_4E4B_5FC3 = require("系统.02．物品系统.15．装备技能.00．物品.24．咆哮之心")
local _____5904_7406_5486_54EE_4E4B_5FC3_4F7F_7528 = ____24_FF0E_5486_54EE_4E4B_5FC3["处理咆哮之心使用"]
local ____25_FF0E_6307_6325_4E4B_5251 = require("系统.02．物品系统.15．装备技能.00．物品.25．指挥之剑")
local _____5904_7406_6307_6325_4E4B_5251_4F7F_7528 = ____25_FF0E_6307_6325_4E4B_5251["处理指挥之剑使用"]
local ____26_FF0E_4F7F_8005_9B54_8F6E = require("系统.02．物品系统.15．装备技能.00．物品.26．使者魔轮")
local _____5904_7406_4F7F_8005_9B54_8F6E_4F7F_7528 = ____26_FF0E_4F7F_8005_9B54_8F6E["处理使者魔轮使用"]
local ____require_result_0 = require("系统.00．核心系统.01．事件中心.13．物品技能事件中心")
local _____6CE8_518C_7269_54C1_6280_80FD_4E8B_4EF6_76D1_542C = ____require_result_0["注册物品技能事件监听"]
local jass = require("jass.common")
local IsUnitType = jass.IsUnitType
local GetItemTypeId = jass.GetItemTypeId
local UNIT_TYPE_HERO = jass.UNIT_TYPE_HERO
local _____5DF2_521D_59CB_5316_7269_54C1_4E3B_52A8_6280_80FD_6838_5FC3 = false
local function _____65BD_6CD5_5355_4F4D_662F_82F1_96C4(_____4E0A_4E0B_6587)
    local _____5355_4F4D = _____4E0A_4E0B_6587["施法单位"]
    return _____5355_4F4D ~= nil and _____5355_4F4D ~= 0 and IsUnitType(_____5355_4F4D, UNIT_TYPE_HERO) == true
end
local function ____on_7269_54C1_4E3B_52A8_6280_80FD_751F_6548(_____4E0A_4E0B_6587)
    if not _____65BD_6CD5_5355_4F4D_662F_82F1_96C4(_____4E0A_4E0B_6587) then
        return
    end
    if _____4E0A_4E0B_6587["物品"] == nil or _____4E0A_4E0B_6587["物品"] == 0 then
        return
    end
    local _____7269_54C1_7C7B_578BID = GetItemTypeId(_____4E0A_4E0B_6587["物品"])
    repeat
        local ____switch6 = _____7269_54C1_7C7B_578BID
        local ____cond6 = ____switch6 == _____4E3B_52A8_6280_80FD_7269_54C1ID["破血之戒物品ID"]
        if ____cond6 then
            _____5904_7406_7834_8840_4E4B_6212_4F7F_7528(_____4E0A_4E0B_6587)
            break
        end
        ____cond6 = ____cond6 or ____switch6 == _____4E3B_52A8_6280_80FD_7269_54C1ID["远古毒咒护符物品ID"]
        if ____cond6 then
            _____5904_7406_8FDC_53E4_6BD2_5492_62A4_7B26_4F7F_7528(_____4E0A_4E0B_6587)
            break
        end
        ____cond6 = ____cond6 or ____switch6 == _____4E3B_52A8_6280_80FD_7269_54C1ID["史莱姆粘液瓶物品ID"]
        if ____cond6 then
            _____5904_7406_53F2_83B1_59C6_7C98_6DB2_74F6_4F7F_7528(_____4E0A_4E0B_6587)
            break
        end
        ____cond6 = ____cond6 or ____switch6 == _____4E3B_52A8_6280_80FD_7269_54C1ID["地精钥匙物品ID"]
        if ____cond6 then
            _____5904_7406_5730_7CBE_94A5_5319_4F7F_7528(_____4E0A_4E0B_6587)
            break
        end
        ____cond6 = ____cond6 or ____switch6 == _____4E3B_52A8_6280_80FD_7269_54C1ID["祭祀之杖物品ID"]
        if ____cond6 then
            _____5904_7406_796D_7940_4E4B_6756_4F7F_7528(_____4E0A_4E0B_6587)
            break
        end
        ____cond6 = ____cond6 or ____switch6 == _____4E3B_52A8_6280_80FD_7269_54C1ID["幽冥法杖物品ID"]
        if ____cond6 then
            _____5904_7406_5E7D_51A5_6CD5_6756_4F7F_7528(_____4E0A_4E0B_6587)
            break
        end
        ____cond6 = ____cond6 or ____switch6 == _____4E3B_52A8_6280_80FD_7269_54C1ID["熔岩恶魔之灵眼物品ID"]
        if ____cond6 then
            _____5904_7406_7194_5CA9_6076_9B54_4E4B_7075_773C_4F7F_7528(_____4E0A_4E0B_6587)
            break
        end
        ____cond6 = ____cond6 or ____switch6 == _____4E3B_52A8_6280_80FD_7269_54C1ID["暗幽亡戒物品ID"]
        if ____cond6 then
            _____5904_7406_6697_5E7D_4EA1_6212_4F7F_7528(_____4E0A_4E0B_6587)
            break
        end
        ____cond6 = ____cond6 or ____switch6 == _____4E3B_52A8_6280_80FD_7269_54C1ID["使者魔炉物品ID"]
        if ____cond6 then
            _____5904_7406_4F7F_8005_9B54_7089_4F7F_7528(_____4E0A_4E0B_6587)
            break
        end
        ____cond6 = ____cond6 or ____switch6 == _____4E3B_52A8_6280_80FD_7269_54C1ID["汭冥血杖物品ID"]
        if ____cond6 then
            _____5904_7406_6C6D_51A5_8840_6756_4F7F_7528(_____4E0A_4E0B_6587)
            break
        end
        ____cond6 = ____cond6 or ____switch6 == _____4E3B_52A8_6280_80FD_7269_54C1ID["汭冥血杖强化物品ID"]
        if ____cond6 then
            _____5904_7406_6C6D_51A5_8840_6756_5F3A_5316_4F7F_7528(_____4E0A_4E0B_6587)
            break
        end
        ____cond6 = ____cond6 or ____switch6 == _____4E3B_52A8_6280_80FD_7269_54C1ID["使者精神魔杖物品ID"]
        if ____cond6 then
            _____5904_7406_4F7F_8005_7CBE_795E_9B54_6756_4F7F_7528(_____4E0A_4E0B_6587)
            break
        end
        ____cond6 = ____cond6 or ____switch6 == _____4E3B_52A8_6280_80FD_7269_54C1ID["史诗远古魔刃物品ID"]
        if ____cond6 then
            _____5904_7406_53F2_8BD7_8FDC_53E4_9B54_5203_4F7F_7528(_____4E0A_4E0B_6587)
            break
        end
        ____cond6 = ____cond6 or ____switch6 == _____4E3B_52A8_6280_80FD_7269_54C1ID["焰虚宝珠物品ID"]
        if ____cond6 then
            _____5904_7406_7130_865A_5B9D_73E0_4F7F_7528(_____4E0A_4E0B_6587)
            break
        end
        ____cond6 = ____cond6 or ____switch6 == _____4E3B_52A8_6280_80FD_7269_54C1ID["先祖之狱杖物品ID"]
        if ____cond6 then
            _____5904_7406_5148_7956_4E4B_72F1_6756_4F7F_7528(_____4E0A_4E0B_6587)
            break
        end
        ____cond6 = ____cond6 or ____switch6 == _____4E3B_52A8_6280_80FD_7269_54C1ID["咆哮之心物品ID"]
        if ____cond6 then
            _____5904_7406_5486_54EE_4E4B_5FC3_4F7F_7528(_____4E0A_4E0B_6587)
            break
        end
        ____cond6 = ____cond6 or ____switch6 == _____4E3B_52A8_6280_80FD_7269_54C1ID["指挥之剑物品ID"]
        if ____cond6 then
            _____5904_7406_6307_6325_4E4B_5251_4F7F_7528(_____4E0A_4E0B_6587)
            break
        end
        ____cond6 = ____cond6 or ____switch6 == _____4E3B_52A8_6280_80FD_7269_54C1ID["使者魔轮物品ID"]
        if ____cond6 then
            _____5904_7406_4F7F_8005_9B54_8F6E_4F7F_7528(_____4E0A_4E0B_6587)
            break
        end
    until true
end
____exports["初始化物品主动技能核心"] = function()
    if _____5DF2_521D_59CB_5316_7269_54C1_4E3B_52A8_6280_80FD_6838_5FC3 then
        return
    end
    _____5DF2_521D_59CB_5316_7269_54C1_4E3B_52A8_6280_80FD_6838_5FC3 = true
    _____6CE8_518C_7269_54C1_6280_80FD_4E8B_4EF6_76D1_542C(____on_7269_54C1_4E3B_52A8_6280_80FD_751F_6548)
end
return ____exports
