--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____03_FF0E_88AB_52A8_673A_5236 = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.07．里科特.03．被动机制")
local _____6CE8_518C_91CC_79D1_7279_88AB_52A8_673A_5236 = ____03_FF0E_88AB_52A8_673A_5236["注册里科特被动机制"]
local ____04_FF0E_56DB_91CD_98CE_5203 = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.07．里科特.04．四重风刃")
local _____6CE8_518C_91CC_79D1_7279_56DB_91CD_98CE_5203 = ____04_FF0E_56DB_91CD_98CE_5203["注册里科特四重风刃"]
local ____05_FF0E_8FFD_51FB_98CE_5203 = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.07．里科特.05．追击风刃")
local _____6CE8_518C_91CC_79D1_7279_8FFD_51FB_98CE_5203 = ____05_FF0E_8FFD_51FB_98CE_5203["注册里科特追击风刃"]
local ____06_FF0E_795E_98CE_62A4_4F53_4E0E_7C89_788E = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.07．里科特.06．神风护体与粉碎")
local _____6CE8_518C_91CC_79D1_7279_795E_98CE_62A4_4F53_4E0E_7C89_788E = ____06_FF0E_795E_98CE_62A4_4F53_4E0E_7C89_788E["注册里科特神风护体与粉碎"]
local ____07_FF0E_6E6E_706D_4E4B_70AE = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.07．里科特.07．湮灭之炮")
local _____6CE8_518C_91CC_79D1_7279_6E6E_706D_4E4B_70AE = ____07_FF0E_6E6E_706D_4E4B_70AE["注册里科特湮灭之炮"]
local ____08_FF0E_6E6E_706D_4E4B_98CE = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.07．里科特.08．湮灭之风")
local _____6CE8_518C_91CC_79D1_7279_6E6E_706D_4E4B_98CE = ____08_FF0E_6E6E_706D_4E4B_98CE["注册里科特湮灭之风"]
local ____09_FF0E_7834_9B54_53CD_51FB = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.07．里科特.09．破魔反击")
local _____6CE8_518C_91CC_79D1_7279_7834_9B54_53CD_51FB = ____09_FF0E_7834_9B54_53CD_51FB["注册里科特破魔反击"]
____exports["注册里科特技能结构"] = function()
    _____6CE8_518C_91CC_79D1_7279_88AB_52A8_673A_5236()
    _____6CE8_518C_91CC_79D1_7279_56DB_91CD_98CE_5203()
    _____6CE8_518C_91CC_79D1_7279_8FFD_51FB_98CE_5203()
    _____6CE8_518C_91CC_79D1_7279_795E_98CE_62A4_4F53_4E0E_7C89_788E()
    _____6CE8_518C_91CC_79D1_7279_6E6E_706D_4E4B_70AE()
    _____6CE8_518C_91CC_79D1_7279_6E6E_706D_4E4B_98CE()
    _____6CE8_518C_91CC_79D1_7279_7834_9B54_53CD_51FB()
end
return ____exports
