--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____19_FF0E_6218_6597_516C_5171_5DE5_5177 = require("系统.03．技能系统.00．技能模板+函数.02．通用函数.19．战斗公共工具")
local stringToFourCC = ____19_FF0E_6218_6597_516C_5171_5DE5_5177.stringToFourCC
local _____5355_4F4D_6709_6548 = ____19_FF0E_6218_6597_516C_5171_5DE5_5177["单位有效"]
local _____8DDD_79BB_5E73_65B9XY = ____19_FF0E_6218_6597_516C_5171_5DE5_5177["距离平方XY"]
local _____8DDD_79BBXY = ____19_FF0E_6218_6597_516C_5171_5DE5_5177["距离XY"]
local _____4E24_70B9_89D2_5EA6 = ____19_FF0E_6218_6597_516C_5171_5DE5_5177["两点角度"]
local _____5355_4F4D_95F4_89D2_5EA6 = ____19_FF0E_6218_6597_516C_5171_5DE5_5177["单位间角度"]
local _____6781_5750_6807X = ____19_FF0E_6218_6597_516C_5171_5DE5_5177["极坐标X"]
local _____6781_5750_6807Y = ____19_FF0E_6218_6597_516C_5171_5DE5_5177["极坐标Y"]
local _____9650_5236_6570_503C = ____19_FF0E_6218_6597_516C_5171_5DE5_5177["限制数值"]
local _____70B9_5230_7EBF_6BB5_8DDD_79BB_5E73_65B9 = ____19_FF0E_6218_6597_516C_5171_5DE5_5177["点到线段距离平方"]
local ____require_result_0 = require("系统.03．技能系统.00．技能模板+函数.02．通用函数.00．单位动画等待")
local _____64AD_653E_9650_65F6_5355_4F4D_52A8_753B = ____require_result_0["播放限时单位动画"]
local _____91CC_79D1_7279_6218_6597_5F85_673A_52A8_753B_7F16_53F7 = 3
local _____91CC_79D1_7279_65BD_6CD5_8D77_624B_52A8_753B_7F16_53F7 = 8
local _____91CC_79D1_7279_65BD_6CD5_7EF4_6301_52A8_753B_7F16_53F7 = 9
____exports.stringToFourCC = stringToFourCC
____exports["单位有效"] = _____5355_4F4D_6709_6548
____exports["距离平方XY"] = _____8DDD_79BB_5E73_65B9XY
____exports["距离XY"] = _____8DDD_79BBXY
____exports["极坐标X"] = _____6781_5750_6807X
____exports["极坐标Y"] = _____6781_5750_6807Y
____exports["限制数值"] = _____9650_5236_6570_503C
____exports["点到线段距离平方"] = _____70B9_5230_7EBF_6BB5_8DDD_79BB_5E73_65B9
____exports["取坐标角度"] = _____4E24_70B9_89D2_5EA6
____exports["取单位间角度"] = _____5355_4F4D_95F4_89D2_5EA6
____exports["播放里科特限时动作"] = function(unit, _____52A8_753B_7F16_53F7, _____52A8_753B_901F_5EA6, _____6301_7EED_79D2)
    return _____64AD_653E_9650_65F6_5355_4F4D_52A8_753B({
        ["单位"] = unit,
        ["动画编号"] = _____52A8_753B_7F16_53F7,
        ["动画速度"] = _____52A8_753B_901F_5EA6,
        ["持续秒"] = _____6301_7EED_79D2,
        ["恢复动画编号"] = _____91CC_79D1_7279_6218_6597_5F85_673A_52A8_753B_7F16_53F7
    })
end
____exports["播放里科特施法维持动作"] = function(unit, _____603B_6301_7EED_79D2, _____52A8_753B_901F_5EA6)
    local _____8D77_624B_539F_59CB_6301_7EED_79D2 = 2.167 / _____52A8_753B_901F_5EA6
    local _____8D77_624B_6301_7EED_79D2 = _____603B_6301_7EED_79D2 < _____8D77_624B_539F_59CB_6301_7EED_79D2 and _____603B_6301_7EED_79D2 or _____8D77_624B_539F_59CB_6301_7EED_79D2
    return _____64AD_653E_9650_65F6_5355_4F4D_52A8_753B({
        ["单位"] = unit,
        ["动画编号"] = _____91CC_79D1_7279_65BD_6CD5_8D77_624B_52A8_753B_7F16_53F7,
        ["动画速度"] = _____52A8_753B_901F_5EA6,
        ["持续秒"] = _____8D77_624B_6301_7EED_79D2,
        ["恢复动画编号"] = _____603B_6301_7EED_79D2 > _____8D77_624B_6301_7EED_79D2 and _____91CC_79D1_7279_65BD_6CD5_7EF4_6301_52A8_753B_7F16_53F7 or _____91CC_79D1_7279_6218_6597_5F85_673A_52A8_753B_7F16_53F7,
        ["完成回调"] = function()
            local _____5269_4F59_79D2 = _____603B_6301_7EED_79D2 - _____8D77_624B_6301_7EED_79D2
            if _____5269_4F59_79D2 <= 0 then
                return
            end
            _____64AD_653E_9650_65F6_5355_4F4D_52A8_753B({
                ["单位"] = unit,
                ["动画编号"] = _____91CC_79D1_7279_65BD_6CD5_7EF4_6301_52A8_753B_7F16_53F7,
                ["动画速度"] = 1,
                ["持续秒"] = _____5269_4F59_79D2,
                ["恢复动画编号"] = _____91CC_79D1_7279_6218_6597_5F85_673A_52A8_753B_7F16_53F7
            })
        end
    })
end
return ____exports
