--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
---
-- @noSelfInFile
____exports["亚伦柯斯单位技能配置"] = {
    BossKey = "SleepingHeroAronkos",
    ["单位ID"] = "U006",
    ["单位名称"] = "沉睡英魂·亚伦柯斯",
    ["基础对象ID"] = "Udea",
    ["模型路径"] = "war3mapImported\\UndeadArthas.mdl",
    ["技能壳"] = {["亡冥英斩"] = "AT00", ["英灵陨星"] = "AN00"},
    ["旧技能ID"] = {["亡冥英斩"] = "A0F4", ["英灵陨星"] = "A0F5"},
    ["主动技能提示"] = {{["技能ID"] = "AT00", ["提示"] = "亡冥英斩", ["扩展提示"] = "锁定目标方向突进，以亡灵剑气贯穿路径上的敌人。"}, {["技能ID"] = "AN00", ["提示"] = "英灵陨星", ["扩展提示"] = "在周围连续唤下多轮英灵陨星，落点预警后爆发。"}},
    ["正式预置"] = {X = 8322.9, Y = -14452.7, ["朝向"] = 270},
    ["正式场地"] = {
        ["中心X"] = 8400,
        ["中心Y"] = -14973,
        ["左边界"] = 6848,
        ["右边界"] = 9952,
        ["下边界"] = -16256,
        ["上边界"] = -13690
    },
    ["通用测试场中心"] = {X = -540.6, Y = -2495.2},
    ["当前状态"] = {["结构已建立"] = true, ["技能已迁移"] = false, ["技能已注册"] = false}
}
return ____exports
