--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____03_FF0E_4EA1_51A5_82F1_65A9 = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.08．沉睡英魂亚伦柯斯.03．亡冥英斩")
local _____4EA1_51A5_82F1_65A9_8FC1_79FB_72B6_6001 = ____03_FF0E_4EA1_51A5_82F1_65A9["亡冥英斩迁移状态"]
local ____04_FF0E_82F1_7075_9668_661F = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.08．沉睡英魂亚伦柯斯.04．英灵陨星")
local _____82F1_7075_9668_661F_8FC1_79FB_72B6_6001 = ____04_FF0E_82F1_7075_9668_661F["英灵陨星迁移状态"]
local ____07_FF0E_4EA1_8005_51DD_89C6 = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.08．沉睡英魂亚伦柯斯.07．亡者凝视")
local _____4EA1_8005_51DD_89C6_6280_80FD_72B6_6001 = ____07_FF0E_4EA1_8005_51DD_89C6["亡者凝视技能状态"]
local ____08_FF0E_65E7_8A93_5893_7891 = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.08．沉睡英魂亚伦柯斯.08．旧誓墓碑")
local _____65E7_8A93_5893_7891_673A_5236_72B6_6001 = ____08_FF0E_65E7_8A93_5893_7891["旧誓墓碑机制状态"]
local ____09_FF0E_4E0D_706D_519B_9B42 = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.08．沉睡英魂亚伦柯斯.09．不灭军魂")
local _____4E0D_706D_519B_9B42_673A_5236_72B6_6001 = ____09_FF0E_4E0D_706D_519B_9B42["不灭军魂机制状态"]
local ____10_FF0E_6280_80FD_8C03_5EA6 = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.08．沉睡英魂亚伦柯斯.10．技能调度")
local _____4E9A_4F26_67EF_65AF_6280_80FD_8C03_5EA6_72B6_6001 = ____10_FF0E_6280_80FD_8C03_5EA6["亚伦柯斯技能调度状态"]
____exports["亚伦柯斯技能入口状态"] = {["已注册"] = true, ["技能"] = {_____4EA1_51A5_82F1_65A9_8FC1_79FB_72B6_6001, _____82F1_7075_9668_661F_8FC1_79FB_72B6_6001, _____4EA1_8005_51DD_89C6_6280_80FD_72B6_6001}, ["阶段机制"] = {_____65E7_8A93_5893_7891_673A_5236_72B6_6001, _____4E0D_706D_519B_9B42_673A_5236_72B6_6001}, ["调度"] = _____4E9A_4F26_67EF_65AF_6280_80FD_8C03_5EA6_72B6_6001}
return ____exports
