--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
---
-- @noSelfInFile
____exports["菲利斯单位技能配置"] = {
    ["单位ID"] = "N05T",
    ["单位名称"] = "菲利斯",
    ["Boss单位ID"] = "N05T",
    ["技能壳"] = {
        ["领袖光环"] = "A0LQ",
        ["剑魂杀"] = "A0LP",
        ["剑气灵斩"] = "A0LR",
        ["全力封印斩"] = "A0LS",
        ["异形化"] = "A0LT"
    },
    ["主动技能提示"] = {{["技能ID"] = "A0LP", ["提示"] = "剑魂杀", ["扩展提示"] = "蓄力后释放剑气狼，命中后在终点化为小狼或大狼追击玩家。"}, {["技能ID"] = "A0LR", ["提示"] = "剑气灵斩", ["扩展提示"] = "向前方劈出剑气并留下侵蚀区域，持续伤害并汲取魔法。"}, {["技能ID"] = "A0LS", ["提示"] = "全力封印斩", ["扩展提示"] = "锁定 QWER 全冷却玩家，扣除魔法并眩晕。"}, {["技能ID"] = "A0LT", ["提示"] = "异形化", ["扩展提示"] = "消耗满魔法进入强化形态，刷新剑气灵斩并牵引附近玩家。"}},
    ["广播持续时间Ms"] = 4200,
    ["台词"] = {
        ["开场"] = {"军团仍会听从我的号令。"},
        ["领袖光环"] = {"不要退，跟随我的剑。"},
        ["剑魂杀"] = {"剑魂，撕开他们。"},
        ["剑气灵斩"] = {"这一斩，会留下伤口。"},
        ["全力封印斩"] = {"你们的技能已经沉默。"},
        ["异形化"] = {"力量，正在重塑我的躯体。"},
        ["死亡"] = {"这只是...一次失利..."}
    }
}
return ____exports
