--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____03_FF0E_9886_8896_5149_73AF = require("系统.03．技能系统.05．单位技能.03．Boss技能.08．菲利斯.03．领袖光环")
local _____6CE8_518C_83F2_5229_65AF_9886_8896_5149_73AF = ____03_FF0E_9886_8896_5149_73AF["注册菲利斯领袖光环"]
local ____04_FF0E_5251_9B42_6740 = require("系统.03．技能系统.05．单位技能.03．Boss技能.08．菲利斯.04．剑魂杀")
local _____6CE8_518C_83F2_5229_65AF_5251_9B42_6740 = ____04_FF0E_5251_9B42_6740["注册菲利斯剑魂杀"]
local ____05_FF0E_5251_6C14_7075_65A9 = require("系统.03．技能系统.05．单位技能.03．Boss技能.08．菲利斯.05．剑气灵斩")
local _____6CE8_518C_83F2_5229_65AF_5251_6C14_7075_65A9 = ____05_FF0E_5251_6C14_7075_65A9["注册菲利斯剑气灵斩"]
local ____06_FF0E_5168_529B_5C01_5370_65A9 = require("系统.03．技能系统.05．单位技能.03．Boss技能.08．菲利斯.06．全力封印斩")
local _____6CE8_518C_83F2_5229_65AF_5168_529B_5C01_5370_65A9 = ____06_FF0E_5168_529B_5C01_5370_65A9["注册菲利斯全力封印斩"]
local ____07_FF0E_5F02_5F62_5316 = require("系统.03．技能系统.05．单位技能.03．Boss技能.08．菲利斯.07．异形化")
local _____6CE8_518C_83F2_5229_65AF_5F02_5F62_5316 = ____07_FF0E_5F02_5F62_5316["注册菲利斯异形化"]
____exports["注册菲利斯技能结构"] = function()
    _____6CE8_518C_83F2_5229_65AF_9886_8896_5149_73AF()
    _____6CE8_518C_83F2_5229_65AF_5251_9B42_6740()
    _____6CE8_518C_83F2_5229_65AF_5251_6C14_7075_65A9()
    _____6CE8_518C_83F2_5229_65AF_5168_529B_5C01_5370_65A9()
    _____6CE8_518C_83F2_5229_65AF_5F02_5F62_5316()
end
return ____exports
