--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
---
-- @noSelfInFile
____exports["安兹乌尔恭数值与表现配置"] = {["普通技能"] = {["现实断裂连续数量上限"] = 2, ["光辉翠绿体持续秒"] = 8}, ["阶段技能"] = {
    ["天空坠落施法最小秒"] = 4,
    ["天空坠落施法最大秒"] = 4.8,
    ["天空坠落回落最小秒"] = 5,
    ["天空坠落回落最大秒"] = 7,
    ["一切生命的终点倒计时秒"] = 12,
    ["生命锚点数量"] = 3
}, ["守护者模式"] = {
    ["雅儿贝德生命比例"] = 0.7,
    ["常驻护卫减伤"] = 0.35,
    ["低血护卫减伤"] = 0.15,
    ["雅儿贝德锁血比例"] = 0.1,
    ["守护者之职责预连接秒"] = 1,
    ["守护者之职责持续秒"] = 6,
    ["守护者之职责断裂距离"] = 900
}, ["表现资源"] = {
    ["黑金传送门特效路径"] = "",
    ["普通施法法阵特效路径"] = "",
    ["现实断裂特效路径"] = "",
    ["心脏掌握特效路径"] = "",
    ["高阶魔法箭特效路径"] = "",
    ["光辉翠绿体特效路径"] = "",
    ["时间停止特效路径"] = "",
    ["天空坠落天空法阵特效路径"] = "",
    ["天空坠落光柱特效路径"] = "",
    ["生命锚点特效路径"] = "",
    ["一切生命的终点倒计时特效路径"] = "",
    ["女妖哭嚎死亡波特效路径"] = "",
    ["挑战结束传送特效路径"] = ""
}}
return ____exports
