--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____03_FF0E_73B0_5B9E_65AD_88C2 = require("系统.03．技能系统.05．单位技能.03．Boss技能.03．异界Boss.03．安兹乌尔恭.03．现实断裂")
local _____73B0_5B9E_65AD_88C2_6280_80FD_72B6_6001 = ____03_FF0E_73B0_5B9E_65AD_88C2["现实断裂技能状态"]
local ____04_FF0E_5FC3_810F_638C_63E1 = require("系统.03．技能系统.05．单位技能.03．Boss技能.03．异界Boss.03．安兹乌尔恭.04．心脏掌握")
local _____5FC3_810F_638C_63E1_6280_80FD_72B6_6001 = ____04_FF0E_5FC3_810F_638C_63E1["心脏掌握技能状态"]
local ____05_FF0E_9AD8_9636_9B54_6CD5_7BAD = require("系统.03．技能系统.05．单位技能.03．Boss技能.03．异界Boss.03．安兹乌尔恭.05．高阶魔法箭")
local _____9AD8_9636_9B54_6CD5_7BAD_6280_80FD_72B6_6001 = ____05_FF0E_9AD8_9636_9B54_6CD5_7BAD["高阶魔法箭技能状态"]
local ____06_FF0E_5149_8F89_7FE0_7EFF_4F53 = require("系统.03．技能系统.05．单位技能.03．Boss技能.03．异界Boss.03．安兹乌尔恭.06．光辉翠绿体")
local _____5149_8F89_7FE0_7EFF_4F53_6280_80FD_72B6_6001 = ____06_FF0E_5149_8F89_7FE0_7EFF_4F53["光辉翠绿体技能状态"]
local ____07_FF0E_65F6_95F4_505C_6B62 = require("系统.03．技能系统.05．单位技能.03．Boss技能.03．异界Boss.03．安兹乌尔恭.07．时间停止")
local _____65F6_95F4_505C_6B62_6280_80FD_72B6_6001 = ____07_FF0E_65F6_95F4_505C_6B62["时间停止技能状态"]
local ____08_FF0E_9AD8_9636_4EA1_7075_53EC_5524 = require("系统.03．技能系统.05．单位技能.03．Boss技能.03．异界Boss.03．安兹乌尔恭.08．高阶亡灵召唤")
local _____9AD8_9636_4EA1_7075_53EC_5524_6280_80FD_72B6_6001 = ____08_FF0E_9AD8_9636_4EA1_7075_53EC_5524["高阶亡灵召唤技能状态"]
local ____09_FF0E_5929_7A7A_5760_843D = require("系统.03．技能系统.05．单位技能.03．Boss技能.03．异界Boss.03．安兹乌尔恭.09．天空坠落")
local _____5929_7A7A_5760_843D_6280_80FD_72B6_6001 = ____09_FF0E_5929_7A7A_5760_843D["天空坠落技能状态"]
local ____10_FF0E_4E00_5207_751F_547D_7684_7EC8_70B9 = require("系统.03．技能系统.05．单位技能.03．Boss技能.03．异界Boss.03．安兹乌尔恭.10．一切生命的终点")
local _____4E00_5207_751F_547D_7684_7EC8_70B9_6280_80FD_72B6_6001 = ____10_FF0E_4E00_5207_751F_547D_7684_7EC8_70B9["一切生命的终点技能状态"]
local ____11_FF0E_6280_80FD_8C03_5EA6 = require("系统.03．技能系统.05．单位技能.03．Boss技能.03．异界Boss.03．安兹乌尔恭.11．技能调度")
local _____5B89_5179_6280_80FD_8C03_5EA6_72B6_6001 = ____11_FF0E_6280_80FD_8C03_5EA6["安兹技能调度状态"]
local ____12_FF0E_5B88_62A4_8005_6A21_5F0F = require("系统.03．技能系统.05．单位技能.03．Boss技能.03．异界Boss.03．安兹乌尔恭.12．守护者模式")
local _____5B89_5179_5B88_62A4_8005_6A21_5F0F_72B6_6001 = ____12_FF0E_5B88_62A4_8005_6A21_5F0F["安兹守护者模式状态"]
local ____13_FF0E_6311_6218_5165_53E3_4E0E_6536_675F = require("系统.03．技能系统.05．单位技能.03．Boss技能.03．异界Boss.03．安兹乌尔恭.13．挑战入口与收束")
local _____5B89_5179_6311_6218_5165_53E3_4E0E_6536_675F_72B6_6001 = ____13_FF0E_6311_6218_5165_53E3_4E0E_6536_675F["安兹挑战入口与收束状态"]
____exports["安兹技能入口状态"] = {
    ["已注册"] = false,
    ["普通技能"] = {_____73B0_5B9E_65AD_88C2_6280_80FD_72B6_6001, _____5FC3_810F_638C_63E1_6280_80FD_72B6_6001, _____9AD8_9636_9B54_6CD5_7BAD_6280_80FD_72B6_6001, _____5149_8F89_7FE0_7EFF_4F53_6280_80FD_72B6_6001},
    ["阶段机制"] = {_____65F6_95F4_505C_6B62_6280_80FD_72B6_6001, _____9AD8_9636_4EA1_7075_53EC_5524_6280_80FD_72B6_6001, _____5929_7A7A_5760_843D_6280_80FD_72B6_6001, _____4E00_5207_751F_547D_7684_7EC8_70B9_6280_80FD_72B6_6001},
    ["调度"] = _____5B89_5179_6280_80FD_8C03_5EA6_72B6_6001,
    ["守护者模式"] = _____5B89_5179_5B88_62A4_8005_6A21_5F0F_72B6_6001,
    ["挑战入口与收束"] = _____5B89_5179_6311_6218_5165_53E3_4E0E_6536_675F_72B6_6001
}
return ____exports
