/** @noSelfInFile */

import type { 战斗启动属性配置 } from "../00．配置类型";
import { 默认Boss弱点数量基础值 } from "../00．配置类型";

export const 单位O002战斗启动属性配置: 战斗启动属性配置 = {
    归类: "Boss",
    单位ID: "O002",
    单位名: "黑暗恶魔军官",
    战斗音乐变量名: "gg_snd_battle01",
    胜利音乐变量名: "gg_snd_shengliBgm",
    地点变量名: "gg_rct______________088",
    转换场景: true,
    BS移动X轴: 28749.10,
    BS移动Y轴: 1788.90,
    玩家移动X轴: 27954.40,
    玩家移动Y轴: 974.60,
    弱点数量基础值: 默认Boss弱点数量基础值,
    弱点数量每层N增量: 0,
    天生弱点数: 1,
    额外随机弱点数: 1,
    斧弱: true,
    器弱伤害需求生命百分比: 0.03,
    护盾基础值: 5,
    护盾每层N增量: 2,
  };
