/** @noSelfInFile */

import type { 战斗启动属性配置 } from "../00．配置类型";
import { 默认Boss弱点数量基础值 } from "../00．配置类型";

export const 单位n03S战斗启动属性配置: 战斗启动属性配置 = {
    归类: "Boss",
    单位ID: "n03S",
    单位名: "恶魔看守者",
    战斗音乐变量名: "gg_snd_battle002",
    胜利音乐变量名: "gg_snd_shengliBgm",
    地点区域名称: "恶魔城.Boss战区域",
    转换场景: true,
    BS移动X轴: 28749.10,
    BS移动Y轴: 1788.90,
    玩家移动X轴: 27954.40,
    玩家移动Y轴: 974.60,
    魔抗: 0.35,
    弱点数量基础值: 默认Boss弱点数量基础值,
    弱点数量每层N增量: 0,
    天生弱点数: 2,
    额外随机弱点数: 1,
    冰弱: true,
    短剑弱: true,
    器弱伤害需求生命百分比: 0.03,
    护盾基础值: 8,
    护盾每层N增量: 2,
  };
