/** @noSelfInFile */

import type { 战斗启动属性配置, Boss战斗启动护卫配置 } from "../00．配置类型";
import { 默认Boss弱点数量基础值 } from "../00．配置类型";

export const 单位N03O战斗启动属性配置: 战斗启动属性配置 = {
    归类: "Boss",
    单位ID: "N03O",
    单位名: "恶魔领袖",
    战斗音乐变量名: "gg_snd_battleBoss3",
    胜利音乐变量名: "gg_snd_shengliBgm2",
    地点变量名: "gg_rct______________1522",
    转换场景: true,
    BS移动X轴: 26503.00,
    BS移动Y轴: 20921.80,
    玩家移动X轴: 26807.50,
    玩家移动Y轴: 17016.80,
    魔抗: 0.38,
    暴击率: 0.50,
    普攻伤害吸血: 0.50,
    弱点数量基础值: 默认Boss弱点数量基础值,
    弱点数量每层N增量: 0,
    天生弱点数: 2,
    冰弱: true,
    短剑弱: true,
    器弱伤害需求生命百分比: 0.03,
    护盾基础值: 10,
    护盾每层N增量: 2,
  };

export const 单位N03O战斗启动护卫配置: Boss战斗启动护卫配置 = {
    Boss单位ID: "N03O",
    Boss单位名: "恶魔领袖",
    护卫血条归属类型: "独立",
    初始护卫批次: {
      广播说话者: "护卫",
      广播文案池: [
        "大人，我们来助您一臂之力。",
        "大人，这里的麻烦交给我们处理。",
        "大人，察觉您这边有变，我们立刻赶回来了。",
      ],
      后续对白: [
        {
          延迟毫秒: 3000,
          说话者: "Boss",
          文案池: [
            "很好，你们来得正是时候。此战若胜，少不了你们的奖赏。",
          ],
        },
        {
          延迟毫秒: 5000,
          说话者: "护卫",
          文案池: [
            "愿为大人效死力。",
          ],
        },
      ],
      单位列表: [
        {
          单位ID: "n03N",
          单位名: "恶魔队长",
          X: 26803.00,
          Y: 20921.80,
          面向: 270.00,
          暴击率: 0.40,
          普攻伤害吸血: 0.75,
          主Boss死亡时立刻死亡: false,

          显示护卫血条: true,
        },
        {
          单位ID: "n03N",
          单位名: "恶魔队长",
          X: 26203.00,
          Y: 20921.80,
          面向: 270.00,
          暴击率: 0.40,
          普攻伤害吸血: 0.75,
          主Boss死亡时立刻死亡: false,

          显示护卫血条: true,
        },
      ],
    },
  };
