/** @noSelfInFile */

import type { 战斗启动属性配置 } from "../00．配置类型";
import { 默认Boss弱点数量基础值 } from "../00．配置类型";

export const 单位N03B战斗启动属性配置: 战斗启动属性配置 = {
  归类: "Boss",
  单位ID: "N03B",
  单位名: "熔岩恶魔",
  魔抗: 0.30,
  眩晕抗性: 0.35,
  命中率: 0.20,
  闪避率: 0.10,
  护甲穿透: 0.15,
  弱点数量基础值: 默认Boss弱点数量基础值,
  弱点数量每层N增量: 0,
  天生弱点数: 1,
  额外随机弱点数: 1,
  冰弱: true,
  器弱伤害需求生命百分比: 0.03,
  护盾基础值: 8,
  护盾每层N增量: 2,
  战斗音乐变量名: "gg_snd_battleBgm002",
  胜利音乐变量名: "gg_snd_shengliBgm",
  动态地点矩形: {
    ID: "molten-demon-battlefield",
    名称: "熔岩恶魔战斗区域",
    左: 18208,
    右: 21152,
    下: -8768,
    上: -5888,
  },
  转换场景: true,
  BS移动X轴: 19616.6,
  BS移动Y轴: -6856.6,
  玩家移动X轴: 19918.3,
  玩家移动Y轴: -8256.0,
};
