--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____02_FF0E_6570_503C_4E0E_8868_73B0_914D_7F6E = require("系统.03．技能系统.05．单位技能.03．Boss技能.03．异界Boss.03．安兹乌尔恭.02．数值与表现配置")
local _____5B89_5179_4E4C_5C14_606D_6570_503C_4E0E_8868_73B0_914D_7F6E = ____02_FF0E_6570_503C_4E0E_8868_73B0_914D_7F6E["安兹乌尔恭数值与表现配置"]
local ____require_result_0 = require("系统.03．技能系统.00．技能模板+函数.01．技能函数.02．冲锋·击退.冲锋残影表现")
local _____5F00_59CB_51B2_950B_5E76_9644_5E26_8DEF_5F84_7279_6548 = ____require_result_0["开始冲锋并附带残影表现"]
____exports["开始雅儿贝德冲锋"] = function(_____5355_4F4D, _____4F4D_79FB_53C2_6570)
    local _____5B88_62A4_8005_914D_7F6E = _____5B89_5179_4E4C_5C14_606D_6570_503C_4E0E_8868_73B0_914D_7F6E["守护者模式"]
    return _____5F00_59CB_51B2_950B_5E76_9644_5E26_8DEF_5F84_7279_6548(_____5355_4F4D, _____4F4D_79FB_53C2_6570, {
        ["残影模型"] = _____5B89_5179_4E4C_5C14_606D_6570_503C_4E0E_8868_73B0_914D_7F6E["表现资源"]["雅儿贝德冲锋路径附加特效路径"],
        ["残影缩放"] = _____5B88_62A4_8005_914D_7F6E["雅儿贝德冲锋路径特效缩放"],
        ["残影生成间隔"] = _____5B88_62A4_8005_914D_7F6E["雅儿贝德冲锋路径特效生成间隔秒"],
        ["残影生命周期"] = _____5B88_62A4_8005_914D_7F6E["雅儿贝德冲锋路径特效生命周期秒"],
        ["残影透明度"] = 255
    })
end
return ____exports
