--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____03_FF0E_968F_4ECE_7279_6027 = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.05．树魔首领.03．随从特性")
local _____6CE8_518C_6811_9B54_9996_9886_968F_4ECE_7279_6027 = ____03_FF0E_968F_4ECE_7279_6027["注册树魔首领随从特性"]
local ____04_FF0E_6269_6563_51B2_51FB_6CE2 = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.05．树魔首领.04．扩散冲击波")
local _____6CE8_518C_6811_9B54_9996_9886_6269_6563_51B2_51FB_6CE2 = ____04_FF0E_6269_6563_51B2_51FB_6CE2["注册树魔首领扩散冲击波"]
local ____05_FF0E_6D88_8017_53CD_51FB = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.05．树魔首领.05．消耗反击")
local _____6CE8_518C_6811_9B54_9996_9886_6D88_8017_53CD_51FB = ____05_FF0E_6D88_8017_53CD_51FB["注册树魔首领消耗反击"]
local ____06_FF0E_8FDC_53E4_8BC5_5492 = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.05．树魔首领.06．远古诅咒")
local _____6CE8_518C_6811_9B54_9996_9886_8FDC_53E4_8BC5_5492 = ____06_FF0E_8FDC_53E4_8BC5_5492["注册树魔首领远古诅咒"]
local ____07_FF0E_6811_9B54_56FE_817E = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.05．树魔首领.07．树魔图腾")
local _____6CE8_518C_6811_9B54_9996_9886_6811_9B54_56FE_817E = ____07_FF0E_6811_9B54_56FE_817E["注册树魔首领树魔图腾"]
____exports["注册树魔首领技能结构"] = function()
    _____6CE8_518C_6811_9B54_9996_9886_968F_4ECE_7279_6027()
    _____6CE8_518C_6811_9B54_9996_9886_6269_6563_51B2_51FB_6CE2()
    _____6CE8_518C_6811_9B54_9996_9886_6D88_8017_53CD_51FB()
    _____6CE8_518C_6811_9B54_9996_9886_8FDC_53E4_8BC5_5492()
    _____6CE8_518C_6811_9B54_9996_9886_6811_9B54_56FE_817E()
end
return ____exports
