/** @noSelfInFile */

export const 物品使用装备名称 = {
  狱妖魔盾: "狱妖魔盾",
  商人之书: "商人之书",
  狂暴树枝: "狂暴树枝",
  首领号角: "首领号角",
  精灵号角: "精灵号角",
  守卫大剑: "守卫大剑",
  斯尔能量之心: "斯尔能量之心",
  熔岩地狱之敲钟: "熔岩地狱之敲钟",
  阴暗之敲钟: "阴暗之敲钟",
  地狱火卡牌攻击: "地狱火卡牌（攻击）",
  焰混能量体: "焰混能量体",
  恶斯胸甲: "恶斯胸甲",
  亡灵魔鞋: "亡灵魔鞋",
  恶魔铃铛: "恶魔铃铛",
  魔古战刃: "魔古战刃",
  女妖魔甲: "女妖魔甲",
  熔灵宝石之戒: "熔灵宝石之戒",
  浴血药剂: "浴血药剂",
  浴魔药剂: "浴魔药剂",
  浴灵药剂: "浴灵药剂",
  嗜狱恶剑: "嗜狱恶剑",
  盗贼神符魔抗: "盗贼神符（魔抗）",
  火把: "火把",
  抗毒药水: "抗毒药水",
  影骨披风: "影骨披风",
  阴影陷阱装置: "阴影陷阱装置",
  超位魔法残章天空坠落: "超位魔法残章·天空坠落",
  黑翼守护重盾: "黑翼守护重盾",
} as const;

export {};
