--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____02_FF0EAI_914D_7F6E_5DE5_5177 = require("系统.03．技能系统.06．AI自动使用技能.00．AI配置.02．AI配置工具")
local _____521B_5EFA_5355_4F4DAI_914D_7F6E = ____02_FF0EAI_914D_7F6E_5DE5_5177["创建单位AI配置"]
____exports["熔岩恶魔AI配置"] = _____521B_5EFA_5355_4F4DAI_914D_7F6E({
    ["AI配置ID"] = "熔岩恶魔AI",
    ["单位ID"] = "N03B",
    ["单位名"] = "熔岩恶魔",
    ["归类"] = "Boss",
    ["AI模式"] = "固定技能表",
    ["检查间隔Ms"] = 250,
    ["公共施法间隔Ms"] = 2400,
    ["默认目标选择方式"] = "最高仇恨",
    ["技能覆盖"] = {{
        ["技能ID"] = "A0C1",
        ["技能名"] = "熔狱元素",
        ["施法目标类型"] = "单位",
        ["目标选择方式"] = "最高仇恨",
        ["最大施法距离"] = 1200,
        ["权重"] = 24
    }, {
        ["技能ID"] = "A0C0",
        ["技能名"] = "熔岩吐息",
        ["施法目标类型"] = "单位",
        ["目标选择方式"] = "最高仇恨",
        ["最大施法距离"] = 1100,
        ["权重"] = 30
    }, {["技能ID"] = "A0BG", ["技能名"] = "混乱之雨", ["施法目标类型"] = "无目标", ["权重"] = 16}, {
        ["技能ID"] = "A0BI",
        ["技能名"] = "陨石冲击",
        ["施法目标类型"] = "单位",
        ["目标选择方式"] = "最高仇恨",
        ["最大施法距离"] = 1100,
        ["权重"] = 30
    }},
    ["说明"] = "第三章 41 节点熔岩恶魔试炼的固定技能表；AInv 仅用于常驻无敌，不参与主动施法。"
})
return ____exports
