--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____02_FF0EAI_914D_7F6E_5DE5_5177 = require("系统.03．技能系统.06．AI自动使用技能.00．AI配置.02．AI配置工具")
local _____521B_5EFA_5355_4F4DAI_914D_7F6E = ____02_FF0EAI_914D_7F6E_5DE5_5177["创建单位AI配置"]
local ____00_FF0E_914D_7F6E = require("系统.03．技能系统.05．单位技能.03．Boss技能.02．挑战与隐藏Boss.07．熔浆鱼王.00．配置")
local _____7194_6D46_9C7C_738B_5355_4F4DID = ____00_FF0E_914D_7F6E["熔浆鱼王单位ID"]
local _____7194_5CA9_51B2_51FB_6280_80FDID = ____00_FF0E_914D_7F6E["熔岩冲击技能ID"]
local _____7194_5CA9_51B2_51FB_914D_7F6E = ____00_FF0E_914D_7F6E["熔岩冲击配置"]
local _____7194_6E0A_65B0_661F_6280_80FDID = ____00_FF0E_914D_7F6E["熔渊新星技能ID"]
local _____7194_6E0A_65B0_661F_914D_7F6E = ____00_FF0E_914D_7F6E["熔渊新星配置"]
____exports["熔浆鱼王AI配置"] = _____521B_5EFA_5355_4F4DAI_914D_7F6E({
    ["AI配置ID"] = "熔浆鱼王AI",
    ["单位ID"] = _____7194_6D46_9C7C_738B_5355_4F4DID,
    ["单位名"] = "熔浆鱼王",
    ["归类"] = "精英",
    ["AI模式"] = "固定技能表",
    ["检查间隔Ms"] = 250,
    ["公共施法间隔Ms"] = 2000,
    ["默认目标选择方式"] = "最高仇恨",
    ["技能覆盖"] = {{
        ["技能ID"] = _____7194_5CA9_51B2_51FB_6280_80FDID,
        ["技能名"] = "熔岩冲击",
        ["冷却秒"] = _____7194_5CA9_51B2_51FB_914D_7F6E["冷却秒"],
        ["施法目标类型"] = "点",
        ["目标选择方式"] = "当前攻击目标",
        ["最大施法距离"] = _____7194_5CA9_51B2_51FB_914D_7F6E["施法距离"],
        ["最小施法距离"] = 0,
        ["权重"] = 30
    }, {
        ["技能ID"] = _____7194_6E0A_65B0_661F_6280_80FDID,
        ["技能名"] = "熔渊新星",
        ["冷却秒"] = _____7194_6E0A_65B0_661F_914D_7F6E["冷却秒"],
        ["施法目标类型"] = "无目标",
        ["目标选择方式"] = "当前攻击目标",
        ["最大施法距离"] = _____7194_6E0A_65B0_661F_914D_7F6E["范围"],
        ["最小施法距离"] = 0,
        ["权重"] = 24
    }},
    ["说明"] = "隐藏遭遇（熔浆钓点）。近战撕咬为主：目标贴脸时炸熔渊新星，拉开距离则喷熔岩冲击。"
})
return ____exports
