--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____04_FF0E_7194_6838_5C01_5370_4E0E_62A4_536B_673A_5236 = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.03．熔岩恶魔王巴尔扎罗斯.04．熔核封印与护卫机制")
local _____6CE8_518C_5DF4_5C14_624E_7F57_65AF_7194_6838_5C01_5370_4E0E_62A4_536B_673A_5236 = ____04_FF0E_7194_6838_5C01_5370_4E0E_62A4_536B_673A_5236["注册巴尔扎罗斯熔核封印与护卫机制"]
local ____index = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.03．熔岩恶魔王巴尔扎罗斯.01．护卫A格鲁姆.index")
local _____6CE8_518C_5DF4_5C14_624E_7F57_65AF_62A4_536B_683C_9C81_59C6 = ____index["注册巴尔扎罗斯护卫格鲁姆"]
local ____index = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.03．熔岩恶魔王巴尔扎罗斯.02．护卫B塞拉.index")
local _____6CE8_518C_5DF4_5C14_624E_7F57_65AF_62A4_536B_585E_62C9 = ____index["注册巴尔扎罗斯护卫塞拉"]
local ____07_FF0E_6076_9B54_5486_54EE_6CE2 = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.03．熔岩恶魔王巴尔扎罗斯.07．恶魔咆哮波")
local _____6CE8_518C_5DF4_5C14_624E_7F57_65AF_6076_9B54_5486_54EE_6CE2 = ____07_FF0E_6076_9B54_5486_54EE_6CE2["注册巴尔扎罗斯恶魔咆哮波"]
local ____08_FF0E_738B_8005_5929_7F5A = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.03．熔岩恶魔王巴尔扎罗斯.08．王者天罚")
local _____6CE8_518C_5DF4_5C14_624E_7F57_65AF_738B_8005_5929_7F5A = ____08_FF0E_738B_8005_5929_7F5A["注册巴尔扎罗斯王者天罚"]
local ____09_FF0E_7194_5CA9_55B7_53D1 = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.03．熔岩恶魔王巴尔扎罗斯.09．熔岩喷发")
local _____6CE8_518C_5DF4_5C14_624E_7F57_65AF_7194_5CA9_55B7_53D1 = ____09_FF0E_7194_5CA9_55B7_53D1["注册巴尔扎罗斯熔岩喷发"]
local ____10_FF0E_706B_7130_9501_94FE = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.03．熔岩恶魔王巴尔扎罗斯.10．火焰锁链")
local _____6CE8_518C_5DF4_5C14_624E_7F57_65AF_706B_7130_9501_94FE = ____10_FF0E_706B_7130_9501_94FE["注册巴尔扎罗斯火焰锁链"]
local ____11_FF0E_5730_6838_53EC_5524 = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.03．熔岩恶魔王巴尔扎罗斯.11．地核召唤")
local _____6CE8_518C_5DF4_5C14_624E_7F57_65AF_5730_6838_53EC_5524 = ____11_FF0E_5730_6838_53EC_5524["注册巴尔扎罗斯地核召唤"]
local ____12_FF0E_7194_5CA9_62A4_76FE = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.03．熔岩恶魔王巴尔扎罗斯.12．熔岩护盾")
local _____6CE8_518C_5DF4_5C14_624E_7F57_65AF_7194_5CA9_62A4_76FE = ____12_FF0E_7194_5CA9_62A4_76FE["注册巴尔扎罗斯熔岩护盾"]
local ____13_FF0E_672B_65E5_7194_7206 = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.03．熔岩恶魔王巴尔扎罗斯.13．末日熔爆")
local _____6CE8_518C_5DF4_5C14_624E_7F57_65AF_672B_65E5_7194_7206 = ____13_FF0E_672B_65E5_7194_7206["注册巴尔扎罗斯末日熔爆"]
local ____18_FF0E_51B7_5374_6C34_6676 = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.03．熔岩恶魔王巴尔扎罗斯.18．冷却水晶")
local _____6CE8_518C_5DF4_5C14_624E_7F57_65AF_51B7_5374_6C34_6676 = ____18_FF0E_51B7_5374_6C34_6676["注册巴尔扎罗斯冷却水晶"]
____exports["注册巴尔扎罗斯技能结构"] = function()
    _____6CE8_518C_5DF4_5C14_624E_7F57_65AF_7194_6838_5C01_5370_4E0E_62A4_536B_673A_5236()
    _____6CE8_518C_5DF4_5C14_624E_7F57_65AF_62A4_536B_683C_9C81_59C6()
    _____6CE8_518C_5DF4_5C14_624E_7F57_65AF_62A4_536B_585E_62C9()
    _____6CE8_518C_5DF4_5C14_624E_7F57_65AF_6076_9B54_5486_54EE_6CE2()
    _____6CE8_518C_5DF4_5C14_624E_7F57_65AF_738B_8005_5929_7F5A()
    _____6CE8_518C_5DF4_5C14_624E_7F57_65AF_7194_5CA9_55B7_53D1()
    _____6CE8_518C_5DF4_5C14_624E_7F57_65AF_706B_7130_9501_94FE()
    _____6CE8_518C_5DF4_5C14_624E_7F57_65AF_5730_6838_53EC_5524()
    _____6CE8_518C_5DF4_5C14_624E_7F57_65AF_7194_5CA9_62A4_76FE()
    _____6CE8_518C_5DF4_5C14_624E_7F57_65AF_672B_65E5_7194_7206()
    _____6CE8_518C_5DF4_5C14_624E_7F57_65AF_51B7_5374_6C34_6676()
end
return ____exports
