/** @noSelfInFile */

import type { 环境互动触发点 } from "../00．通用/00．环境互动配置";

export type 旧环境互动类型 =
  | "水触手"
  | "书架"
  | "精灵小屋"
  | "空木桩"
  | "树上物品"
  | "隐藏木桩"
  | "普通提示"
  | "Boss入口"
  | "物品奖励";

export interface 旧环境互动配置 extends Omit<环境互动触发点, "触发回调"> {
  类型: 旧环境互动类型;
  提示文本: string;
  延迟提示文本?: string;
  奖励物品ID?: string;
}

export const 旧环境互动配置表: readonly 旧环境互动配置[] = [
  {
    ID: "旧环境互动.水触手",
    类型: "水触手",
    X: -28763.3,
    Y: -8994.8,
    触发范围: 350,
    一次性: true,
    提示文本: "水面下传来了一阵异样的动静。",
    延迟提示文本: "水触手从水池现身了。",
  },
  {
    ID: "旧环境互动.远古精灵奥术书架",
    类型: "书架",
    X: 27751.7,
    Y: -27979.2,
    触发范围: 350,
    一次性: true,
    提示文本: "在书架处阅读了《远古精灵奥术》，魔法伤害+1%，魔法恢复+1/秒。",
  },
  {
    ID: "旧环境互动.精灵小屋",
    类型: "精灵小屋",
    X: -20745.7,
    Y: -15044.7,
    触发范围: 250,
    一次性: false,
    提示文本: "意外发现了某处能进入的精灵小屋，命中率+1%。",
  },
  {
    ID: "旧环境互动.空木桩",
    类型: "空木桩",
    X: -19529.4,
    Y: -14869.6,
    触发范围: 250,
    一次性: true,
    提示文本: "意外发现了藏在空木桩里的果子。",
  },
  {
    ID: "旧环境互动.树上物品",
    类型: "树上物品",
    X: -17832.0,
    Y: -14822.9,
    触发范围: 250,
    一次性: true,
    提示文本: "意外发现了藏在树上的果子。",
  },
  {
    ID: "旧环境互动.隐藏木桩",
    类型: "隐藏木桩",
    X: -27990.8,
    Y: -7833.4,
    触发范围: 300,
    一次性: true,
    提示文本: "意外发现了藏在空木桩里的物品。",
  },
  {
    ID: "旧环境互动.普通提示",
    类型: "普通提示",
    X: -25991.2,
    Y: -11029.4,
    触发范围: 800,
    一次性: false,
    提示文本: "这里似乎隐藏着什么，需要继续探索。",
  },
  {
    ID: "旧环境互动.Boss入口",
    类型: "Boss入口",
    X: -27048.9,
    Y: -17664.8,
    触发范围: 300,
    一次性: true,
    提示文本: "封印被打开了，史莱姆Boss即将出现。",
  },
  {
    ID: "旧环境互动.魔法书",
    类型: "物品奖励",
    X: 16556.1,
    Y: -29798.6,
    一次性: true,
    提示文本: "发现了一本魔法书！",
    奖励物品ID: "自然魔书#I0D9",
  },
  {
    ID: "旧环境互动.精灵打造图纸",
    类型: "物品奖励",
    X: 16910.5,
    Y: -29237.1,
    一次性: true,
    提示文本: "发现了古时候精灵族的打造图纸。",
    奖励物品ID: "森灵圣枪打造图纸#I0D8",
  },
  {
    ID: "旧环境互动.小道具",
    类型: "物品奖励",
    X: -27944.3,
    Y: 3339.8,
    一次性: true,
    提示文本: "发现了一个小道具！",
    奖励物品ID: "沙之饰品#I0DB",
  },
];

export const 旧环境互动水触手单位ID = "水触须#n049";
export const 旧环境互动Boss单位ID = "史莱姆#n001";
export const 旧环境互动果子物品ID = "伊达之果#I03W";
export const 旧环境互动隐藏木桩奖励物品ID列表 = ["伊达之果#I03W", "智力斗篷+1#ram1", "防御指环+1#rde1"] as const;
export const 旧环境互动水触手特效路径 = "Objects\\Spawnmodels\\Naga\\NagaDeath\\NagaDeath.mdl";

export {};
