--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____00_FF0E_914D_7F6E = require("系统.03．技能系统.05．单位技能.04．英雄技能.21．朱雀院红叶.00．配置")
local _____6731_96C0_9662_7EA2_53F6_6280_80FD_914D_7F6E = ____00_FF0E_914D_7F6E["朱雀院红叶技能配置"]
local _____6731_96C0_9662_7EA2_53F6_5F85_5E73_8861_6570_503C = ____00_FF0E_914D_7F6E["朱雀院红叶待平衡数值"]
local _____6731_96C0_9662_7EA2_53F6_8BFB_6761_914D_7F6E = ____00_FF0E_914D_7F6E["朱雀院红叶读条配置"]
____exports["朱雀院红叶R模块"] = {["技能ID"] = _____6731_96C0_9662_7EA2_53F6_6280_80FD_914D_7F6E.R["技能ID"], ["蓄力秒"] = _____6731_96C0_9662_7EA2_53F6_5F85_5E73_8861_6570_503C.R["蓄力秒"], ["世界坐标读条"] = _____6731_96C0_9662_7EA2_53F6_8BFB_6761_914D_7F6E, ["状态"] = "待实现"}
return ____exports
