--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____00_FF0E_914D_7F6E = require("系统.03．技能系统.05．单位技能.04．英雄技能.21．朱雀院红叶.00．配置")
local _____6731_96C0_9662_7EA2_53F6_6280_80FD_914D_7F6E = ____00_FF0E_914D_7F6E["朱雀院红叶技能配置"]
local _____6731_96C0_9662_7EA2_53F6_5F85_5E73_8861_6570_503C = ____00_FF0E_914D_7F6E["朱雀院红叶待平衡数值"]
____exports["朱雀院红叶D模块"] = {["技能ID"] = _____6731_96C0_9662_7EA2_53F6_6280_80FD_914D_7F6E.D["技能ID"], ["持续秒"] = _____6731_96C0_9662_7EA2_53F6_5F85_5E73_8861_6570_503C.D["持续秒"], ["强化次数"] = _____6731_96C0_9662_7EA2_53F6_5F85_5E73_8861_6570_503C.D["强化次数"], ["状态"] = "待实现"}
return ____exports
