--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local _____533A_57DF_6548_679C = require("系统.03．技能系统.00．技能模板+函数.01．技能函数.04．区域效果.区域效果")
local _____521B_5EFA_533A_57DF_6548_679C = _____533A_57DF_6548_679C["创建区域效果"]
local function _____8F6C_6362_4E3A_533A_57DF_6548_679C_53C2_6570(_____53C2_6570)
    return {
        X = _____53C2_6570.X,
        Y = _____53C2_6570.Y,
        ["半径"] = _____53C2_6570["半径"],
        ["持续时间"] = _____53C2_6570["持续时间"],
        ["检测间隔"] = _____53C2_6570["检测间隔"],
        ["影响目标"] = _____53C2_6570["影响目标"],
        ["所有者"] = _____53C2_6570["所有者"],
        ["模型路径"] = _____53C2_6570["模型路径"],
        ["特效高度"] = _____53C2_6570["特效高度"],
        ["特效缩放"] = _____53C2_6570["特效缩放"],
        ["显示提示圈"] = _____53C2_6570["显示提示圈"],
        ["提示圈"] = _____53C2_6570["提示圈"],
        ["周期伤害"] = _____53C2_6570["周期伤害"],
        ["周期伤害去重组"] = _____53C2_6570["周期伤害去重组"],
        ["周期伤害去重间隔"] = _____53C2_6570["周期伤害去重间隔"],
        ["回调上下文ID"] = _____53C2_6570["回调上下文ID"],
        ["on进入"] = _____53C2_6570["on进入"],
        ["on离开"] = _____53C2_6570["on离开"],
        ["on周期"] = _____53C2_6570["on周期"],
        ["on销毁"] = _____53C2_6570["on销毁"]
    }
end
____exports["创建持续危险区域"] = function(_____53C2_6570)
    local _____533A_57DF_6548_679C = _____521B_5EFA_533A_57DF_6548_679C(_____8F6C_6362_4E3A_533A_57DF_6548_679C_53C2_6570(_____53C2_6570))
    return {
        ["区域效果"] = _____533A_57DF_6548_679C,
        ["销毁"] = function()
            _____533A_57DF_6548_679C["销毁"](_____533A_57DF_6548_679C)
        end,
        ["暂停"] = function()
            _____533A_57DF_6548_679C["暂停"](_____533A_57DF_6548_679C)
        end,
        ["恢复"] = function()
            _____533A_57DF_6548_679C["恢复"](_____533A_57DF_6548_679C)
        end,
        ["移动到"] = function(x, y)
            _____533A_57DF_6548_679C["移动到"](_____533A_57DF_6548_679C, x, y)
        end
    }
end
return ____exports
