--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____03_FF0E_6B63_4E49_5BA1_5224 = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.11．利尔·伯特.03．正义审判")
local _____6CE8_518C_5229_5C14_4F2F_7279_6B63_4E49_5BA1_5224 = ____03_FF0E_6B63_4E49_5BA1_5224["注册利尔伯特正义审判"]
local ____04_FF0E_88C2_5730_65A9 = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.11．利尔·伯特.04．裂地斩")
local _____6CE8_518C_5229_5C14_4F2F_7279_88C2_5730_65A9 = ____04_FF0E_88C2_5730_65A9["注册利尔伯特裂地斩"]
local ____05_FF0E_5BA1_5224_62F7_95EE = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.11．利尔·伯特.05．审判拷问")
local _____6CE8_518C_5229_5C14_4F2F_7279_5BA1_5224_62F7_95EE = ____05_FF0E_5BA1_5224_62F7_95EE["注册利尔伯特审判拷问"]
local ____06_FF0E_68C0_67E5 = require("系统.03．技能系统.05．单位技能.03．Boss技能.01．主线Boss.11．利尔·伯特.06．检查")
local _____6CE8_518C_5229_5C14_4F2F_7279_68C0_67E5 = ____06_FF0E_68C0_67E5["注册利尔伯特检查"]
local _____5229_5C14_4F2F_7279_6280_80FD_7ED3_6784_5DF2_6CE8_518C = false
____exports["注册利尔伯特技能结构"] = function()
    if _____5229_5C14_4F2F_7279_6280_80FD_7ED3_6784_5DF2_6CE8_518C then
        return
    end
    _____5229_5C14_4F2F_7279_6280_80FD_7ED3_6784_5DF2_6CE8_518C = true
    _____6CE8_518C_5229_5C14_4F2F_7279_6B63_4E49_5BA1_5224()
    _____6CE8_518C_5229_5C14_4F2F_7279_88C2_5730_65A9()
    _____6CE8_518C_5229_5C14_4F2F_7279_5BA1_5224_62F7_95EE()
    _____6CE8_518C_5229_5C14_4F2F_7279_68C0_67E5()
end
return ____exports
