local ____lualib = require("lualib_bundle")
local __TS__ObjectKeys = ____lualib.__TS__ObjectKeys
local ____exports = {}
____exports["快速控制效果定义表"] = {
    ["击晕"] = {
        ["类型键"] = "stun",
        ["显示名"] = "击晕",
        BuffID = "C001",
        ["类型分类"] = "快速控制",
        ["快速控制ID"] = 0,
        ["吃控制抗性"] = true,
        ["屏蔽控制命令"] = false,
        ["需要周期驱动"] = false
    },
    ["冰冻"] = {
        ["类型键"] = "freeze",
        ["显示名"] = "冰冻",
        BuffID = "C002",
        ["类型分类"] = "快速控制",
        ["快速控制ID"] = 1,
        ["吃控制抗性"] = true,
        ["屏蔽控制命令"] = false,
        ["需要周期驱动"] = false
    },
    ["沉默"] = {
        ["类型键"] = "silence",
        ["显示名"] = "沉默",
        BuffID = "C003",
        ["类型分类"] = "快速控制",
        ["快速控制ID"] = 2,
        ["吃控制抗性"] = true,
        ["屏蔽控制命令"] = false,
        ["需要周期驱动"] = false
    },
    ["变形"] = {
        ["类型键"] = "polymorph",
        ["显示名"] = "变形",
        BuffID = "C004",
        ["类型分类"] = "快速控制",
        ["快速控制ID"] = 3,
        ["吃控制抗性"] = true,
        ["屏蔽控制命令"] = false,
        ["需要周期驱动"] = false
    },
    ["缴械"] = {
        ["类型键"] = "disarm",
        ["显示名"] = "缴械",
        BuffID = "C006",
        ["类型分类"] = "快速控制",
        ["快速控制ID"] = 5,
        ["吃控制抗性"] = true,
        ["屏蔽控制命令"] = false,
        ["需要周期驱动"] = false
    },
    ["减速"] = {
        ["类型键"] = "slow",
        ["显示名"] = "减速",
        BuffID = "C007",
        ["类型分类"] = "快速控制",
        ["快速控制ID"] = 7,
        ["吃控制抗性"] = true,
        ["屏蔽控制命令"] = false,
        ["需要周期驱动"] = false
    },
    ["硬直"] = {
        ["类型键"] = "stagger",
        ["显示名"] = "硬直",
        BuffID = "C008",
        ["类型分类"] = "快速控制",
        ["快速控制ID"] = 21,
        ["吃控制抗性"] = true,
        ["屏蔽控制命令"] = false,
        ["需要周期驱动"] = false
    },
    ["暂停"] = {
        ["类型键"] = "pause",
        ["显示名"] = "暂停",
        BuffID = "C009",
        ["类型分类"] = "快速控制",
        ["快速控制ID"] = 22,
        ["吃控制抗性"] = true,
        ["屏蔽控制命令"] = false,
        ["需要周期驱动"] = false
    },
    ["EX暂停"] = {
        ["类型键"] = "expause",
        ["显示名"] = "EX暂停",
        BuffID = "C010",
        ["类型分类"] = "快速控制",
        ["快速控制ID"] = 23,
        ["吃控制抗性"] = true,
        ["屏蔽控制命令"] = false,
        ["需要周期驱动"] = false
    },
    ["睡眠"] = {
        ["类型键"] = "sleep",
        ["显示名"] = "睡眠",
        BuffID = "C016",
        ["类型分类"] = "快速控制",
        ["快速控制ID"] = 44,
        ["吃控制抗性"] = true,
        ["屏蔽控制命令"] = false,
        ["需要周期驱动"] = false
    },
    ["纠缠根须"] = {
        ["类型键"] = "roots",
        ["显示名"] = "纠缠根须",
        BuffID = "C017",
        ["类型分类"] = "快速控制",
        ["快速控制ID"] = 45,
        ["吃控制抗性"] = true,
        ["屏蔽控制命令"] = false,
        ["需要周期驱动"] = false
    },
    ["飓风"] = {
        ["类型键"] = "cyclone",
        ["显示名"] = "飓风",
        BuffID = "C018",
        ["类型分类"] = "快速控制",
        ["快速控制ID"] = 46,
        ["吃控制抗性"] = true,
        ["屏蔽控制命令"] = false,
        ["需要周期驱动"] = false
    }
}
____exports["扩展控制效果定义表"] = {taunt = {
    ["类型键"] = "taunt",
    ["显示名"] = "嘲讽",
    BuffID = "C020",
    ["类型分类"] = "扩展控制",
    ["吃控制抗性"] = true,
    ["屏蔽控制命令"] = true,
    ["需要周期驱动"] = true
}, charm = {
    ["类型键"] = "charm",
    ["显示名"] = "魅惑",
    BuffID = "C022",
    ["类型分类"] = "扩展控制",
    ["吃控制抗性"] = true,
    ["屏蔽控制命令"] = true,
    ["需要周期驱动"] = true
}, fear = {
    ["类型键"] = "fear",
    ["显示名"] = "恐惧",
    BuffID = "C023",
    ["类型分类"] = "扩展控制",
    ["吃控制抗性"] = true,
    ["屏蔽控制命令"] = true,
    ["需要周期驱动"] = true
}}
____exports["默认魅惑跟随半径"] = 160
____exports["默认恐惧逃离距离"] = 500
____exports["默认恐惧随机半径"] = 450
____exports["默认恐惧移动速度"] = 50
____exports["魅惑特效模型"] = "Abilities\\Spells\\Other\\SoulBurn\\SoulBurnbuff.mdl"
____exports["恐惧特效模型"] = "BuffIcon\\model\\Grin Curse.mdx"
____exports["扩展控制特效挂点"] = "overhead"
____exports["获取扩展控制定义"] = function(_____7C7B_578B)
    return ____exports["扩展控制效果定义表"][_____7C7B_578B]
end
____exports["获取控制效果定义"] = function(_____7C7B_578B)
    local _____6269_5C55_5B9A_4E49 = ____exports["扩展控制效果定义表"][_____7C7B_578B]
    if _____6269_5C55_5B9A_4E49 ~= nil then
        return _____6269_5C55_5B9A_4E49
    end
    local _____5FEB_901F_952E_5217_8868 = __TS__ObjectKeys(____exports["快速控制效果定义表"])
    do
        local i = 0
        while i < #_____5FEB_901F_952E_5217_8868 do
            local _____5B9A_4E49 = ____exports["快速控制效果定义表"][_____5FEB_901F_952E_5217_8868[i + 1]]
            if _____5B9A_4E49["类型键"] == _____7C7B_578B then
                return _____5B9A_4E49
            end
            i = i + 1
        end
    end
    return nil
end
return ____exports
