--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
---
-- @noSelfInFile
____exports["夏提雅数值与表现配置"] = {
    ["滴管长枪连击"] = {
        ["P1P2需要攻击次数"] = 3,
        ["P3需要攻击次数"] = 2,
        ["连击过期秒"] = 3,
        ["强化穿刺前摇最小秒"] = 0.55,
        ["强化穿刺前摇最大秒"] = 0.7,
        ["鲜血枯竭持续秒"] = 6
    },
    ["鲜血印记"] = {
        ["同时存在上限"] = 3,
        ["持续最小秒"] = 12,
        ["持续最大秒"] = 14,
        ["主动净化秒"] = 1.2,
        ["回收最小周期秒"] = 18,
        ["回收最大周期秒"] = 22,
        ["回收前摇秒"] = 1.5,
        ["单枚回血比例最小"] = 0.02,
        ["单枚回血比例最大"] = 0.03
    },
    P2 = {["英灵复刻延迟最小秒"] = 1, ["英灵复刻延迟最大秒"] = 1.3, ["镜像夹击第二段延迟秒"] = 1.1},
    P3 = {["血宴层数上限"] = 3, ["血月终舞回落最小秒"] = 4, ["血月终舞回落最大秒"] = 5},
    ["血之复生"] = {["仪式秒"] = 12, ["结晶数量"] = 3, ["单枚恢复生命比例"] = 0.1},
    ["表现资源"] = {
        ["血红镜面裂隙特效路径"] = "",
        ["普攻二段鲜血标记特效路径"] = "",
        ["汲血穿刺特效路径"] = "",
        ["血印地面特效路径"] = "",
        ["滴管长枪拖尾特效路径"] = "",
        ["血月轮舞特效路径"] = "",
        ["净化投枪特效路径"] = "",
        ["鲜血回收连线特效路径"] = "",
        ["英灵战乙女模型路径"] = "",
        ["血月终舞特效路径"] = "",
        ["血之复生结晶模型路径"] = "",
        ["挑战结束离场特效路径"] = ""
    }
}
return ____exports
