--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____03_FF0E_6EF4_7BA1_957F_67AA_8FDE_51FB = require("系统.03．技能系统.05．单位技能.03．Boss技能.03．异界Boss.04．夏提雅.03．滴管长枪连击")
local _____6EF4_7BA1_957F_67AA_8FDE_51FB_673A_5236_72B6_6001 = ____03_FF0E_6EF4_7BA1_957F_67AA_8FDE_51FB["滴管长枪连击机制状态"]
local ____04_FF0E_9C9C_8840_5370_8BB0 = require("系统.03．技能系统.05．单位技能.03．Boss技能.03．异界Boss.04．夏提雅.04．鲜血印记")
local _____9C9C_8840_5370_8BB0_673A_5236_72B6_6001 = ____04_FF0E_9C9C_8840_5370_8BB0["鲜血印记机制状态"]
local ____05_FF0E_6EF4_7BA1_7A7F_5FC3 = require("系统.03．技能系统.05．单位技能.03．Boss技能.03．异界Boss.04．夏提雅.05．滴管穿心")
local _____6EF4_7BA1_7A7F_5FC3_6280_80FD_72B6_6001 = ____05_FF0E_6EF4_7BA1_7A7F_5FC3["滴管穿心技能状态"]
local ____06_FF0E_8840_6708_8F6E_821E = require("系统.03．技能系统.05．单位技能.03．Boss技能.03．异界Boss.04．夏提雅.06．血月轮舞")
local _____8840_6708_8F6E_821E_6280_80FD_72B6_6001 = ____06_FF0E_8840_6708_8F6E_821E["血月轮舞技能状态"]
local ____07_FF0E_51C0_5316_6295_67AA = require("系统.03．技能系统.05．单位技能.03．Boss技能.03．异界Boss.04．夏提雅.07．净化投枪")
local _____51C0_5316_6295_67AA_6280_80FD_72B6_6001 = ____07_FF0E_51C0_5316_6295_67AA["净化投枪技能状态"]
local ____08_FF0E_9C9C_8840_56DE_6536 = require("系统.03．技能系统.05．单位技能.03．Boss技能.03．异界Boss.04．夏提雅.08．鲜血回收")
local _____9C9C_8840_56DE_6536_673A_5236_72B6_6001 = ____08_FF0E_9C9C_8840_56DE_6536["鲜血回收机制状态"]
local ____09_FF0E_82F1_7075_6218_4E59_5973 = require("系统.03．技能系统.05．单位技能.03．Boss技能.03．异界Boss.04．夏提雅.09．英灵战乙女")
local _____82F1_7075_6218_4E59_5973_673A_5236_72B6_6001 = ____09_FF0E_82F1_7075_6218_4E59_5973["英灵战乙女机制状态"]
local ____10_FF0E_955C_50CF_5939_51FB = require("系统.03．技能系统.05．单位技能.03．Boss技能.03．异界Boss.04．夏提雅.10．镜像夹击")
local _____955C_50CF_5939_51FB_6280_80FD_72B6_6001 = ____10_FF0E_955C_50CF_5939_51FB["镜像夹击技能状态"]
local ____11_FF0E_771F_7956_8840_5BB4 = require("系统.03．技能系统.05．单位技能.03．Boss技能.03．异界Boss.04．夏提雅.11．真祖血宴")
local _____771F_7956_8840_5BB4_673A_5236_72B6_6001 = ____11_FF0E_771F_7956_8840_5BB4["真祖血宴机制状态"]
local ____12_FF0E_8840_6708_7EC8_821E = require("系统.03．技能系统.05．单位技能.03．Boss技能.03．异界Boss.04．夏提雅.12．血月终舞")
local _____8840_6708_7EC8_821E_6280_80FD_72B6_6001 = ____12_FF0E_8840_6708_7EC8_821E["血月终舞技能状态"]
local ____13_FF0E_8840_4E4B_590D_751F = require("系统.03．技能系统.05．单位技能.03．Boss技能.03．异界Boss.04．夏提雅.13．血之复生")
local _____8840_4E4B_590D_751F_673A_5236_72B6_6001 = ____13_FF0E_8840_4E4B_590D_751F["血之复生机制状态"]
local ____14_FF0E_6280_80FD_8C03_5EA6 = require("系统.03．技能系统.05．单位技能.03．Boss技能.03．异界Boss.04．夏提雅.14．技能调度")
local _____590F_63D0_96C5_6280_80FD_8C03_5EA6_72B6_6001 = ____14_FF0E_6280_80FD_8C03_5EA6["夏提雅技能调度状态"]
local ____15_FF0E_6311_6218_5165_53E3_4E0E_6536_675F = require("系统.03．技能系统.05．单位技能.03．Boss技能.03．异界Boss.04．夏提雅.15．挑战入口与收束")
local _____590F_63D0_96C5_6311_6218_5165_53E3_4E0E_6536_675F_72B6_6001 = ____15_FF0E_6311_6218_5165_53E3_4E0E_6536_675F["夏提雅挑战入口与收束状态"]
____exports["夏提雅技能入口状态"] = {
    ["已注册"] = true,
    ["普攻核心"] = _____6EF4_7BA1_957F_67AA_8FDE_51FB_673A_5236_72B6_6001,
    ["场地资源"] = _____9C9C_8840_5370_8BB0_673A_5236_72B6_6001,
    ["主动技能"] = {
        _____6EF4_7BA1_7A7F_5FC3_6280_80FD_72B6_6001,
        _____8840_6708_8F6E_821E_6280_80FD_72B6_6001,
        _____51C0_5316_6295_67AA_6280_80FD_72B6_6001,
        _____955C_50CF_5939_51FB_6280_80FD_72B6_6001,
        _____8840_6708_7EC8_821E_6280_80FD_72B6_6001
    },
    ["阶段机制"] = {_____9C9C_8840_56DE_6536_673A_5236_72B6_6001, _____82F1_7075_6218_4E59_5973_673A_5236_72B6_6001, _____771F_7956_8840_5BB4_673A_5236_72B6_6001, _____8840_4E4B_590D_751F_673A_5236_72B6_6001},
    ["调度"] = _____590F_63D0_96C5_6280_80FD_8C03_5EA6_72B6_6001,
    ["挑战入口与收束"] = _____590F_63D0_96C5_6311_6218_5165_53E3_4E0E_6536_675F_72B6_6001
}
return ____exports
