/** @noSelfInFile */

import type { 首领奖励池配置 } from "../00．类型定义";

export const 蜘蛛女皇奖励池ID = "boss.death.蜘蛛女皇";

export const 蜘蛛女皇首领奖励池配置: 首领奖励池配置 = {
  奖励池ID: 蜘蛛女皇奖励池ID,
  标题: "蜘蛛女皇战利品选择",
  可选数量: 1,
  选项: [
      {
        装备名: "蜘皇下装",
        排序: 1,
        图标: "",
        描述: "以蜘蛛女皇腹甲缝制的坚韧下装。",
        特效: "提高攻击力、生命值与生命回复。",
      },
      {
        装备名: "蜘皇下裤",
        排序: 2,
        图标: "",
        描述: "女皇丝腺编成的轻甲长裤。",
        特效: "提高力量、暴击率、护甲与生命值。",
      },
      {
        装备名: "蛛皇法杖",
        排序: 3,
        图标: "",
        描述: "嵌有蛛皇毒晶的仪式法杖。",
        特效: "提高攻击力、智力与魔法伤害，并可主动施放变形术。",
      }
  ],
};
