--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____02_FF0E_6570_503C_4E0E_8868_73B0_914D_7F6E = require("系统.03．技能系统.05．单位技能.03．Boss技能.06．双重凤凰菲尼克斯尔.02．数值与表现配置")
local _____83F2_5C3C_514B_65AF_5C14_6570_503C_4E0E_8868_73B0_914D_7F6E = ____02_FF0E_6570_503C_4E0E_8868_73B0_914D_7F6E["菲尼克斯尔数值与表现配置"]
local _____83F2_5C3C_514B_65AF_5C14_97F3_6548_914D_7F6E = ____02_FF0E_6570_503C_4E0E_8868_73B0_914D_7F6E["菲尼克斯尔音效配置"]
local ____04_FF0E_53CC_5F62_6001_8F6C_6362 = require("系统.03．技能系统.05．单位技能.03．Boss技能.06．双重凤凰菲尼克斯尔.04．双形态转换")
local _____5207_6362_83F2_5C3C_514B_65AF_5C14_7B2C_4E8C_5F62_6001 = ____04_FF0E_53CC_5F62_6001_8F6C_6362["切换菲尼克斯尔第二形态"]
local ____17_FF0E_53F0_8BCD_64AD_653E = require("系统.03．技能系统.05．单位技能.03．Boss技能.06．双重凤凰菲尼克斯尔.17．台词播放")
local _____64AD_653E_83F2_5C3C_514B_65AF_5C14_53F0_8BCD = ____17_FF0E_53F0_8BCD_64AD_653E["播放菲尼克斯尔台词"]
local ____00_FF0EBoss_97F3_6548_64AD_653E = require("系统.03．技能系统.05．单位技能.03．Boss技能.00．公共.00．Boss音效播放")
local _____64AD_653EBoss_5750_6807_97F3_6548 = ____00_FF0EBoss_97F3_6548_64AD_653E["播放Boss坐标音效"]
local ____19_FF0E_516C_5171_5DE5_5177 = require("系统.03．技能系统.05．单位技能.03．Boss技能.06．双重凤凰菲尼克斯尔.19．公共工具")
local _____5EF6_8FDF = ____19_FF0E_516C_5171_5DE5_5177["延迟"]
local _____5355_4F4D_5B58_6D3B = ____19_FF0E_516C_5171_5DE5_5177["单位存活"]
local _____64AD_653E_70B9_7279_6548 = ____19_FF0E_516C_5171_5DE5_5177["播放点特效"]
local _____53D6_5355_4F4DX = ____19_FF0E_516C_5171_5DE5_5177["取单位X"]
local _____53D6_5355_4F4DY = ____19_FF0E_516C_5171_5DE5_5177["取单位Y"]
local _____8BBE_7F6E_5355_4F4D_52A8_753B = ____19_FF0E_516C_5171_5DE5_5177["设置单位动画"]
local _____663E_793A_5927_62DB_8BFB_6761 = ____19_FF0E_516C_5171_5DE5_5177["显示大招读条"]
local _____5F00_59CB_65BD_6CD5_786C_76F4 = ____19_FF0E_516C_5171_5DE5_5177["开始施法硬直"]
local ____11_FF0E_9AB8_9AA8_5F39_5E55 = require("系统.03．技能系统.05．单位技能.03．Boss技能.06．双重凤凰菲尼克斯尔.11．骸骨弹幕")
local _____521D_59CB_5316_83F2_5C3C_514B_65AF_5C14_9AB8_9AA8_5F39_5E55_8282_70B9 = ____11_FF0E_9AB8_9AA8_5F39_5E55["初始化菲尼克斯尔骸骨弹幕节点"]
local ____12_FF0E_6028_706B_94FE_63A5 = require("系统.03．技能系统.05．单位技能.03．Boss技能.06．双重凤凰菲尼克斯尔.12．怨火链接")
local _____521D_59CB_5316_83F2_5C3C_514B_65AF_5C14_6028_706B_94FE_63A5_8282_70B9 = ____12_FF0E_6028_706B_94FE_63A5["初始化菲尼克斯尔怨火链接节点"]
local ____13_FF0E_51E4_51F0_633D_6B4C = require("系统.03．技能系统.05．单位技能.03．Boss技能.06．双重凤凰菲尼克斯尔.13．凤凰挽歌")
local _____521D_59CB_5316_83F2_5C3C_514B_65AF_5C14_51E4_51F0_633D_6B4C_8282_70B9 = ____13_FF0E_51E4_51F0_633D_6B4C["初始化菲尼克斯尔凤凰挽歌节点"]
local ____14_FF0E_5143_7D20_7206_53D1 = require("系统.03．技能系统.05．单位技能.03．Boss技能.06．双重凤凰菲尼克斯尔.14．元素爆发")
local _____521D_59CB_5316_83F2_5C3C_514B_65AF_5C14_5143_7D20_7206_53D1_8282_70B9 = ____14_FF0E_5143_7D20_7206_53D1["初始化菲尼克斯尔元素爆发节点"]
local ____15_FF0E_6028_706B_6838_5FC3_66B4_9732 = require("系统.03．技能系统.05．单位技能.03．Boss技能.06．双重凤凰菲尼克斯尔.15．怨火核心暴露")
local _____521D_59CB_5316_83F2_5C3C_514B_65AF_5C14_6028_706B_6838_5FC3_66B4_9732_8282_70B9 = ____15_FF0E_6028_706B_6838_5FC3_66B4_9732["初始化菲尼克斯尔怨火核心暴露节点"]
local ____16_FF0E_6C38_6052_8F6E_56DE = require("系统.03．技能系统.05．单位技能.03．Boss技能.06．双重凤凰菲尼克斯尔.16．永恒轮回")
local _____521D_59CB_5316_83F2_5C3C_514B_65AF_5C14_6C38_6052_8F6E_56DE_8282_70B9 = ____16_FF0E_6C38_6052_8F6E_56DE["初始化菲尼克斯尔永恒轮回节点"]
local function _____521D_59CB_5316_83F2_5C3C_514B_65AF_5C14_7B2C_4E8C_5F62_6001_673A_5236(context)
    if context["P2机制已初始化"] then
        return
    end
    context["P2机制已初始化"] = true
    _____521D_59CB_5316_83F2_5C3C_514B_65AF_5C14_9AB8_9AA8_5F39_5E55_8282_70B9(context)
    _____521D_59CB_5316_83F2_5C3C_514B_65AF_5C14_6028_706B_94FE_63A5_8282_70B9(context)
    _____521D_59CB_5316_83F2_5C3C_514B_65AF_5C14_51E4_51F0_633D_6B4C_8282_70B9(context)
    _____521D_59CB_5316_83F2_5C3C_514B_65AF_5C14_5143_7D20_7206_53D1_8282_70B9(context)
    _____521D_59CB_5316_83F2_5C3C_514B_65AF_5C14_6028_706B_6838_5FC3_66B4_9732_8282_70B9(context)
    _____521D_59CB_5316_83F2_5C3C_514B_65AF_5C14_6C38_6052_8F6E_56DE_8282_70B9(context)
end
____exports["触发菲尼克斯尔P1转场"] = function(context)
    local boss = context.Boss
    if not _____5355_4F4D_5B58_6D3B(boss) or context["当前形态"] ~= "第一形态" then
        return
    end
    local duration = 5
    _____64AD_653E_83F2_5C3C_514B_65AF_5C14_53F0_8BCD(boss, "浴火重生准备")
    _____5F00_59CB_65BD_6CD5_786C_76F4(boss, duration)
    _____8BBE_7F6E_5355_4F4D_52A8_753B(boss, _____83F2_5C3C_514B_65AF_5C14_6570_503C_4E0E_8868_73B0_914D_7F6E["动画"]["第一形态"]["重生死亡"]["编号"], _____83F2_5C3C_514B_65AF_5C14_6570_503C_4E0E_8868_73B0_914D_7F6E["动画"]["第一形态"]["重生死亡"]["倍速"])
    _____663E_793A_5927_62DB_8BFB_6761(duration, 3, "菲尼克斯尔正在浴火重生！", "摧毁导管后的封印正在崩解")
    _____64AD_653E_70B9_7279_6548(
        _____83F2_5C3C_514B_65AF_5C14_6570_503C_4E0E_8868_73B0_914D_7F6E["特效"]["冰核破碎A"],
        _____53D6_5355_4F4DX(boss),
        _____53D6_5355_4F4DY(boss),
        3500
    )
    _____64AD_653E_70B9_7279_6548(
        _____83F2_5C3C_514B_65AF_5C14_6570_503C_4E0E_8868_73B0_914D_7F6E["特效"]["冰核破碎B"],
        _____53D6_5355_4F4DX(boss),
        _____53D6_5355_4F4DY(boss),
        3500
    )
    _____64AD_653EBoss_5750_6807_97F3_6548(
        _____83F2_5C3C_514B_65AF_5C14_97F3_6548_914D_7F6E["转第二形态"]["冰核破碎重生"],
        _____53D6_5355_4F4DX(boss),
        _____53D6_5355_4F4DY(boss),
        _____83F2_5C3C_514B_65AF_5C14_97F3_6548_914D_7F6E["默认裁断距离"]
    )
    _____5EF6_8FDF(
        duration * 1000,
        function()
            _____5207_6362_83F2_5C3C_514B_65AF_5C14_7B2C_4E8C_5F62_6001(context)
            _____521D_59CB_5316_83F2_5C3C_514B_65AF_5C14_7B2C_4E8C_5F62_6001_673A_5236(context)
        end
    )
end
____exports["注册菲尼克斯尔浴火重生准备"] = function()
end
return ____exports
