--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____19_FF0E_516C_5171_5DE5_5177 = require("系统.03．技能系统.05．单位技能.03．Boss技能.06．双重凤凰菲尼克斯尔.19．公共工具")
local _____6DFB_52A0_5143_7D20_5C42_6570 = ____19_FF0E_516C_5171_5DE5_5177["添加元素层数"]
local _____51CF_5C11_5143_7D20_5C42_6570 = ____19_FF0E_516C_5171_5DE5_5177["减少元素层数"]
local _____53D6_5143_7D20_5C42_6570 = ____19_FF0E_516C_5171_5DE5_5177["取元素层数"]
local _____53D6_6700_9AD8_5143_7D20 = ____19_FF0E_516C_5171_5DE5_5177["取最高元素"]
____exports["注册菲尼克斯尔元素层数"] = function()
end
____exports["添加菲尼克斯尔元素层数"] = _____6DFB_52A0_5143_7D20_5C42_6570
____exports["减少菲尼克斯尔元素层数"] = _____51CF_5C11_5143_7D20_5C42_6570
____exports["取菲尼克斯尔元素层数"] = _____53D6_5143_7D20_5C42_6570
____exports["取菲尼克斯尔最高元素"] = _____53D6_6700_9AD8_5143_7D20
return ____exports
