--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____04_FF0E_53CC_5F62_6001_8F6C_6362 = require("系统.03．技能系统.05．单位技能.03．Boss技能.06．双重凤凰菲尼克斯尔.04．双形态转换")
local _____6CE8_518C_83F2_5C3C_514B_65AF_5C14_53CC_5F62_6001_8F6C_6362 = ____04_FF0E_53CC_5F62_6001_8F6C_6362["注册菲尼克斯尔双形态转换"]
local ____05_FF0E_6C38_6052_51B0_6838_4E0E_5BFC_7BA1 = require("系统.03．技能系统.05．单位技能.03．Boss技能.06．双重凤凰菲尼克斯尔.05．永恒冰核与导管")
local _____6CE8_518C_83F2_5C3C_514B_65AF_5C14_6C38_6052_51B0_6838_4E0E_5BFC_7BA1 = ____05_FF0E_6C38_6052_51B0_6838_4E0E_5BFC_7BA1["注册菲尼克斯尔永恒冰核与导管"]
local ____06_FF0E_70BD_7FBD_6563_5C04 = require("系统.03．技能系统.05．单位技能.03．Boss技能.06．双重凤凰菲尼克斯尔.06．炽羽散射")
local _____6CE8_518C_83F2_5C3C_514B_65AF_5C14_70BD_7FBD_6563_5C04 = ____06_FF0E_70BD_7FBD_6563_5C04["注册菲尼克斯尔炽羽散射"]
local ____07_FF0E_7194_5CA9_5410_606F = require("系统.03．技能系统.05．单位技能.03．Boss技能.06．双重凤凰菲尼克斯尔.07．熔岩吐息")
local _____6CE8_518C_83F2_5C3C_514B_65AF_5C14_7194_5CA9_5410_606F = ____07_FF0E_7194_5CA9_5410_606F["注册菲尼克斯尔熔岩吐息"]
local ____08_FF0E_51E4_51F0_6F29_6DA1 = require("系统.03．技能系统.05．单位技能.03．Boss技能.06．双重凤凰菲尼克斯尔.08．凤凰漩涡")
local _____6CE8_518C_83F2_5C3C_514B_65AF_5C14_51E4_51F0_6F29_6DA1 = ____08_FF0E_51E4_51F0_6F29_6DA1["注册菲尼克斯尔凤凰漩涡"]
local ____09_FF0E_6D74_706B_91CD_751F_51C6_5907 = require("系统.03．技能系统.05．单位技能.03．Boss技能.06．双重凤凰菲尼克斯尔.09．浴火重生准备")
local _____6CE8_518C_83F2_5C3C_514B_65AF_5C14_6D74_706B_91CD_751F_51C6_5907 = ____09_FF0E_6D74_706B_91CD_751F_51C6_5907["注册菲尼克斯尔浴火重生准备"]
local ____10_FF0E_5143_7D20_5C42_6570 = require("系统.03．技能系统.05．单位技能.03．Boss技能.06．双重凤凰菲尼克斯尔.10．元素层数")
local _____6CE8_518C_83F2_5C3C_514B_65AF_5C14_5143_7D20_5C42_6570 = ____10_FF0E_5143_7D20_5C42_6570["注册菲尼克斯尔元素层数"]
local ____11_FF0E_9AB8_9AA8_5F39_5E55 = require("系统.03．技能系统.05．单位技能.03．Boss技能.06．双重凤凰菲尼克斯尔.11．骸骨弹幕")
local _____6CE8_518C_83F2_5C3C_514B_65AF_5C14_9AB8_9AA8_5F39_5E55 = ____11_FF0E_9AB8_9AA8_5F39_5E55["注册菲尼克斯尔骸骨弹幕"]
local ____12_FF0E_6028_706B_94FE_63A5 = require("系统.03．技能系统.05．单位技能.03．Boss技能.06．双重凤凰菲尼克斯尔.12．怨火链接")
local _____6CE8_518C_83F2_5C3C_514B_65AF_5C14_6028_706B_94FE_63A5 = ____12_FF0E_6028_706B_94FE_63A5["注册菲尼克斯尔怨火链接"]
local ____13_FF0E_51E4_51F0_633D_6B4C = require("系统.03．技能系统.05．单位技能.03．Boss技能.06．双重凤凰菲尼克斯尔.13．凤凰挽歌")
local _____6CE8_518C_83F2_5C3C_514B_65AF_5C14_51E4_51F0_633D_6B4C = ____13_FF0E_51E4_51F0_633D_6B4C["注册菲尼克斯尔凤凰挽歌"]
local ____14_FF0E_5143_7D20_7206_53D1 = require("系统.03．技能系统.05．单位技能.03．Boss技能.06．双重凤凰菲尼克斯尔.14．元素爆发")
local _____6CE8_518C_83F2_5C3C_514B_65AF_5C14_5143_7D20_7206_53D1 = ____14_FF0E_5143_7D20_7206_53D1["注册菲尼克斯尔元素爆发"]
local ____15_FF0E_6028_706B_6838_5FC3_66B4_9732 = require("系统.03．技能系统.05．单位技能.03．Boss技能.06．双重凤凰菲尼克斯尔.15．怨火核心暴露")
local _____6CE8_518C_83F2_5C3C_514B_65AF_5C14_6028_706B_6838_5FC3_66B4_9732 = ____15_FF0E_6028_706B_6838_5FC3_66B4_9732["注册菲尼克斯尔怨火核心暴露"]
local ____16_FF0E_6C38_6052_8F6E_56DE = require("系统.03．技能系统.05．单位技能.03．Boss技能.06．双重凤凰菲尼克斯尔.16．永恒轮回")
local _____6CE8_518C_83F2_5C3C_514B_65AF_5C14_6C38_6052_8F6E_56DE = ____16_FF0E_6C38_6052_8F6E_56DE["注册菲尼克斯尔永恒轮回"]
____exports["注册菲尼克斯尔技能结构"] = function()
    _____6CE8_518C_83F2_5C3C_514B_65AF_5C14_53CC_5F62_6001_8F6C_6362()
    _____6CE8_518C_83F2_5C3C_514B_65AF_5C14_6C38_6052_51B0_6838_4E0E_5BFC_7BA1()
    _____6CE8_518C_83F2_5C3C_514B_65AF_5C14_70BD_7FBD_6563_5C04()
    _____6CE8_518C_83F2_5C3C_514B_65AF_5C14_7194_5CA9_5410_606F()
    _____6CE8_518C_83F2_5C3C_514B_65AF_5C14_51E4_51F0_6F29_6DA1()
    _____6CE8_518C_83F2_5C3C_514B_65AF_5C14_6D74_706B_91CD_751F_51C6_5907()
    _____6CE8_518C_83F2_5C3C_514B_65AF_5C14_5143_7D20_5C42_6570()
    _____6CE8_518C_83F2_5C3C_514B_65AF_5C14_9AB8_9AA8_5F39_5E55()
    _____6CE8_518C_83F2_5C3C_514B_65AF_5C14_6028_706B_94FE_63A5()
    _____6CE8_518C_83F2_5C3C_514B_65AF_5C14_51E4_51F0_633D_6B4C()
    _____6CE8_518C_83F2_5C3C_514B_65AF_5C14_5143_7D20_7206_53D1()
    _____6CE8_518C_83F2_5C3C_514B_65AF_5C14_6028_706B_6838_5FC3_66B4_9732()
    _____6CE8_518C_83F2_5C3C_514B_65AF_5C14_6C38_6052_8F6E_56DE()
end
return ____exports
