--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____02_FF0EAI_914D_7F6E_5DE5_5177 = require("系统.03．技能系统.06．AI自动使用技能.02．AI配置工具")
local _____521B_5EFA_5355_4F4DAI_914D_7F6E = ____02_FF0EAI_914D_7F6E_5DE5_5177["创建单位AI配置"]
____exports["异界BossAI配置表"] = {
    _____521B_5EFA_5355_4F4DAI_914D_7F6E({
        ["AI配置ID"] = "比那名居天子AI",
        ["单位名"] = "比那名居天子",
        ["归类"] = "异界Boss",
        ["AI模式"] = "固定技能表",
        ["检查间隔Ms"] = 250,
        ["公共施法间隔Ms"] = 1000,
        ["默认目标选择方式"] = "最高仇恨",
        ["技能覆盖"] = {{
            ["技能ID"] = "A0GZ",
            ["技能名"] = "不让土壤之剑",
            ["施法目标类型"] = "单位",
            ["权重"] = 10,
            ["说明"] = "直线推进 800 码，按 0.06 秒前进 90 码，共 11 段，带击飞与伤害。"
        }, {
            ["技能ID"] = "A0H0",
            ["技能名"] = "全人类的绯想天",
            ["施法目标类型"] = "单位",
            ["权重"] = 40,
            ["说明"] = "持续发射激光，前方 1500 码、半径 200 码内持续伤害并锁定目标。"
        }, {
            ["技能ID"] = "A0H1",
            ["技能名"] = "镇守大地之石",
            ["施法目标类型"] = "单位",
            ["权重"] = 20,
            ["说明"] = "短暂延迟后在目标点顶起巨石，击飞目标并造成伤害。"
        }, {
            ["技能ID"] = "A0H2",
            ["技能名"] = "先忧后乐之剑",
            ["施法目标类型"] = "无目标",
            ["权重"] = 30,
            ["说明"] = "以自身半径 1800 码为中心，随机点延迟造成 200 半径 AoE，可重复叠加。"
        }},
        ["说明"] = "异界Boss 主动施法配置：CD / 施法距离动态读取技能数据表，权重只用于主动施法优先级。"
    }),
    _____521B_5EFA_5355_4F4DAI_914D_7F6E({
        ["AI配置ID"] = "神罗战士克隆形态AI",
        ["单位名"] = "|cffff6600神罗战士（克隆形态）|r",
        ["归类"] = "异界Boss",
        ["AI模式"] = "固定技能表",
        ["检查间隔Ms"] = 250,
        ["公共施法间隔Ms"] = 1000,
        ["默认目标选择方式"] = "最高仇恨",
        ["技能覆盖"] = {{
            ["技能ID"] = "A0H6",
            ["技能名"] = "八刀一闪",
            ["施法目标类型"] = "单位",
            ["权重"] = 40,
            ["说明"] = "锁定目标后短暂延迟冲锋，若目标逃离则失败，否则 1 秒内幻影连砍 8 刀。"
        }, {
            ["技能ID"] = "A0H8",
            ["技能名"] = "残心",
            ["施法目标类型"] = "无目标",
            ["权重"] = 10,
            ["说明"] = "延迟后原地连续劈出刀光，向随机敌人飞行并随机劈砍 7 到 10 次。"
        }, {
            ["技能ID"] = "A0H7",
            ["技能名"] = "暗黑花火",
            ["施法目标类型"] = "单位",
            ["权重"] = 30,
            ["说明"] = "以目标为中心四角生成黑暗球，向目标反复摩擦造成伤害，重复命中后眩晕。"
        }, {
            ["技能ID"] = "A0H9",
            ["技能名"] = "一阵",
            ["施法目标类型"] = "单位",
            ["权重"] = 20,
            ["说明"] = "向前半月牙冲锋劈砍，对路径敌人造成伤害并击退后再次劈砍。"
        }},
        ["说明"] = "异界Boss 主动施法配置：CD / 施法距离动态读取技能数据表，权重只用于主动施法优先级。"
    })
}
return ____exports
