--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____03_FF0E_8150_8D25_503C_4E0E_6839_987B_9886_57DF = require("系统.03．技能系统.05．单位技能.03．Boss技能.02．挑战与隐藏Boss.04．古木之蚀莫尔特斯.03．腐败值与根须领域")
local _____6CE8_518C_83AB_5C14_7279_65AF_8150_8D25_503C_4E0E_6839_987B_9886_57DF = ____03_FF0E_8150_8D25_503C_4E0E_6839_987B_9886_57DF["注册莫尔特斯腐败值与根须领域"]
local ____04_FF0E_8150_673D_6839_987B_7A7F_523A = require("系统.03．技能系统.05．单位技能.03．Boss技能.02．挑战与隐藏Boss.04．古木之蚀莫尔特斯.04．腐朽根须穿刺")
local _____6CE8_518C_83AB_5C14_7279_65AF_8150_673D_6839_987B_7A7F_523A = ____04_FF0E_8150_673D_6839_987B_7A7F_523A["注册莫尔特斯腐朽根须穿刺"]
local ____05_FF0E_8150_8D25_5B62_5B50_4E91 = require("系统.03．技能系统.05．单位技能.03．Boss技能.02．挑战与隐藏Boss.04．古木之蚀莫尔特斯.05．腐败孢子云")
local _____6CE8_518C_83AB_5C14_7279_65AF_8150_8D25_5B62_5B50_4E91 = ____05_FF0E_8150_8D25_5B62_5B50_4E91["注册莫尔特斯腐败孢子云"]
local ____06_FF0E_626D_66F2_8346_68D8_97AD_7B1E = require("系统.03．技能系统.05．单位技能.03．Boss技能.02．挑战与隐藏Boss.04．古木之蚀莫尔特斯.06．扭曲荆棘鞭笞")
local _____6CE8_518C_83AB_5C14_7279_65AF_626D_66F2_8346_68D8_97AD_7B1E = ____06_FF0E_626D_66F2_8346_68D8_97AD_7B1E["注册莫尔特斯扭曲荆棘鞭笞"]
local ____07_FF0E_8150_8D25_4E4B_79CD = require("系统.03．技能系统.05．单位技能.03．Boss技能.02．挑战与隐藏Boss.04．古木之蚀莫尔特斯.07．腐败之种")
local _____6CE8_518C_83AB_5C14_7279_65AF_8150_8D25_4E4B_79CD = ____07_FF0E_8150_8D25_4E4B_79CD["注册莫尔特斯腐败之种"]
local ____11_FF0E_53E4_6728_60B2_9E23 = require("系统.03．技能系统.05．单位技能.03．Boss技能.02．挑战与隐藏Boss.04．古木之蚀莫尔特斯.11．古木悲鸣")
local _____6CE8_518C_83AB_5C14_7279_65AF_53E4_6728_60B2_9E23 = ____11_FF0E_53E4_6728_60B2_9E23["注册莫尔特斯古木悲鸣"]
____exports["注册莫尔特斯技能结构"] = function()
    _____6CE8_518C_83AB_5C14_7279_65AF_8150_8D25_503C_4E0E_6839_987B_9886_57DF()
    _____6CE8_518C_83AB_5C14_7279_65AF_8150_673D_6839_987B_7A7F_523A()
    _____6CE8_518C_83AB_5C14_7279_65AF_8150_8D25_5B62_5B50_4E91()
    _____6CE8_518C_83AB_5C14_7279_65AF_626D_66F2_8346_68D8_97AD_7B1E()
    _____6CE8_518C_83AB_5C14_7279_65AF_8150_8D25_4E4B_79CD()
    _____6CE8_518C_83AB_5C14_7279_65AF_53E4_6728_60B2_9E23()
end
return ____exports
