--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____19_FF0E_6218_6597_516C_5171_5DE5_5177 = require("系统.03．技能系统.00．技能模板+函数.02．通用函数.19．战斗公共工具")
local stringToFourCC = ____19_FF0E_6218_6597_516C_5171_5DE5_5177.stringToFourCC
local _____53D6_5355_4F4DID = ____19_FF0E_6218_6597_516C_5171_5DE5_5177["取单位ID"]
local _____5355_4F4D_6709_6548 = ____19_FF0E_6218_6597_516C_5171_5DE5_5177["单位有效"]
local _____8DDD_79BB_5E73_65B9XY = ____19_FF0E_6218_6597_516C_5171_5DE5_5177["距离平方XY"]
local _____8DDD_79BBXY = ____19_FF0E_6218_6597_516C_5171_5DE5_5177["距离XY"]
local _____4E24_70B9_89D2_5EA6 = ____19_FF0E_6218_6597_516C_5171_5DE5_5177["两点角度"]
local _____5355_4F4D_95F4_89D2_5EA6 = ____19_FF0E_6218_6597_516C_5171_5DE5_5177["单位间角度"]
local _____6781_5750_6807X = ____19_FF0E_6218_6597_516C_5171_5DE5_5177["极坐标X"]
local _____6781_5750_6807Y = ____19_FF0E_6218_6597_516C_5171_5DE5_5177["极坐标Y"]
local _____9650_5236_6570_503C = ____19_FF0E_6218_6597_516C_5171_5DE5_5177["限制数值"]
local _____70B9_5230_7EBF_6BB5_8DDD_79BB_5E73_65B9 = ____19_FF0E_6218_6597_516C_5171_5DE5_5177["点到线段距离平方"]
local _____70B9_662F_5426_5904_4E8E_65B9_5411_969C_788D_7269_540E_65B9 = ____19_FF0E_6218_6597_516C_5171_5DE5_5177["点是否处于方向障碍物后方"]
local ____require_result_0 = require("系统.03．技能系统.00．技能模板+函数.02．通用函数.00．单位动画等待")
local _____64AD_653E_9650_65F6_5355_4F4D_52A8_753B = ____require_result_0["播放限时单位动画"]
local ____require_result_1 = require("系统.03．技能系统.00．技能模板+函数.02．通用函数.01．控制与Buff")
local _____5F00_59CB_786C_76F4 = ____require_result_1["开始硬直"]
local ____require_result_2 = require("系统.09．表现系统.08．吟唱条.06．对外接口")
local _____663E_793A_5E38_89C4_6280_80FD_541F_5531_6761 = ____require_result_2["显示常规技能吟唱条"]
local _____663E_793A_5927_62DB_541F_5531_6761 = ____require_result_2["显示大招吟唱条"]
local _____5173_95ED_541F_5531_6761 = ____require_result_2["关闭吟唱条"]
____exports.stringToFourCC = stringToFourCC
____exports["取单位ID"] = _____53D6_5355_4F4DID
____exports["单位有效"] = _____5355_4F4D_6709_6548
____exports["距离平方XY"] = _____8DDD_79BB_5E73_65B9XY
____exports["距离XY"] = _____8DDD_79BBXY
____exports["极坐标X"] = _____6781_5750_6807X
____exports["极坐标Y"] = _____6781_5750_6807Y
____exports["限制数值"] = _____9650_5236_6570_503C
____exports["点到线段距离平方"] = _____70B9_5230_7EBF_6BB5_8DDD_79BB_5E73_65B9
____exports["点是否处于方向障碍物后方"] = _____70B9_662F_5426_5904_4E8E_65B9_5411_969C_788D_7269_540E_65B9
____exports["取坐标角度"] = _____4E24_70B9_89D2_5EA6
____exports["取单位间角度"] = _____5355_4F4D_95F4_89D2_5EA6
____exports["播放莫尔特斯限时动作"] = function(unit, _____52A8_753B_7F16_53F7, _____52A8_753B_901F_5EA6, _____6301_7EED_79D2)
    return _____64AD_653E_9650_65F6_5355_4F4D_52A8_753B({
        ["单位"] = unit,
        ["动画编号"] = _____52A8_753B_7F16_53F7,
        ["动画速度"] = _____52A8_753B_901F_5EA6,
        ["持续秒"] = _____6301_7EED_79D2,
        ["恢复动画编号"] = 0,
        ["恢复动画速度"] = 1
    })
end
____exports["开始莫尔特斯常规施法"] = function(unit, _____6301_7EED_79D2, _____6807_9898_6587_672C, _____63D0_793A_6587_672C)
    _____5F00_59CB_786C_76F4(unit, _____6301_7EED_79D2)
    _____663E_793A_5E38_89C4_6280_80FD_541F_5531_6761({["总时长"] = _____6301_7EED_79D2, ["颜色ID"] = 3, ["标题文本"] = _____6807_9898_6587_672C, ["提示文本"] = _____63D0_793A_6587_672C})
end
____exports["开始莫尔特斯大招施法"] = function(unit, _____6301_7EED_79D2, _____6807_9898_6587_672C, _____63D0_793A_6587_672C)
    _____5F00_59CB_786C_76F4(unit, _____6301_7EED_79D2)
    _____663E_793A_5927_62DB_541F_5531_6761({
        ["通道"] = "大招",
        ["总时长"] = _____6301_7EED_79D2,
        ["颜色ID"] = 3,
        ["标题文本"] = _____6807_9898_6587_672C,
        ["提示文本"] = _____63D0_793A_6587_672C
    })
end
____exports["显示莫尔特斯大招吟唱条"] = function(_____6301_7EED_79D2, _____6807_9898_6587_672C, _____63D0_793A_6587_672C)
    _____663E_793A_5927_62DB_541F_5531_6761({
        ["通道"] = "大招",
        ["总时长"] = _____6301_7EED_79D2,
        ["颜色ID"] = 3,
        ["标题文本"] = _____6807_9898_6587_672C,
        ["提示文本"] = _____63D0_793A_6587_672C
    })
end
____exports["关闭莫尔特斯大招吟唱条"] = function()
    _____5173_95ED_541F_5531_6761("大招")
end
return ____exports
