--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____00_FF0E_914D_7F6E_7C7B_578B = require("系统.03．技能系统.06．AI自动使用技能.03．Boss战启动桥接.00．战斗启动属性.00．配置类型")
local _____9ED8_8BA4Boss_5F31_70B9_6570_91CF_57FA_7840_503C = ____00_FF0E_914D_7F6E_7C7B_578B["默认Boss弱点数量基础值"]
local ____00_FF0E_5F02_754CBoss_5171_4EAB_914D_7F6E = require("系统.03．技能系统.06．AI自动使用技能.03．Boss战启动桥接.00．战斗启动属性.03．异界Boss战斗启动属性配置表.00．异界Boss共享配置")
local _____5F02_754CBoss_9ED8_8BA4_6B7B_4EA1_5956_52B1_57FA_7840_5168_5C5E_6027 = ____00_FF0E_5F02_754CBoss_5171_4EAB_914D_7F6E["异界Boss默认死亡奖励基础全属性"]
local _____5F02_754CBoss_7EDF_4E00_80DC_5229_97F3_4E50_53D8_91CF_540D = ____00_FF0E_5F02_754CBoss_5171_4EAB_914D_7F6E["异界Boss统一胜利音乐变量名"]
____exports["单位U007战斗启动属性配置"] = {
    ["归类"] = "异界Boss",
    ["单位ID"] = "U007",
    ["单位名"] = "安兹·乌尔·恭",
    ["动态地点矩形"] = {
        ID = "ainz-battlefield",
        ["名称"] = "安兹乌尔恭战斗区域",
        ["左"] = 6752,
        ["右"] = 9984,
        ["下"] = -16672,
        ["上"] = -13760
    },
    ["转换场景"] = false,
    ["胜利音乐变量名"] = _____5F02_754CBoss_7EDF_4E00_80DC_5229_97F3_4E50_53D8_91CF_540D,
    ["战斗音乐变量名"] = "gg_snd_battleBoss3",
    ["魔抗"] = 0.35,
    ["暴击率"] = 0.2,
    ["暴击伤害"] = 0.5,
    ["眩晕抗性"] = 0.6,
    ["命中率"] = 0.3,
    ["闪避率"] = 0.08,
    ["魔法穿透"] = 0.5,
    ["弱点数量基础值"] = _____9ED8_8BA4Boss_5F31_70B9_6570_91CF_57FA_7840_503C,
    ["弱点数量每层N增量"] = 0,
    ["天生弱点数"] = 1,
    ["光弱"] = true,
    ["器弱伤害需求生命百分比"] = 0.03,
    ["护盾基础值"] = 12,
    ["护盾每层N增量"] = 2,
    ["死亡后所有玩家英雄基础全属性"] = _____5F02_754CBoss_9ED8_8BA4_6B7B_4EA1_5956_52B1_57FA_7840_5168_5C5E_6027
}
return ____exports
