--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____require_result_0 = require("系统.02．物品系统.13．物品名反查")
local _____6309_540D_5B57_53CD_67E5_7269_54C1ID = ____require_result_0["按名字反查物品ID"]
local ____require_result_1 = require("lib.扩展函数.封装函数.01．通用工具.01．FourCC转换安全版")
local stringToFourCCSafe = ____require_result_1.stringToFourCCSafe
____exports["伤害事件装备名称"] = {
    ["豺狼皮甲"] = "豺狼皮甲",
    ["灵石"] = "灵石",
    ["傀岩杖"] = "傀岩杖",
    ["沙漠蜥蜴之魂"] = "沙漠蜥蜴之魂",
    ["湖之袍"] = "湖之袍",
    ["龙虾硬甲"] = "龙虾硬甲",
    ["湖之龙枪"] = "湖之龙枪",
    ["银魔手套"] = "银魔手套|cffcc99ff（唯一）|r",
    ["异雷法袍"] = "异雷法袍",
    ["毒囊道具"] = "毒囊道具",
    ["地狱火卡牌魔法"] = "|cffff6800地狱火卡牌|r|cff00ffff（魔法）|r",
    ["熔灵大剑"] = "熔灵大剑",
    ["安恶之鞋"] = "|cffcc99ff安恶之鞋|r",
    ["灵墓之戒"] = "灵墓之戒",
    ["瑞冥戒指"] = "|cffff0000瑞冥戒指|r",
    ["史诗远古魔刃"] = "史诗远古魔刃",
    ["魔力雷锤"] = "魔力雷锤",
    ["闪电权杖"] = "闪电权杖",
    ["斯尔法袍"] = "|cffccffff斯尔法袍|r",
    ["锋利巨魔爪"] = "|cffccffff锋利巨魔爪（只能携带一件）|n|r",
    ["巨魔战剑"] = "巨魔战剑",
    ["精粹法刺"] = "精粹法刺"
}
local function _____53D6_88C5_5907_7269_54C1ID(_____88C5_5907_540D_79F0)
    local rawId = _____6309_540D_5B57_53CD_67E5_7269_54C1ID(_____88C5_5907_540D_79F0)
    if rawId == nil or rawId == "" then
        return 0
    end
    return stringToFourCCSafe(rawId)
end
____exports["伤害事件装备ID"] = {
    ["豺狼皮甲"] = _____53D6_88C5_5907_7269_54C1ID(____exports["伤害事件装备名称"]["豺狼皮甲"]),
    ["灵石"] = _____53D6_88C5_5907_7269_54C1ID(____exports["伤害事件装备名称"]["灵石"]),
    ["傀岩杖"] = _____53D6_88C5_5907_7269_54C1ID(____exports["伤害事件装备名称"]["傀岩杖"]),
    ["沙漠蜥蜴之魂"] = _____53D6_88C5_5907_7269_54C1ID(____exports["伤害事件装备名称"]["沙漠蜥蜴之魂"]),
    ["湖之袍"] = _____53D6_88C5_5907_7269_54C1ID(____exports["伤害事件装备名称"]["湖之袍"]),
    ["龙虾硬甲"] = _____53D6_88C5_5907_7269_54C1ID(____exports["伤害事件装备名称"]["龙虾硬甲"]),
    ["湖之龙枪"] = _____53D6_88C5_5907_7269_54C1ID(____exports["伤害事件装备名称"]["湖之龙枪"]),
    ["银魔手套"] = _____53D6_88C5_5907_7269_54C1ID(____exports["伤害事件装备名称"]["银魔手套"]),
    ["异雷法袍"] = _____53D6_88C5_5907_7269_54C1ID(____exports["伤害事件装备名称"]["异雷法袍"]),
    ["毒囊道具"] = _____53D6_88C5_5907_7269_54C1ID(____exports["伤害事件装备名称"]["毒囊道具"]),
    ["地狱火卡牌魔法"] = _____53D6_88C5_5907_7269_54C1ID(____exports["伤害事件装备名称"]["地狱火卡牌魔法"]),
    ["熔灵大剑"] = _____53D6_88C5_5907_7269_54C1ID(____exports["伤害事件装备名称"]["熔灵大剑"]),
    ["安恶之鞋"] = _____53D6_88C5_5907_7269_54C1ID(____exports["伤害事件装备名称"]["安恶之鞋"]),
    ["灵墓之戒"] = _____53D6_88C5_5907_7269_54C1ID(____exports["伤害事件装备名称"]["灵墓之戒"]),
    ["瑞冥戒指"] = _____53D6_88C5_5907_7269_54C1ID(____exports["伤害事件装备名称"]["瑞冥戒指"]),
    ["史诗远古魔刃"] = _____53D6_88C5_5907_7269_54C1ID(____exports["伤害事件装备名称"]["史诗远古魔刃"]),
    ["魔力雷锤"] = _____53D6_88C5_5907_7269_54C1ID(____exports["伤害事件装备名称"]["魔力雷锤"]),
    ["闪电权杖"] = _____53D6_88C5_5907_7269_54C1ID(____exports["伤害事件装备名称"]["闪电权杖"]),
    ["斯尔法袍"] = _____53D6_88C5_5907_7269_54C1ID(____exports["伤害事件装备名称"]["斯尔法袍"]),
    ["锋利巨魔爪"] = _____53D6_88C5_5907_7269_54C1ID(____exports["伤害事件装备名称"]["锋利巨魔爪"]),
    ["巨魔战剑"] = _____53D6_88C5_5907_7269_54C1ID(____exports["伤害事件装备名称"]["巨魔战剑"]),
    ["精粹法刺"] = _____53D6_88C5_5907_7269_54C1ID(____exports["伤害事件装备名称"]["精粹法刺"])
}
____exports["伤害事件测试装备顺序"] = {
    ____exports["伤害事件装备名称"]["豺狼皮甲"],
    ____exports["伤害事件装备名称"]["灵石"],
    ____exports["伤害事件装备名称"]["傀岩杖"],
    ____exports["伤害事件装备名称"]["沙漠蜥蜴之魂"],
    ____exports["伤害事件装备名称"]["湖之袍"],
    ____exports["伤害事件装备名称"]["龙虾硬甲"],
    ____exports["伤害事件装备名称"]["湖之龙枪"],
    ____exports["伤害事件装备名称"]["银魔手套"],
    ____exports["伤害事件装备名称"]["异雷法袍"],
    ____exports["伤害事件装备名称"]["毒囊道具"],
    ____exports["伤害事件装备名称"]["地狱火卡牌魔法"],
    ____exports["伤害事件装备名称"]["熔灵大剑"],
    ____exports["伤害事件装备名称"]["安恶之鞋"],
    ____exports["伤害事件装备名称"]["灵墓之戒"],
    ____exports["伤害事件装备名称"]["瑞冥戒指"],
    ____exports["伤害事件装备名称"]["史诗远古魔刃"],
    ____exports["伤害事件装备名称"]["魔力雷锤"],
    ____exports["伤害事件装备名称"]["闪电权杖"],
    ____exports["伤害事件装备名称"]["斯尔法袍"],
    ____exports["伤害事件装备名称"]["锋利巨魔爪"],
    ____exports["伤害事件装备名称"]["巨魔战剑"],
    ____exports["伤害事件装备名称"]["精粹法刺"]
}
return ____exports
