--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
---
-- @noSelfInFile
____exports["主动技能装备名称"] = {
    ["黑牧杖"] = "黑牧杖",
    ["战士大衣"] = "战士大衣",
    ["比安血爪"] = "比安血爪",
    ["熔岩权杖"] = "熔岩权杖",
    ["地狱火卡牌"] = "地狱火卡牌（能量）",
    ["巨魔大剑"] = "巨魔大剑（唯一）",
    ["破血之戒"] = "破血之戒",
    ["远古毒咒护符"] = "远古毒咒护符",
    ["史莱姆粘液瓶"] = "史莱姆粘液瓶",
    ["地精钥匙"] = "地精钥匙",
    ["祭祀之杖"] = "祭祀之杖",
    ["幽冥法杖"] = "幽冥法杖",
    ["熔岩恶魔之灵眼"] = "熔岩恶魔之灵眼",
    ["暗幽亡戒"] = "暗幽亡戒",
    ["使者魔炉"] = "使者魔炉",
    ["汭冥血杖"] = "汭冥血杖",
    ["汭冥血杖强化"] = "汭冥血杖-强化",
    ["使者精神魔杖"] = "使者精神魔杖",
    ["史诗远古魔刃"] = "史诗远古魔刃",
    ["焰虚宝珠"] = "焰虚宝珠",
    ["先祖之狱杖"] = "先祖之狱杖",
    ["咆哮之心"] = "咆哮之心"
}
return ____exports
