--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
____exports["召唤师技能配置"] = {
    ["嘲讽技能ID"] = "嘲讽#A0IR",
    ["极限复苏技能ID"] = "极限复苏#A0IP",
    ["闪烁技能ID"] = "闪烁#A0IN",
    ["嘲讽护甲提升"] = 50,
    ["嘲讽魔抗提升"] = 0.25,
    ["极限复苏生命恢复效率提升"] = 0.5,
    ["极限复苏受到的治疗率提升"] = 0.25,
    ["临时效果持续毫秒"] = 5000,
    ["极限复苏特效路径"] = "war3mapImported\\Firechest01.mdx",
    ["极限复苏特效挂点"] = "origin",
    ["极限复苏特效持续秒"] = 5,
    ["闪烁最大步数"] = 20,
    ["闪烁每步距离"] = 25,
    ["闪烁移动间隔毫秒"] = 10,
    ["闪烁阻挡提示"] = "前方地形不可通行，无法继续前进。",
    ["闪烁阻挡提示持续秒"] = 15
}
return ____exports
