--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____01_FF0E_5267_60C5_52A8_4F5C_4E0A_4E0B_6587 = require("系统.11．剧情系统.01．主线任务.00．剧情系统核心工具.01．剧情动作上下文")
local _____5199_5165_5F53_524D_5267_60C5_52A8_4F5C_4E0A_4E0B_6587 = ____01_FF0E_5267_60C5_52A8_4F5C_4E0A_4E0B_6587["写入当前剧情动作上下文"]
local _____5199_5165_5267_60C5_8FDB_5EA6 = ____01_FF0E_5267_60C5_52A8_4F5C_4E0A_4E0B_6587["写入剧情进度"]
local ____02_FF0E_5267_60C5_6B65_9AA4_64AD_653E_5668 = require("系统.11．剧情系统.01．主线任务.02．剧情步骤.02．剧情步骤播放器")
local _____64AD_653E_4E3B_7EBF_5267_60C5_7247_6BB5 = ____02_FF0E_5267_60C5_6B65_9AA4_64AD_653E_5668["播放主线剧情片段"]
____exports["处理技能推进主线剧情"] = function(_____53C2_6570)
    local _____7247_6BB5ID = _____53C2_6570["片段ID"] or ""
    if type(_____53C2_6570["目标进度"]) == "number" and _____53C2_6570["目标进度"] > 0 then
        _____5199_5165_5267_60C5_8FDB_5EA6(_____53C2_6570["目标进度"])
    end
    _____5199_5165_5F53_524D_5267_60C5_52A8_4F5C_4E0A_4E0B_6587({["片段ID"] = _____7247_6BB5ID, ["触发配置名"] = _____53C2_6570["触发配置名"], ["触发单位"] = _____53C2_6570["触发单位"]})
    if _____7247_6BB5ID == "" then
        return true
    end
    return _____64AD_653E_4E3B_7EBF_5267_60C5_7247_6BB5(_____7247_6BB5ID, {["片段ID"] = _____7247_6BB5ID, ["触发配置名"] = _____53C2_6570["触发配置名"], ["触发单位"] = _____53C2_6570["触发单位"]})
end
return ____exports
