local ____lualib = require("lualib_bundle")
local __TS__ObjectAssign = ____lualib.__TS__ObjectAssign
local ____exports = {}
local ____00_FF0E_5171_4EAB = require("系统.03．技能系统.00．技能模板+函数.01．技能函数.14．落点打击.01．落点打击系统.00．共享")
local AddSpecialEffect = ____00_FF0E_5171_4EAB.AddSpecialEffect
local DestroyEffect = ____00_FF0E_5171_4EAB.DestroyEffect
local _____9ED8_8BA4_843D_96F7_7279_6548 = ____00_FF0E_5171_4EAB["默认落雷特效"]
local _____9ED8_8BA4_653B_51FB_7C7B_578B = ____00_FF0E_5171_4EAB["默认攻击类型"]
local _____9ED8_8BA4_4F24_5BB3_7C7B_578B = ____00_FF0E_5171_4EAB["默认伤害类型"]
local _____9ED8_8BA4_6B66_5668_7C7B_578B = ____00_FF0E_5171_4EAB["默认武器类型"]
local _____5355_4F4D_662F_5426_53D7_5F71_54CD = ____00_FF0E_5171_4EAB["单位是否受影响"]
local ____require_result_0 = require("系统.04．伤害系统.08．技能伤害系统")
local _____9020_6210AOE_6280_80FD_4F24_5BB3 = ____require_result_0["造成AOE技能伤害"]
local ____require_result_1 = require("系统.03．技能系统.00．技能模板+函数.02．通用函数.16．技能提示圈工厂")
local _____521B_5EFA_6280_80FD_63D0_793A_5708 = ____require_result_1["创建技能提示圈"]
local ____require_result_2 = require("lib.扩展函数.自定义扩展函数.01．选取中心范围")
local getUnitsInRange = ____require_result_2.getUnitsInRange
local ____require_result_3 = require("系统.03．技能系统.00．技能模板+函数.02．通用函数.10．命中规则")
local _____5355_4F4D_662F_5426_8FD8_80FD_547D_4E2D = ____require_result_3["单位是否还能命中"]
local _____8BB0_5F55_5355_4F4D_547D_4E2D = ____require_result_3["记录单位命中"]
____exports["创建落点提示特效"] = function(_____53C2_6570, _____843D_70B9)
    if _____53C2_6570["提示圈"] == false or _____53C2_6570["提示特效启用"] == false then
        return
    end
    local ____53C2_6570__63D0_793A_534A_5F84_4 = _____53C2_6570["提示半径"]
    if ____53C2_6570__63D0_793A_534A_5F84_4 == nil then
        ____53C2_6570__63D0_793A_534A_5F84_4 = _____53C2_6570["伤害半径"]
    end
    local _____63D0_793A_534A_5F84 = ____53C2_6570__63D0_793A_534A_5F84_4
    if _____63D0_793A_534A_5F84 <= 0 or _____843D_70B9["触发延迟"] <= 0 then
        return
    end
    local ____temp_5
    if _____53C2_6570["提示圈"] ~= nil then
        ____temp_5 = _____53C2_6570["提示圈"]
    else
        ____temp_5 = {}
    end
    local _____81EA_5B9A_4E49_63D0_793A_5708 = ____temp_5
    local ____521B_5EFA_6280_80FD_63D0_793A_5708_13 = _____521B_5EFA_6280_80FD_63D0_793A_5708
    local ____81EA_5B9A_4E49_63D0_793A_5708__7C7B_578B_6 = _____81EA_5B9A_4E49_63D0_793A_5708["类型"]
    if ____81EA_5B9A_4E49_63D0_793A_5708__7C7B_578B_6 == nil then
        ____81EA_5B9A_4E49_63D0_793A_5708__7C7B_578B_6 = "渐变圆形"
    end
    local ____81EA_5B9A_4E49_63D0_793A_5708_X_7 = _____81EA_5B9A_4E49_63D0_793A_5708.X
    if ____81EA_5B9A_4E49_63D0_793A_5708_X_7 == nil then
        ____81EA_5B9A_4E49_63D0_793A_5708_X_7 = _____843D_70B9.X
    end
    local ____81EA_5B9A_4E49_63D0_793A_5708_Y_8 = _____81EA_5B9A_4E49_63D0_793A_5708.Y
    if ____81EA_5B9A_4E49_63D0_793A_5708_Y_8 == nil then
        ____81EA_5B9A_4E49_63D0_793A_5708_Y_8 = _____843D_70B9.Y
    end
    local ____81EA_5B9A_4E49_63D0_793A_5708__534A_5F84_9 = _____81EA_5B9A_4E49_63D0_793A_5708["半径"]
    if ____81EA_5B9A_4E49_63D0_793A_5708__534A_5F84_9 == nil then
        ____81EA_5B9A_4E49_63D0_793A_5708__534A_5F84_9 = _____63D0_793A_534A_5F84
    end
    local ____81EA_5B9A_4E49_63D0_793A_5708__6301_7EED_65F6_95F4_10 = _____81EA_5B9A_4E49_63D0_793A_5708["持续时间"]
    if ____81EA_5B9A_4E49_63D0_793A_5708__6301_7EED_65F6_95F4_10 == nil then
        ____81EA_5B9A_4E49_63D0_793A_5708__6301_7EED_65F6_95F4_10 = _____843D_70B9["触发延迟"]
    end
    local ____81EA_5B9A_4E49_63D0_793A_5708__52A8_753B_901F_5EA6_11 = _____81EA_5B9A_4E49_63D0_793A_5708["动画速度"]
    if ____81EA_5B9A_4E49_63D0_793A_5708__52A8_753B_901F_5EA6_11 == nil then
        ____81EA_5B9A_4E49_63D0_793A_5708__52A8_753B_901F_5EA6_11 = _____53C2_6570["提示特效动画速度"]
    end
    local ____81EA_5B9A_4E49_63D0_793A_5708__6765_6E90_5355_4F4D_12 = _____81EA_5B9A_4E49_63D0_793A_5708["来源单位"]
    if ____81EA_5B9A_4E49_63D0_793A_5708__6765_6E90_5355_4F4D_12 == nil then
        ____81EA_5B9A_4E49_63D0_793A_5708__6765_6E90_5355_4F4D_12 = _____53C2_6570["所有者"]
    end
    ____521B_5EFA_6280_80FD_63D0_793A_5708_13(__TS__ObjectAssign({}, _____81EA_5B9A_4E49_63D0_793A_5708, {
        ["类型"] = ____81EA_5B9A_4E49_63D0_793A_5708__7C7B_578B_6,
        X = ____81EA_5B9A_4E49_63D0_793A_5708_X_7,
        Y = ____81EA_5B9A_4E49_63D0_793A_5708_Y_8,
        ["半径"] = ____81EA_5B9A_4E49_63D0_793A_5708__534A_5F84_9,
        ["持续时间"] = ____81EA_5B9A_4E49_63D0_793A_5708__6301_7EED_65F6_95F4_10,
        ["动画速度"] = ____81EA_5B9A_4E49_63D0_793A_5708__52A8_753B_901F_5EA6_11,
        ["来源单位"] = ____81EA_5B9A_4E49_63D0_793A_5708__6765_6E90_5355_4F4D_12
    }))
end
local function _____521B_5EFA_843D_70B9_547D_4E2D_7279_6548(_____53C2_6570, X, Y)
    local ____53C2_6570__843D_70B9_7279_6548_6A21_578B_14 = _____53C2_6570["落点特效模型"]
    if ____53C2_6570__843D_70B9_7279_6548_6A21_578B_14 == nil then
        ____53C2_6570__843D_70B9_7279_6548_6A21_578B_14 = _____9ED8_8BA4_843D_96F7_7279_6548
    end
    local _____6A21_578B_8DEF_5F84 = ____53C2_6570__843D_70B9_7279_6548_6A21_578B_14
    local _____7279_6548 = AddSpecialEffect(_____6A21_578B_8DEF_5F84, X, Y)
    if _____7279_6548 ~= nil and _____7279_6548 ~= 0 then
        DestroyEffect(_____7279_6548)
    end
end
____exports["结算单次落点伤害"] = function(_____5B9E_4F8B, _____843D_70B9_5E8F_53F7)
    local _____843D_70B9 = _____5B9E_4F8B["落点列表"][_____843D_70B9_5E8F_53F7 + 1]
    if _____843D_70B9 == nil then
        return
    end
    _____521B_5EFA_843D_70B9_547D_4E2D_7279_6548(_____5B9E_4F8B["参数"], _____843D_70B9.X, _____843D_70B9.Y)
    local ____opt_15 = _____5B9E_4F8B["参数"]["on单次生效"]
    if ____opt_15 ~= nil then
        ____opt_15(_____843D_70B9.X, _____843D_70B9.Y, _____843D_70B9_5E8F_53F7 + 1, _____5B9E_4F8B.id)
    end
    local _____4F24_5BB3_503C = _____5B9E_4F8B["参数"]["伤害值"] or 0
    if _____4F24_5BB3_503C > 0 and _____5B9E_4F8B["参数"]["伤害半径"] > 0 then
        local _____5355_4F4D_5217_8868 = getUnitsInRange(_____843D_70B9.X, _____843D_70B9.Y, _____5B9E_4F8B["参数"]["伤害半径"])
        for ____, _____5355_4F4D in ipairs(_____5355_4F4D_5217_8868) do
            do
                if not _____5355_4F4D_662F_5426_53D7_5F71_54CD(_____5355_4F4D, _____5B9E_4F8B["参数"]) then
                    goto __continue10
                end
                if not _____5355_4F4D_662F_5426_8FD8_80FD_547D_4E2D(_____5B9E_4F8B["命中规则状态"], _____5355_4F4D) then
                    goto __continue10
                end
                local ____9020_6210AOE_6280_80FD_4F24_5BB3_21 = _____9020_6210AOE_6280_80FD_4F24_5BB3
                local ____5B9E_4F8B__53C2_6570__6240_6709_8005_17 = _____5B9E_4F8B["参数"]["所有者"]
                if ____5B9E_4F8B__53C2_6570__6240_6709_8005_17 == nil then
                    ____5B9E_4F8B__53C2_6570__6240_6709_8005_17 = _____5355_4F4D
                end
                local ____5B9E_4F8B__53C2_6570__4F24_5BB3_7C7B_578B_18 = _____5B9E_4F8B["参数"]["伤害类型"]
                if ____5B9E_4F8B__53C2_6570__4F24_5BB3_7C7B_578B_18 == nil then
                    ____5B9E_4F8B__53C2_6570__4F24_5BB3_7C7B_578B_18 = _____9ED8_8BA4_4F24_5BB3_7C7B_578B
                end
                local ____5B9E_4F8B__53C2_6570__653B_51FB_7C7B_578B_19 = _____5B9E_4F8B["参数"]["攻击类型"]
                if ____5B9E_4F8B__53C2_6570__653B_51FB_7C7B_578B_19 == nil then
                    ____5B9E_4F8B__53C2_6570__653B_51FB_7C7B_578B_19 = _____9ED8_8BA4_653B_51FB_7C7B_578B
                end
                local ____5B9E_4F8B__53C2_6570__6B66_5668_7C7B_578B_20 = _____5B9E_4F8B["参数"]["武器类型"]
                if ____5B9E_4F8B__53C2_6570__6B66_5668_7C7B_578B_20 == nil then
                    ____5B9E_4F8B__53C2_6570__6B66_5668_7C7B_578B_20 = _____9ED8_8BA4_6B66_5668_7C7B_578B
                end
                ____9020_6210AOE_6280_80FD_4F24_5BB3_21({
                    ["来源"] = ____5B9E_4F8B__53C2_6570__6240_6709_8005_17,
                    ["目标"] = _____5355_4F4D,
                    ["伤害"] = _____4F24_5BB3_503C,
                    ["伤害类型"] = ____5B9E_4F8B__53C2_6570__4F24_5BB3_7C7B_578B_18,
                    ranged = false,
                    attackType = ____5B9E_4F8B__53C2_6570__653B_51FB_7C7B_578B_19,
                    weaponType = ____5B9E_4F8B__53C2_6570__6B66_5668_7C7B_578B_20,
                    ["来源类型"] = _____5B9E_4F8B["参数"]["来源类型"] or "单位技能",
                    ["技能ID"] = _____5B9E_4F8B["参数"]["技能ID"],
                    ["技能实例ID"] = _____5B9E_4F8B["参数"]["技能实例ID"],
                    ["标签"] = _____5B9E_4F8B["参数"]["技能标签"],
                    ["参与技能伤害加成"] = _____5B9E_4F8B["参数"]["参与技能伤害加成"]
                })
                _____8BB0_5F55_5355_4F4D_547D_4E2D(_____5B9E_4F8B["命中规则状态"], _____5355_4F4D)
                local ____opt_22 = _____5B9E_4F8B["参数"]["on单次命中"]
                if ____opt_22 ~= nil then
                    ____opt_22(_____5355_4F4D, _____843D_70B9_5E8F_53F7 + 1, _____5B9E_4F8B.id)
                end
            end
            ::__continue10::
        end
    end
end
return ____exports
