/** @noSelfInFile */

import type { 固定属性配置, 特殊精英暴击覆写配置 } from "./00．常量与类型";

export const 暴击率固定配置表: 固定属性配置[] = [
  { 单位名: "狼人战士", 属性名: "暴击率", 数值: 0.20 },
  { 单位名: "狼人骑士", 属性名: "暴击率", 数值: 0.20 },
  { 单位名: "蒙面人队长", 属性名: "暴击率", 数值: 0.20 },
  { 单位名: "蛇之看守者", 属性名: "暴击率", 数值: 0.20 },
  { 单位名: "恶魔剑客", 属性名: "暴击率", 数值: 0.20 },
  { 单位名: "树魔狂战士", 属性名: "暴击率", 数值: 0.20 },
];

export const 闪避率固定配置表: 固定属性配置[] = [
  { 单位名: "女妖巫婆", 属性名: "闪避率", 数值: 0.15 },
  { 单位名: "女妖风暴巫师", 属性名: "闪避率", 数值: 0.15 },
  { 单位名: "女妖女皇", 属性名: "闪避率", 数值: 0.15 },
  { 单位名: "巨魔猎头者", 属性名: "闪避率", 数值: 0.25 },
];

export const 命中率固定配置表: 固定属性配置[] = [
  { 单位名: "巨魔猎头者", 属性名: "命中率", 数值: 125.0 },
];

export const 特殊精英暴击覆写配置表: 特殊精英暴击覆写配置[] = [
  { 单位名: "地精剑客", X: -25751.50, Y: -15692.10, 暴击率: 0.30 },
  { 单位名: "森林狼王", X: -29030.10, Y: -11275.40, 暴击率: 0.20 },
  { 单位名: "狼人首领", X: 4619.10, Y: -24238.10, 暴击率: 0.35 },
];
