/** @noSelfInFile */

import type { 固定属性配置, 特殊精英暴击覆写配置 } from "./00．常量与类型";

export const 额外精英刷怪单位ID列表: string[] = ["n04A", "n03R"];

export const 暴击率固定配置表: 固定属性配置[] = [
  { 单位ID: "n01W", 属性名: "暴击率", 数值: 0.20 },
  { 单位ID: "n003", 属性名: "暴击率", 数值: 0.20 },
  { 单位ID: "n01R", 属性名: "暴击率", 数值: 0.20 },
  { 单位ID: "nbds", 属性名: "暴击率", 数值: 0.20 },
  { 单位ID: "n03M", 属性名: "暴击率", 数值: 0.20 },
  { 单位ID: "nftb", 属性名: "暴击率", 数值: 0.20 },
];

export const 闪避率固定配置表: 固定属性配置[] = [
  { 单位ID: "nhrw", 属性名: "闪避率", 数值: 0.15 },
  { 单位ID: "nhrh", 属性名: "闪避率", 数值: 0.15 },
  { 单位ID: "nhrq", 属性名: "闪避率", 数值: 0.15 },
  { 单位ID: "ohun", 属性名: "闪避率", 数值: 0.25 },
];

export const 命中率固定配置表: 固定属性配置[] = [
  { 单位ID: "ohun", 属性名: "命中率", 数值: 125.0 },
];

export const 特殊精英暴击覆写配置表: 特殊精英暴击覆写配置[] = [
  { 单位ID: "N00B", X: -25751.50, Y: -15692.10, 暴击率: 0.30 },
  { 单位ID: "nwld", X: -29030.10, Y: -11275.40, 暴击率: 0.20 },
  { 单位ID: "n01V", X: 4619.10, Y: -24238.10, 暴击率: 0.35 },
];
