--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____00_FF0E_914D_7F6E_7C7B_578B = require("系统.03．技能系统.06．AI自动使用技能.03．Boss战启动桥接.00．战斗启动属性.00．配置类型")
local _____9ED8_8BA4Boss_5F31_70B9_6570_91CF_57FA_7840_503C = ____00_FF0E_914D_7F6E_7C7B_578B["默认Boss弱点数量基础值"]
____exports["单位N05L战斗启动属性配置"] = {
    ["归类"] = "英雄Boss",
    ["单位ID"] = "N05L",
    ["单位名"] = "利尔·伯特",
    ["战斗音乐变量名"] = "gg_snd_battleBoss2",
    ["胜利音乐变量名"] = "gg_snd_shengliBgm",
    ["地点变量名"] = "gg_rct______________056",
    ["转换场景"] = true,
    ["BS移动X轴"] = 29767.2,
    ["BS移动Y轴"] = 5102.2,
    ["玩家移动X轴"] = 27710.1,
    ["玩家移动Y轴"] = 5054.3,
    ["魔抗"] = 0.3,
    ["暴击率"] = 0.4,
    ["暴击伤害"] = 0.5,
    ["眩晕抗性"] = 0.25,
    ["命中率"] = 0.2,
    ["闪避率"] = 0.3,
    ["护甲穿透"] = 0.5,
    ["弱点数量基础值"] = _____9ED8_8BA4Boss_5F31_70B9_6570_91CF_57FA_7840_503C,
    ["弱点数量每层N增量"] = 0,
    ["天生弱点数"] = 2,
    ["额外随机弱点数"] = 1,
    ["枪弱"] = true,
    ["风弱"] = true,
    ["器弱伤害需求生命百分比"] = 0.03,
    ["护盾基础值"] = 7,
    ["护盾每层N增量"] = 2
}
return ____exports
