--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
____exports["单位N05S战斗启动属性配置"] = {
    ["归类"] = "英雄Boss",
    ["单位ID"] = "N05S",
    ["单位名"] = "树魔首领",
    ["战斗音乐变量名"] = "gg_snd_Bossbattle001",
    ["胜利音乐变量名"] = "gg_snd_shengliBgm",
    ["地点变量名"] = "gg_rct______________1524",
    ["转换场景"] = true,
    ["BS移动X轴"] = 23133.4,
    ["BS移动Y轴"] = 9679.6,
    ["玩家移动X轴"] = 24874.2,
    ["玩家移动Y轴"] = 10397.5,
    ["魔抗"] = 0.3,
    ["暴击率"] = 0.15,
    ["暴击伤害"] = 0.5,
    ["眩晕抗性"] = 0.35,
    ["命中率"] = 0.2,
    ["闪避率"] = 0.1,
    ["火弱"] = true,
    ["弓弱"] = true,
    ["器弱伤害需求生命百分比"] = 0.03,
    ["弱点数量基础值"] = 2,
    ["弱点数量每层N增量"] = 0,
    ["天生弱点数"] = 2,
    ["额外随机弱点数"] = 1,
    ["护盾基础值"] = 8,
    ["护盾每层N增量"] = 2
}
return ____exports
