--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____00_FF0E_914D_7F6E_7C7B_578B = require("系统.03．技能系统.06．AI自动使用技能.03．Boss战启动桥接.00．战斗启动属性.00．配置类型")
local _____9ED8_8BA4Boss_5F31_70B9_6570_91CF_57FA_7840_503C = ____00_FF0E_914D_7F6E_7C7B_578B["默认Boss弱点数量基础值"]
____exports["单位N05T战斗启动属性配置"] = {
    ["归类"] = "英雄Boss",
    ["单位ID"] = "N05T",
    ["单位名"] = "菲利斯",
    ["战斗音乐路径"] = "Sound\\BGM\\Scene\\SealCore\\Falcom Sound Team J.D.K. - Guardian of the Sacred Treasure.mp3",
    ["战斗音乐变量名"] = "gg_snd_battleBoss2",
    ["胜利音乐变量名"] = "gg_snd_shengliBgm",
    ["地点区域名称"] = "异界Boss.战斗区域",
    ["转换场景"] = true,
    ["BS移动X轴"] = 26503,
    ["BS移动Y轴"] = 20921.8,
    ["玩家移动X轴"] = 26807.5,
    ["玩家移动Y轴"] = 17016.8,
    ["魔抗"] = 0.3,
    ["暴击率"] = 0.2,
    ["暴击伤害"] = 0.5,
    ["眩晕抗性"] = 0.35,
    ["命中率"] = 0.25,
    ["闪避率"] = 0.1,
    ["风弱"] = true,
    ["杖弱"] = true,
    ["器弱伤害需求生命百分比"] = 0.03,
    ["弱点数量基础值"] = _____9ED8_8BA4Boss_5F31_70B9_6570_91CF_57FA_7840_503C,
    ["弱点数量每层N增量"] = 0,
    ["天生弱点数"] = 2,
    ["额外随机弱点数"] = 1,
    ["护盾基础值"] = 8,
    ["护盾每层N增量"] = 2
}
local _____7B2C_4E8C_519B_56E2_6218_58EB_62A4_536B_914D_7F6E = {
    ["单位ID"] = "n060",
    ["单位名"] = "第二军团战士",
    ["每批生成数量"] = 1,
    ["同类最大存活数量"] = 4,
    ["随机生成位置"] = {["中心"] = "Boss战矩形中心", ["最小半径"] = 1800, ["最大半径"] = 2000},
    ["主Boss死亡时立刻死亡"] = true
}
local _____7B2C_4E8C_519B_56E2_5F13_7BAD_624B_62A4_536B_914D_7F6E = {
    ["单位ID"] = "n061",
    ["单位名"] = "第二军团弓箭手",
    ["每批生成数量"] = 1,
    ["同类最大存活数量"] = 4,
    ["随机生成位置"] = {["中心"] = "Boss战矩形中心", ["最小半径"] = 1800, ["最大半径"] = 2000},
    ["主Boss死亡时立刻死亡"] = true
}
local _____7B2C_4E8C_519B_56E2_62A4_536B_62A4_536B_914D_7F6E = {
    ["单位ID"] = "n063",
    ["单位名"] = "第二军团护卫",
    ["每批生成数量"] = 1,
    ["同类最大存活数量"] = 2,
    ["随机生成位置"] = {["中心"] = "Boss战矩形中心", ["最小半径"] = 1800, ["最大半径"] = 2000},
    ["主Boss死亡时立刻死亡"] = true
}
local _____7B2C_4E8C_519B_56E2_672F_58EB_62A4_536B_914D_7F6E = {
    ["单位ID"] = "n062",
    ["单位名"] = "第二军团术士",
    ["每批生成数量"] = 1,
    ["同类最大存活数量"] = 2,
    ["随机生成位置"] = {["中心"] = "Boss战矩形中心", ["最小半径"] = 1800, ["最大半径"] = 2000},
    ["主Boss死亡时立刻死亡"] = true
}
local _____83F2_5229_65AF_7B2C_4E8C_519B_56E2_62A4_536B_5217_8868 = {_____7B2C_4E8C_519B_56E2_6218_58EB_62A4_536B_914D_7F6E, _____7B2C_4E8C_519B_56E2_5F13_7BAD_624B_62A4_536B_914D_7F6E, _____7B2C_4E8C_519B_56E2_62A4_536B_62A4_536B_914D_7F6E, _____7B2C_4E8C_519B_56E2_672F_58EB_62A4_536B_914D_7F6E}
____exports["单位N05T战斗启动护卫配置"] = {
    ["Boss单位ID"] = "N05T",
    ["Boss单位名"] = "菲利斯",
    ["护卫血条归属类型"] = "独立",
    ["初始护卫批次"] = {["单位列表"] = _____83F2_5229_65AF_7B2C_4E8C_519B_56E2_62A4_536B_5217_8868},
    ["周期护卫批次"] = {["间隔毫秒"] = 12000, ["单位列表"] = _____83F2_5229_65AF_7B2C_4E8C_519B_56E2_62A4_536B_5217_8868}
}
return ____exports
