/** @noSelfInFile */

import type { 战斗启动属性配置 } from "../00．配置类型";
import { 默认Boss弱点数量基础值 } from "../00．配置类型";
import {
  异界Boss默认死亡奖励基础全属性,
  异界Boss统一转换场景,
  异界Boss统一胜利音乐变量名,
  异界Boss统一地点区域名称,
  异界Boss统一BS移动X轴,
  异界Boss统一BS移动Y轴,
  异界Boss统一玩家移动X轴,
  异界Boss统一玩家移动Y轴,
} from "./00．异界Boss共享配置";

export const 单位U009战斗启动属性配置: 战斗启动属性配置 = {
  归类: "异界Boss",
  单位ID: "U009",
  单位名: "夏提雅·布拉德弗伦",
  转换场景: 异界Boss统一转换场景,
  胜利音乐变量名: 异界Boss统一胜利音乐变量名,
  地点区域名称: 异界Boss统一地点区域名称,
  BS移动X轴: 异界Boss统一BS移动X轴,
  BS移动Y轴: 异界Boss统一BS移动Y轴,
  玩家移动X轴: 异界Boss统一玩家移动X轴,
  玩家移动Y轴: 异界Boss统一玩家移动Y轴,
  战斗音乐变量名: "gg_snd_battleBoss3",
  魔抗: 0.32,
  暴击率: 0.35,
  暴击伤害: 0.75,
  眩晕抗性: 0.45,
  命中率: 0.28,
  闪避率: 0.22,
  护甲穿透: 0.45,
  弱点数量基础值: 默认Boss弱点数量基础值,
  弱点数量每层N增量: 0,
  天生弱点数: 2,
  额外随机弱点数: 1,
  光弱: true,
  火弱: true,
  器弱伤害需求生命百分比: 0.03,
  护盾基础值: 10,
  护盾每层N增量: 2,
  死亡后所有玩家英雄基础全属性: 异界Boss默认死亡奖励基础全属性,
};
