--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____01_FF0E_6280_80FD_914D_7F6E_5DE5_5177 = require("系统.03．技能系统.05．单位技能.00．公共.01．技能配置工具")
local _____521B_5EFA_5355_4F4D_6280_80FD_914D_7F6E = ____01_FF0E_6280_80FD_914D_7F6E_5DE5_5177["创建单位技能配置"]
local ____00_FF0E_914D_7F6E = require("系统.03．技能系统.05．单位技能.03．Boss技能.03．瑟兰迪尔.00．配置")
local _____745F_5170_8FEA_5C14_5355_4F4D_6280_80FD_914D_7F6E = ____00_FF0E_914D_7F6E["瑟兰迪尔单位技能配置"]
____exports["Boss技能配置表"] = {
    _____521B_5EFA_5355_4F4D_6280_80FD_914D_7F6E({
        ["技能ID"] = "Boss示例",
        ["技能名"] = "Boss示例技能",
        ["归类"] = "Boss",
        ["触发方式"] = "初始化",
        ["说明"] = "占位示例，后续按实际 Boss 技能替换。"
    }),
    _____521B_5EFA_5355_4F4D_6280_80FD_914D_7F6E({
        ["技能ID"] = _____745F_5170_8FEA_5C14_5355_4F4D_6280_80FD_914D_7F6E["单位目标技能900"],
        ["技能名"] = "瑟兰迪尔单位目标技能900",
        ["归类"] = "Boss",
        ["触发方式"] = "主动",
        ["单位类型列表"] = {_____745F_5170_8FEA_5C14_5355_4F4D_6280_80FD_914D_7F6E["单位ID"]},
        ["说明"] = "精灵执法队长·瑟兰迪尔复用的 900 距离单位目标通魔技能槽。",
        ["配置数据"] = {["单位名"] = _____745F_5170_8FEA_5C14_5355_4F4D_6280_80FD_914D_7F6E["单位名"], ["施法距离"] = 900, ["目标类型"] = "单位目标"}
    }),
    _____521B_5EFA_5355_4F4D_6280_80FD_914D_7F6E({
        ["技能ID"] = _____745F_5170_8FEA_5C14_5355_4F4D_6280_80FD_914D_7F6E["单位目标技能1000"],
        ["技能名"] = "瑟兰迪尔单位目标技能1000",
        ["归类"] = "Boss",
        ["触发方式"] = "主动",
        ["单位类型列表"] = {_____745F_5170_8FEA_5C14_5355_4F4D_6280_80FD_914D_7F6E["单位ID"]},
        ["说明"] = "精灵执法队长·瑟兰迪尔复用的 1000 距离单位目标通魔技能槽。",
        ["配置数据"] = {["单位名"] = _____745F_5170_8FEA_5C14_5355_4F4D_6280_80FD_914D_7F6E["单位名"], ["施法距离"] = 1000, ["目标类型"] = "单位目标"}
    }),
    _____521B_5EFA_5355_4F4D_6280_80FD_914D_7F6E({
        ["技能ID"] = _____745F_5170_8FEA_5C14_5355_4F4D_6280_80FD_914D_7F6E["精灵箭阵技能"],
        ["技能名"] = "瑟兰迪尔精灵箭阵",
        ["归类"] = "Boss",
        ["触发方式"] = "主动",
        ["单位类型列表"] = {_____745F_5170_8FEA_5C14_5355_4F4D_6280_80FD_914D_7F6E["单位ID"]},
        ["说明"] = "精灵执法队长·瑟兰迪尔的精灵箭阵无目标通魔技能槽。",
        ["配置数据"] = {["单位名"] = _____745F_5170_8FEA_5C14_5355_4F4D_6280_80FD_914D_7F6E["单位名"], ["目标类型"] = "无目标"}
    }),
    _____521B_5EFA_5355_4F4D_6280_80FD_914D_7F6E({
        ["技能ID"] = _____745F_5170_8FEA_5C14_5355_4F4D_6280_80FD_914D_7F6E["律法召唤技能"],
        ["技能名"] = "瑟兰迪尔律法召唤",
        ["归类"] = "Boss",
        ["触发方式"] = "主动",
        ["单位类型列表"] = {_____745F_5170_8FEA_5C14_5355_4F4D_6280_80FD_914D_7F6E["单位ID"]},
        ["说明"] = "精灵执法队长·瑟兰迪尔的律法召唤无目标通魔技能槽。",
        ["配置数据"] = {["单位名"] = _____745F_5170_8FEA_5C14_5355_4F4D_6280_80FD_914D_7F6E["单位名"], ["目标类型"] = "无目标"}
    })
}
return ____exports
