local ____lualib = require("lualib_bundle")
local __TS__Delete = ____lualib.__TS__Delete
local ____exports = {}
local ____01_FF0E_5171_4EAB = require("系统.03．技能系统.00．技能模板+函数.01．技能函数.01．弹幕.01．TS原生弹幕.01．共享")
local GetUnitFlyHeight = ____01_FF0E_5171_4EAB.GetUnitFlyHeight
local GetUnitX = ____01_FF0E_5171_4EAB.GetUnitX
local GetUnitY = ____01_FF0E_5171_4EAB.GetUnitY
local _____8BA1_7B97_8DDD_79BB = ____01_FF0E_5171_4EAB["计算距离"]
local ____00_FF0E_8F68_8FF9_5DE5_5177 = require("系统.03．技能系统.00．技能模板+函数.01．技能函数.01．弹幕.01．TS原生弹幕.01．轨迹.00．轨迹工具")
local _____53D6_91C7_6837_65B9_5411 = ____00_FF0E_8F68_8FF9_5DE5_5177["取采样方向"]
local _____53D6_5F39_5E55_8F68_8FF9_8FDB_5EA6 = ____00_FF0E_8F68_8FF9_5DE5_5177["取弹幕轨迹进度"]
local _____7EBF_6027_63D2_503C = ____00_FF0E_8F68_8FF9_5DE5_5177["线性插值"]
local _____52A0_901F_5EA6_72B6_6001_8868 = {}
local function _____4E8C_9636_8D1D_585E_5C14_503C(t, _____8D77_70B9, _____63A7_5236, _____7EC8_70B9)
    local a = _____7EBF_6027_63D2_503C(_____8D77_70B9, _____63A7_5236, t)
    local b = _____7EBF_6027_63D2_503C(_____63A7_5236, _____7EC8_70B9, t)
    return _____7EBF_6027_63D2_503C(a, b, t)
end
local function _____4E09_9636_8D1D_585E_5C14_503C(t, _____8D77_70B9, _____63A7_52361, _____63A7_52362, _____7EC8_70B9)
    local a = _____7EBF_6027_63D2_503C(_____8D77_70B9, _____63A7_52361, t)
    local b = _____7EBF_6027_63D2_503C(_____63A7_52361, _____63A7_52362, t)
    local c = _____7EBF_6027_63D2_503C(_____63A7_52362, _____7EC8_70B9, t)
    return _____7EBF_6027_63D2_503C(
        _____7EBF_6027_63D2_503C(a, b, t),
        _____7EBF_6027_63D2_503C(b, c, t),
        t
    )
end
local function _____53D6_4E8C_9636_8D1D_585E_5C14_8FD1_4F3C_957F_5EA6(_____8D77_70B9X, _____8D77_70B9Y, _____63A7_5236X, _____63A7_5236Y, _____7EC8_70B9X, _____7EC8_70B9Y)
    local length = 0
    local lastX = _____8D77_70B9X
    local lastY = _____8D77_70B9Y
    do
        local i = 1
        while i <= 16 do
            local t = i / 16
            local x = _____4E8C_9636_8D1D_585E_5C14_503C(t, _____8D77_70B9X, _____63A7_5236X, _____7EC8_70B9X)
            local y = _____4E8C_9636_8D1D_585E_5C14_503C(t, _____8D77_70B9Y, _____63A7_5236Y, _____7EC8_70B9Y)
            length = length + _____8BA1_7B97_8DDD_79BB(lastX, lastY, x, y)
            lastX = x
            lastY = y
            i = i + 1
        end
    end
    return length > 1 and length or 1
end
local function _____53D6_52A0_901F_5EA6_8FDB_5EA6(_____5F39_5E55ID, delta, _____8DEF_5F84_957F_5EA6, _____521D_59CB_901F_5EA6, _____52A0_901F_5EA6, _____52A0_901F_5EA6_5F00_59CB_8DDD_79BB)
    local _____72B6_6001 = _____52A0_901F_5EA6_72B6_6001_8868[_____5F39_5E55ID]
    if _____72B6_6001 == nil then
        _____72B6_6001 = {["进度"] = 0, ["速度"] = _____521D_59CB_901F_5EA6, ["已飞行距离"] = 0}
        _____52A0_901F_5EA6_72B6_6001_8868[_____5F39_5E55ID] = _____72B6_6001
    end
    if _____72B6_6001["已飞行距离"] >= _____52A0_901F_5EA6_5F00_59CB_8DDD_79BB then
        _____72B6_6001["速度"] = _____72B6_6001["速度"] + _____52A0_901F_5EA6 * delta
    end
    if _____72B6_6001["速度"] < 0 then
        _____72B6_6001["速度"] = 0
    end
    local _____672C_5E27_8DDD_79BB = _____72B6_6001["速度"] * delta
    _____72B6_6001["已飞行距离"] = _____72B6_6001["已飞行距离"] + _____672C_5E27_8DDD_79BB
    _____72B6_6001["进度"] = _____72B6_6001["进度"] + _____672C_5E27_8DDD_79BB / _____8DEF_5F84_957F_5EA6
    if _____72B6_6001["进度"] >= 1 then
        __TS__Delete(_____52A0_901F_5EA6_72B6_6001_8868, _____5F39_5E55ID)
        return 1
    end
    return _____72B6_6001["进度"]
end
____exports["创建二阶贝塞尔轨迹"] = function(_____8D77_70B9X, _____8D77_70B9Y, _____63A7_5236X, _____63A7_5236Y, _____7EC8_70B9X, _____7EC8_70B9Y)
    return function(_____5B9E_4F8B, _delta)
        local t = _____53D6_5F39_5E55_8F68_8FF9_8FDB_5EA6(_____5B9E_4F8B)
        local x01 = _____7EBF_6027_63D2_503C(_____8D77_70B9X, _____63A7_5236X, t)
        local y01 = _____7EBF_6027_63D2_503C(_____8D77_70B9Y, _____63A7_5236Y, t)
        local x12 = _____7EBF_6027_63D2_503C(_____63A7_5236X, _____7EC8_70B9X, t)
        local y12 = _____7EBF_6027_63D2_503C(_____63A7_5236Y, _____7EC8_70B9Y, t)
        local x = _____7EBF_6027_63D2_503C(x01, x12, t)
        local y = _____7EBF_6027_63D2_503C(y01, y12, t)
        return {
            X = x,
            Y = y,
            ["方向角"] = _____53D6_91C7_6837_65B9_5411(
                _____5B9E_4F8B["当前X"],
                _____5B9E_4F8B["当前Y"],
                x,
                y,
                _____5B9E_4F8B["当前方向角"]
            ),
            ["完成"] = t >= 1
        }
    end
end
____exports["创建二阶贝塞尔XYZ轨迹"] = function(_____8D77_70B9X, _____8D77_70B9Y, _____8D77_70B9Z, _____63A7_5236X, _____63A7_5236Y, _____63A7_5236Z, _____7EC8_70B9X, _____7EC8_70B9Y, _____7EC8_70B9Z)
    return function(_____5B9E_4F8B, _delta)
        local t = _____53D6_5F39_5E55_8F68_8FF9_8FDB_5EA6(_____5B9E_4F8B)
        local x = _____4E8C_9636_8D1D_585E_5C14_503C(t, _____8D77_70B9X, _____63A7_5236X, _____7EC8_70B9X)
        local y = _____4E8C_9636_8D1D_585E_5C14_503C(t, _____8D77_70B9Y, _____63A7_5236Y, _____7EC8_70B9Y)
        local z = _____4E8C_9636_8D1D_585E_5C14_503C(t, _____8D77_70B9Z, _____63A7_5236Z, _____7EC8_70B9Z)
        return {
            X = x,
            Y = y,
            Z = z,
            ["方向角"] = _____53D6_91C7_6837_65B9_5411(
                _____5B9E_4F8B["当前X"],
                _____5B9E_4F8B["当前Y"],
                x,
                y,
                _____5B9E_4F8B["当前方向角"]
            ),
            ["完成"] = t >= 1
        }
    end
end
____exports["创建二阶贝塞尔抛物线轨迹"] = function(_____8D77_70B9X, _____8D77_70B9Y, _____8D77_70B9Z, _____63A7_5236X, _____63A7_5236Y, _____7EC8_70B9X, _____7EC8_70B9Y, _____7EC8_70B9Z, _____6700_5927_62AC_9AD8)
    local _____63A7_5236Z = _____8D77_70B9Z > _____7EC8_70B9Z and _____8D77_70B9Z + _____6700_5927_62AC_9AD8 or _____7EC8_70B9Z + _____6700_5927_62AC_9AD8
    return ____exports["创建二阶贝塞尔XYZ轨迹"](
        _____8D77_70B9X,
        _____8D77_70B9Y,
        _____8D77_70B9Z,
        _____63A7_5236X,
        _____63A7_5236Y,
        _____63A7_5236Z,
        _____7EC8_70B9X,
        _____7EC8_70B9Y,
        _____7EC8_70B9Z
    )
end
____exports["创建二阶贝塞尔加速度XYZ轨迹"] = function(_____8D77_70B9X, _____8D77_70B9Y, _____8D77_70B9Z, _____63A7_5236X, _____63A7_5236Y, _____63A7_5236Z, _____7EC8_70B9X, _____7EC8_70B9Y, _____7EC8_70B9Z, _____521D_59CB_901F_5EA6, _____52A0_901F_5EA6, _____52A0_901F_5EA6_5F00_59CB_8DDD_79BB)
    if _____52A0_901F_5EA6 == nil then
        _____52A0_901F_5EA6 = 0
    end
    if _____52A0_901F_5EA6_5F00_59CB_8DDD_79BB == nil then
        _____52A0_901F_5EA6_5F00_59CB_8DDD_79BB = 0
    end
    local _____8DEF_5F84_957F_5EA6 = _____53D6_4E8C_9636_8D1D_585E_5C14_8FD1_4F3C_957F_5EA6(
        _____8D77_70B9X,
        _____8D77_70B9Y,
        _____63A7_5236X,
        _____63A7_5236Y,
        _____7EC8_70B9X,
        _____7EC8_70B9Y
    )
    return function(_____5B9E_4F8B, delta)
        local t = _____53D6_52A0_901F_5EA6_8FDB_5EA6(
            _____5B9E_4F8B.id,
            delta,
            _____8DEF_5F84_957F_5EA6,
            _____521D_59CB_901F_5EA6,
            _____52A0_901F_5EA6,
            _____52A0_901F_5EA6_5F00_59CB_8DDD_79BB
        )
        local x = _____4E8C_9636_8D1D_585E_5C14_503C(t, _____8D77_70B9X, _____63A7_5236X, _____7EC8_70B9X)
        local y = _____4E8C_9636_8D1D_585E_5C14_503C(t, _____8D77_70B9Y, _____63A7_5236Y, _____7EC8_70B9Y)
        local z = _____4E8C_9636_8D1D_585E_5C14_503C(t, _____8D77_70B9Z, _____63A7_5236Z, _____7EC8_70B9Z)
        return {
            X = x,
            Y = y,
            Z = z,
            ["方向角"] = _____53D6_91C7_6837_65B9_5411(
                _____5B9E_4F8B["当前X"],
                _____5B9E_4F8B["当前Y"],
                x,
                y,
                _____5B9E_4F8B["当前方向角"]
            ),
            ["完成"] = t >= 1
        }
    end
end
____exports["创建二阶贝塞尔加速度抛物线轨迹"] = function(_____8D77_70B9X, _____8D77_70B9Y, _____8D77_70B9Z, _____63A7_5236X, _____63A7_5236Y, _____7EC8_70B9X, _____7EC8_70B9Y, _____7EC8_70B9Z, _____6700_5927_62AC_9AD8, _____521D_59CB_901F_5EA6, _____52A0_901F_5EA6, _____52A0_901F_5EA6_5F00_59CB_8DDD_79BB)
    if _____52A0_901F_5EA6 == nil then
        _____52A0_901F_5EA6 = 0
    end
    if _____52A0_901F_5EA6_5F00_59CB_8DDD_79BB == nil then
        _____52A0_901F_5EA6_5F00_59CB_8DDD_79BB = 0
    end
    local _____63A7_5236Z = _____8D77_70B9Z > _____7EC8_70B9Z and _____8D77_70B9Z + _____6700_5927_62AC_9AD8 or _____7EC8_70B9Z + _____6700_5927_62AC_9AD8
    return ____exports["创建二阶贝塞尔加速度XYZ轨迹"](
        _____8D77_70B9X,
        _____8D77_70B9Y,
        _____8D77_70B9Z,
        _____63A7_5236X,
        _____63A7_5236Y,
        _____63A7_5236Z,
        _____7EC8_70B9X,
        _____7EC8_70B9Y,
        _____7EC8_70B9Z,
        _____521D_59CB_901F_5EA6,
        _____52A0_901F_5EA6,
        _____52A0_901F_5EA6_5F00_59CB_8DDD_79BB
    )
end
____exports["创建锁定单位二阶贝塞尔XYZ轨迹"] = function(_____8D77_70B9X, _____8D77_70B9Y, _____8D77_70B9Z, _____63A7_5236X, _____63A7_5236Y, _____63A7_5236Z, _____76EE_6807_5355_4F4D, _____76EE_6807Z_504F_79FB)
    if _____76EE_6807Z_504F_79FB == nil then
        _____76EE_6807Z_504F_79FB = 0
    end
    return function(_____5B9E_4F8B, _delta)
        local t = _____53D6_5F39_5E55_8F68_8FF9_8FDB_5EA6(_____5B9E_4F8B)
        local endX = _____76EE_6807_5355_4F4D ~= nil and _____76EE_6807_5355_4F4D ~= 0 and GetUnitX(_____76EE_6807_5355_4F4D) or _____5B9E_4F8B["当前X"]
        local endY = _____76EE_6807_5355_4F4D ~= nil and _____76EE_6807_5355_4F4D ~= 0 and GetUnitY(_____76EE_6807_5355_4F4D) or _____5B9E_4F8B["当前Y"]
        local endZ = _____76EE_6807_5355_4F4D ~= nil and _____76EE_6807_5355_4F4D ~= 0 and GetUnitFlyHeight(_____76EE_6807_5355_4F4D) + _____76EE_6807Z_504F_79FB or _____8D77_70B9Z
        local x = _____4E8C_9636_8D1D_585E_5C14_503C(t, _____8D77_70B9X, _____63A7_5236X, endX)
        local y = _____4E8C_9636_8D1D_585E_5C14_503C(t, _____8D77_70B9Y, _____63A7_5236Y, endY)
        local z = _____4E8C_9636_8D1D_585E_5C14_503C(t, _____8D77_70B9Z, _____63A7_5236Z, endZ)
        return {
            X = x,
            Y = y,
            Z = z,
            ["方向角"] = _____53D6_91C7_6837_65B9_5411(
                _____5B9E_4F8B["当前X"],
                _____5B9E_4F8B["当前Y"],
                x,
                y,
                _____5B9E_4F8B["当前方向角"]
            ),
            ["完成"] = t >= 1
        }
    end
end
____exports["创建锁定单位二阶贝塞尔加速度XYZ轨迹"] = function(_____8D77_70B9X, _____8D77_70B9Y, _____8D77_70B9Z, _____63A7_5236X, _____63A7_5236Y, _____63A7_5236Z, _____76EE_6807_5355_4F4D, _____76EE_6807Z_504F_79FB, _____521D_59CB_901F_5EA6, _____52A0_901F_5EA6, _____52A0_901F_5EA6_5F00_59CB_8DDD_79BB)
    if _____52A0_901F_5EA6 == nil then
        _____52A0_901F_5EA6 = 0
    end
    if _____52A0_901F_5EA6_5F00_59CB_8DDD_79BB == nil then
        _____52A0_901F_5EA6_5F00_59CB_8DDD_79BB = 0
    end
    return function(_____5B9E_4F8B, delta)
        local endX = _____76EE_6807_5355_4F4D ~= nil and _____76EE_6807_5355_4F4D ~= 0 and GetUnitX(_____76EE_6807_5355_4F4D) or _____5B9E_4F8B["当前X"]
        local endY = _____76EE_6807_5355_4F4D ~= nil and _____76EE_6807_5355_4F4D ~= 0 and GetUnitY(_____76EE_6807_5355_4F4D) or _____5B9E_4F8B["当前Y"]
        local endZ = _____76EE_6807_5355_4F4D ~= nil and _____76EE_6807_5355_4F4D ~= 0 and GetUnitFlyHeight(_____76EE_6807_5355_4F4D) + _____76EE_6807Z_504F_79FB or _____8D77_70B9Z
        local _____8DEF_5F84_957F_5EA6 = _____53D6_4E8C_9636_8D1D_585E_5C14_8FD1_4F3C_957F_5EA6(
            _____8D77_70B9X,
            _____8D77_70B9Y,
            _____63A7_5236X,
            _____63A7_5236Y,
            endX,
            endY
        )
        local t = _____53D6_52A0_901F_5EA6_8FDB_5EA6(
            _____5B9E_4F8B.id,
            delta,
            _____8DEF_5F84_957F_5EA6,
            _____521D_59CB_901F_5EA6,
            _____52A0_901F_5EA6,
            _____52A0_901F_5EA6_5F00_59CB_8DDD_79BB
        )
        local x = _____4E8C_9636_8D1D_585E_5C14_503C(t, _____8D77_70B9X, _____63A7_5236X, endX)
        local y = _____4E8C_9636_8D1D_585E_5C14_503C(t, _____8D77_70B9Y, _____63A7_5236Y, endY)
        local z = _____4E8C_9636_8D1D_585E_5C14_503C(t, _____8D77_70B9Z, _____63A7_5236Z, endZ)
        return {
            X = x,
            Y = y,
            Z = z,
            ["方向角"] = _____53D6_91C7_6837_65B9_5411(
                _____5B9E_4F8B["当前X"],
                _____5B9E_4F8B["当前Y"],
                x,
                y,
                _____5B9E_4F8B["当前方向角"]
            ),
            ["完成"] = t >= 1
        }
    end
end
____exports["创建三阶贝塞尔轨迹"] = function(_____8D77_70B9X, _____8D77_70B9Y, _____63A7_52361X, _____63A7_52361Y, _____63A7_52362X, _____63A7_52362Y, _____7EC8_70B9X, _____7EC8_70B9Y)
    return function(_____5B9E_4F8B, _delta)
        local t = _____53D6_5F39_5E55_8F68_8FF9_8FDB_5EA6(_____5B9E_4F8B)
        local x01 = _____7EBF_6027_63D2_503C(_____8D77_70B9X, _____63A7_52361X, t)
        local y01 = _____7EBF_6027_63D2_503C(_____8D77_70B9Y, _____63A7_52361Y, t)
        local x12 = _____7EBF_6027_63D2_503C(_____63A7_52361X, _____63A7_52362X, t)
        local y12 = _____7EBF_6027_63D2_503C(_____63A7_52361Y, _____63A7_52362Y, t)
        local x23 = _____7EBF_6027_63D2_503C(_____63A7_52362X, _____7EC8_70B9X, t)
        local y23 = _____7EBF_6027_63D2_503C(_____63A7_52362Y, _____7EC8_70B9Y, t)
        local x012 = _____7EBF_6027_63D2_503C(x01, x12, t)
        local y012 = _____7EBF_6027_63D2_503C(y01, y12, t)
        local x123 = _____7EBF_6027_63D2_503C(x12, x23, t)
        local y123 = _____7EBF_6027_63D2_503C(y12, y23, t)
        local x = _____7EBF_6027_63D2_503C(x012, x123, t)
        local y = _____7EBF_6027_63D2_503C(y012, y123, t)
        return {
            X = x,
            Y = y,
            ["方向角"] = _____53D6_91C7_6837_65B9_5411(
                _____5B9E_4F8B["当前X"],
                _____5B9E_4F8B["当前Y"],
                x,
                y,
                _____5B9E_4F8B["当前方向角"]
            ),
            ["完成"] = t >= 1
        }
    end
end
____exports["创建三阶贝塞尔XYZ轨迹"] = function(_____8D77_70B9X, _____8D77_70B9Y, _____8D77_70B9Z, _____63A7_52361X, _____63A7_52361Y, _____63A7_52361Z, _____63A7_52362X, _____63A7_52362Y, _____63A7_52362Z, _____7EC8_70B9X, _____7EC8_70B9Y, _____7EC8_70B9Z)
    return function(_____5B9E_4F8B, _delta)
        local t = _____53D6_5F39_5E55_8F68_8FF9_8FDB_5EA6(_____5B9E_4F8B)
        local x = _____4E09_9636_8D1D_585E_5C14_503C(
            t,
            _____8D77_70B9X,
            _____63A7_52361X,
            _____63A7_52362X,
            _____7EC8_70B9X
        )
        local y = _____4E09_9636_8D1D_585E_5C14_503C(
            t,
            _____8D77_70B9Y,
            _____63A7_52361Y,
            _____63A7_52362Y,
            _____7EC8_70B9Y
        )
        local z = _____4E09_9636_8D1D_585E_5C14_503C(
            t,
            _____8D77_70B9Z,
            _____63A7_52361Z,
            _____63A7_52362Z,
            _____7EC8_70B9Z
        )
        return {
            X = x,
            Y = y,
            Z = z,
            ["方向角"] = _____53D6_91C7_6837_65B9_5411(
                _____5B9E_4F8B["当前X"],
                _____5B9E_4F8B["当前Y"],
                x,
                y,
                _____5B9E_4F8B["当前方向角"]
            ),
            ["完成"] = t >= 1
        }
    end
end
return ____exports
