--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____02_FF0E_6CBB_7597_89E6_53D1_6838_5FC3 = require("系统.02．物品系统.15．装备技能.03．主动技能.01．治疗触发.02．治疗触发核心")
local _____521D_59CB_5316_6CBB_7597_89E6_53D1_4E3B_52A8_6280_80FD_6838_5FC3 = ____02_FF0E_6CBB_7597_89E6_53D1_6838_5FC3["初始化治疗触发主动技能核心"]
local ____03_FF0E_65BD_6CD5_4E3B_52A8_6280_80FD_6838_5FC3 = require("系统.02．物品系统.15．装备技能.03．主动技能.02．施法触发.03．施法主动技能核心")
local _____521D_59CB_5316_65BD_6CD5_4E3B_52A8_6280_80FD_6838_5FC3 = ____03_FF0E_65BD_6CD5_4E3B_52A8_6280_80FD_6838_5FC3["初始化施法主动技能核心"]
local ____02_FF0E_7269_54C1_4F7F_7528_4E3B_52A8_6280_80FD_6838_5FC3 = require("系统.02．物品系统.15．装备技能.03．主动技能.03．物品使用触发.02．物品使用主动技能核心")
local _____521D_59CB_5316_7269_54C1_4E3B_52A8_6280_80FD_6838_5FC3 = ____02_FF0E_7269_54C1_4F7F_7528_4E3B_52A8_6280_80FD_6838_5FC3["初始化物品主动技能核心"]
local ____05_FF0E_6280_80FD_58F3_53C2_6570_540C_6B65 = require("系统.02．物品系统.15．装备技能.03．主动技能.04．总入口.05．技能壳参数同步")
local _____521D_59CB_5316_4E3B_52A8_6280_80FD_58F3_53C2_6570_540C_6B65 = ____05_FF0E_6280_80FD_58F3_53C2_6570_540C_6B65["初始化主动技能壳参数同步"]
local _____5DF2_521D_59CB_5316 = false
____exports["初始化主动技能系统"] = function()
    if _____5DF2_521D_59CB_5316 then
        return
    end
    _____5DF2_521D_59CB_5316 = true
    _____521D_59CB_5316_6CBB_7597_89E6_53D1_4E3B_52A8_6280_80FD_6838_5FC3()
    _____521D_59CB_5316_65BD_6CD5_4E3B_52A8_6280_80FD_6838_5FC3()
    _____521D_59CB_5316_7269_54C1_4E3B_52A8_6280_80FD_6838_5FC3()
    _____521D_59CB_5316_4E3B_52A8_6280_80FD_58F3_53C2_6570_540C_6B65()
end
____exports["初始化主动技能系统"]()
return ____exports
