--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local _____672A_77E5_56FE_6807 = "war3mapImported\\Bosswenhao.blp"
____exports["世界地图地点配置表"] = {
    {
        ["地点ID"] = 1,
        ["按钮X"] = 0.130208,
        ["按钮Y"] = 0.0817152,
        ["箭头X"] = 0.130208,
        ["箭头Y"] = 0.0987152,
        ["初始提示"] = "|cffffcc99地区名：静灵森|r|n|cffff0000危险等级：LV1|n|r|cffffffcc类型：战斗|n探索途径：正常|n|r|cffff00ff隐秘程度：☆|n|r|cff333333测试版完成情况：100%|r",
        ["初始图标"] = "WorldMap\\jingling-forest.blp",
        ["当前位置矩形区域名称列表"] = {"静灵森"}
    },
    {
        ["地点ID"] = 2,
        ["按钮X"] = 0.217708,
        ["按钮Y"] = 0.09246,
        ["箭头X"] = 0.217708,
        ["箭头Y"] = 0.10946,
        ["初始提示"] = "|cffffcc99地区名：精灵村|r|n|cffff0000危险等级：无|n|r|cffffffcc类型：城镇|n探索途径：正常|n|r|cffff00ff隐秘程度：☆|n|r|cff333333测试版完成情况：100%|r",
        ["当前位置矩形区域名称列表"] = {"精灵村", "精灵村长老房"}
    },
    {
        ["地点ID"] = 3,
        ["按钮X"] = 0.259792,
        ["按钮Y"] = 0.1167768,
        ["箭头X"] = 0.259792,
        ["箭头Y"] = 0.1337768,
        ["初始提示"] = "|cffffcc99地区名：未知|r|n|cffff0000危险等级：未知|n|r|cffffffcc类型：战斗|n探索途径：正常|n|r|cffff00ff隐秘程度：☆|n|r|cff333333测试版完成情况：100%|r",
        ["当前位置矩形区域名称列表"] = {"史莱姆草原"}
    },
    {
        ["地点ID"] = 4,
        ["按钮X"] = 0.1831248,
        ["按钮Y"] = 0.1484448,
        ["箭头X"] = 0.1831248,
        ["箭头Y"] = 0.1654448,
        ["初始提示"] = "|cffffcc99地区名：未知|r|n|cffff0000危险等级：未知|n|r|cffffffcc类型：战斗|n探索途径：正常|n|r|cffff00ff隐秘程度：★|n|r|cff333333测试版完成情况：100%|r",
        ["当前位置矩形区域名称列表"] = {"地精洞窟.区域1", "地精洞窟.区域2"}
    },
    {
        ["地点ID"] = 5,
        ["按钮X"] = 0.142708,
        ["按钮Y"] = 0.1190388,
        ["箭头X"] = 0.142708,
        ["箭头Y"] = 0.1360388,
        ["初始提示"] = "|cffffcc99地区名：未知|r|n|cffff0000危险等级：未知|n|r|cffffffcc类型：战斗|n探索途径：未发现|n|r|cffff00ff隐秘程度：★★☆|n|r|cff333333测试版完成情况：100%|r",
        ["当前位置矩形区域名称列表"] = {"迷雾森林核心", "迷雾森林"}
    },
    {
        ["地点ID"] = 6,
        ["按钮X"] = 0.2610416,
        ["按钮Y"] = 0.1456176,
        ["箭头X"] = 0.2610416,
        ["箭头Y"] = 0.1626176,
        ["初始提示"] = "|cffffcc99地区名：未知|r|n|cffff0000危险等级：未知|n|r|cffffffcc类型：战斗|n探索途径：正常|n|r|cffff00ff隐秘程度：☆|n|r|cff333333测试版完成情况：100%|r",
        ["当前位置矩形区域名称列表"] = {"奇幻湖"}
    },
    {
        ["地点ID"] = 7,
        ["按钮X"] = 0.2139584,
        ["按钮Y"] = 0.132045,
        ["箭头X"] = 0.2139584,
        ["箭头Y"] = 0.149045,
        ["初始提示"] = "|cffffcc99地区名：未知|r|n|cffff0000危险等级：未知|n|r|cffffffcc类型：战斗|n探索途径：正常|n|r|cffff00ff隐秘程度：☆|n|r|cff333333测试版完成情况：100%|r",
        ["当前位置矩形区域名称列表"] = {"精灵森"}
    },
    {
        ["地点ID"] = 8,
        ["按钮X"] = 0.282708,
        ["按钮Y"] = 0.1642788,
        ["箭头X"] = 0.282708,
        ["箭头Y"] = 0.1812788,
        ["初始提示"] = "|cffffcc99地区名：未知|r|n|cffff0000危险等级：未知|n|r|cffffffcc类型：战斗|n探索途径：未发现|n|r|cffff00ff隐秘程度：★★☆|n|r|cff333333测试版完成情况：100%|r",
        ["当前位置矩形区域名称列表"] = {"奇幻湖底"}
    },
    {
        ["地点ID"] = 9,
        ["按钮X"] = 0.3343752,
        ["按钮Y"] = 0.1625826,
        ["箭头X"] = 0.3343752,
        ["箭头Y"] = 0.1795826,
        ["初始提示"] = "|cffffcc99地区名：未知|r|n|cffff0000危险等级：未知|n|r|cffffffcc类型：战斗|n探索途径：未发现|n|r|cffff00ff隐秘程度：☆|n|r|cff333333测试版完成情况：100%|r",
        ["当前位置矩形区域名称列表"] = {"巨石峡谷"}
    },
    {
        ["地点ID"] = 10,
        ["按钮X"] = 0.4118752,
        ["按钮Y"] = 0.1167768,
        ["箭头X"] = 0.4118752,
        ["箭头Y"] = 0.1337768,
        ["初始提示"] = "|cffffcc99地区名：未知|r|n|cffff0000危险等级：未知|n|r|cffffffcc类型：城镇|n探索途径：未发现|n|r|cffff00ff隐秘程度：☆|n|r|cff333333测试版完成情况：100%|r",
        ["当前位置矩形区域名称列表"] = {"沙漠绿洲"}
    },
    {
        ["地点ID"] = 11,
        ["按钮X"] = 0.3468752,
        ["按钮Y"] = 0.1190388,
        ["箭头X"] = 0.3468752,
        ["箭头Y"] = 0.1360388,
        ["初始提示"] = "|cffffcc99地区名：未知|r|n|cffff0000危险等级：未知|n|r|cffffffcc类型：城镇|n探索途径：未发现|n|r|cffff00ff隐秘程度：★★★|n|r|cff333333测试版完成情况：100%|r",
        ["当前位置矩形区域名称列表"] = {"盗贼洞窟"}
    },
    {
        ["地点ID"] = 12,
        ["按钮X"] = 0.4260416,
        ["按钮Y"] = 0.1507068,
        ["箭头X"] = 0.4260416,
        ["箭头Y"] = 0.1677068,
        ["初始提示"] = "|cffffcc99地区名：未知|r|n|cffff0000危险等级：未知|n|r|cffffffcc类型：城镇|n探索途径：未发现|n|r|cffff00ff隐秘程度：☆|n|r|cff333333测试版完成情况：100%|r",
        ["当前位置矩形区域名称列表"] = {"王宫门口", "蛇人领地门口"}
    },
    {
        ["地点ID"] = 13,
        ["按钮X"] = 0.380208,
        ["按钮Y"] = 0.1874646,
        ["箭头X"] = 0.380208,
        ["箭头Y"] = 0.2044646,
        ["初始提示"] = "|cffffcc99地区名：未知|r|n|cffff0000危险等级：未知|n|r|cffffffcc类型：战斗|n探索途径：未发现|n|r|cffff00ff隐秘程度：★★★★|n|r|cff333333测试版完成情况：未制作|r"
    },
    {
        ["地点ID"] = 14,
        ["按钮X"] = 0.4506248,
        ["按钮Y"] = 0.1065978,
        ["初始提示"] = "|cffffcc99地区名：未知|r|n|cffff0000危险等级：未知|n|r|cffffffcc类型：战斗|n探索途径：未知|n|r|cffff00ff隐秘程度：☆|n|r|cff333333测试版完成情况：100%|r",
        ["当前位置矩形区域名称列表"] = {"悲风山谷"}
    },
    {
        ["地点ID"] = 15,
        ["按钮X"] = 0.477292,
        ["按钮Y"] = 0.0805842,
        ["初始提示"] = "|cffffcc99地区名：未知|r|n|cffff0000危险等级：未知|n|r|cffffffcc类型：战斗|n探索途径：未知|n|r|cffff00ff隐秘程度：☆|n|r|cff333333测试版完成情况：100%|r",
        ["当前位置矩形区域名称列表"] = {"灼炎火山"}
    },
    {
        ["地点ID"] = 16,
        ["按钮X"] = 0.4910416,
        ["按钮Y"] = 0.0964182,
        ["箭头X"] = 0.4910416,
        ["箭头Y"] = 0.1134182,
        ["初始提示"] = "|cffffcc99地区名：未知|r|n|cffff0000危险等级：未知|n|r|cffffffcc类型：城镇|n探索途径：未知|n|r|cffff00ff隐秘程度：☆|n|r|cff333333测试版完成情况：100%|r",
        ["当前位置矩形区域名称列表"] = {"熔岩小镇"}
    },
    {
        ["地点ID"] = 17,
        ["按钮X"] = 0.5081248,
        ["按钮Y"] = 0.0998112,
        ["箭头X"] = 0.5081248,
        ["箭头Y"] = 0.1168112,
        ["初始提示"] = "|cffffcc99地区名：未知|r|n|cffff0000危险等级：未知|n|r|cffffffcc类型：战斗|n探索途径：未知|n|r|cffff00ff隐秘程度：☆|n|r|cff333333测试版完成情况：100%|r",
        ["当前位置矩形区域名称列表"] = {"熔岩恶魔城", "恶魔城野外领地", "恶魔迷宫"}
    },
    {
        ["地点ID"] = 18,
        ["按钮X"] = 0.2135416,
        ["按钮Y"] = 0.2140434,
        ["箭头X"] = 0.2135416,
        ["箭头Y"] = 0.2310434,
        ["初始提示"] = "|cffffcc99地区名：未知|r|n|cffff0000危险等级：未知|n|r|cffffffcc类型：城镇|n探索途径：未知|n|r|cffff00ff隐秘程度：☆|n|r|cff333333测试版完成情况：100%|r",
        ["当前位置矩形区域名称列表"] = {"精灵传送阵"}
    },
    {
        ["地点ID"] = 19,
        ["按钮X"] = 0.237708,
        ["按钮Y"] = 0.2174364,
        ["箭头X"] = 0.237708,
        ["箭头Y"] = 0.2344364,
        ["初始提示"] = "|cffffcc99地区名：未知|r|n|cffff0000危险等级：未知|n|r|cffffffcc类型：战斗|n探索途径：未知|n|r|cffff00ff隐秘程度：☆|n|r|cff333333测试版完成情况：100%|r",
        ["当前位置矩形区域名称列表"] = {"场景.精灵传送阵-精灵王城道中区域1", "场景.精灵传送阵-精灵王城道中区域2"}
    },
    {
        ["地点ID"] = 20,
        ["按钮X"] = 0.2739584,
        ["按钮Y"] = 0.2377944,
        ["箭头X"] = 0.2739584,
        ["箭头Y"] = 0.2547944,
        ["初始提示"] = "|cffffcc99地区名：未知|r|n|cffff0000危险等级：未知|n|r|cffffffcc类型：城镇|n探索途径：未知|n|r|cffff00ff隐秘程度：☆|n|r|cff333333测试版完成情况：100%|r",
        ["当前位置矩形区域名称列表"] = {"场景.精灵城大区域", "场景.精灵城区域028"}
    },
    {
        ["地点ID"] = 21,
        ["按钮X"] = 0.307292,
        ["按钮Y"] = 0.2225262,
        ["箭头X"] = 0.307292,
        ["箭头Y"] = 0.2395262,
        ["初始提示"] = "|cffffcc99地区名：未知|r|n|cffff0000危险等级：未知|n|r|cffffffcc类型：战斗|n探索途径：未知|n|r|cffff00ff隐秘程度：☆|n|r|cff333333测试版完成情况：100%|r",
        ["当前位置矩形区域名称列表"] = {"场景.王宫外庭区域"}
    },
    {
        ["地点ID"] = 22,
        ["按钮X"] = 0.2356248,
        ["按钮Y"] = 0.273987,
        ["箭头X"] = 0.2356248,
        ["箭头Y"] = 0.290987,
        ["初始提示"] = "|cffffcc99地区名：未知|r|n|cffff0000危险等级：未知|n|r|cffffffcc类型：战斗|n探索途径：未知|n|r|cffff00ff隐秘程度：☆|n|r|cff333333测试版完成情况：未制作|r"
    },
    {
        ["地点ID"] = 23,
        ["按钮X"] = 0.1985416,
        ["按钮Y"] = 0.283035,
        ["箭头X"] = 0.1985416,
        ["箭头Y"] = 0.300035,
        ["初始提示"] = "|cffffcc99地区名：未知|r|n|cffff0000危险等级：未知|n|r|cffffffcc类型：战斗|n探索途径：未知|n|r|cffff00ff隐秘程度：★☆|n|r|cff333333测试版完成情况：未制作|r"
    },
    {
        ["地点ID"] = 24,
        ["按钮X"] = 0.294792,
        ["按钮Y"] = 0.2847312,
        ["箭头X"] = 0.294792,
        ["箭头Y"] = 0.3017312,
        ["初始提示"] = "|cffffcc99地区名：未知|r|n|cffff0000危险等级：未知|n|r|cffffffcc类型：战斗|n探索途径：未知|n|r|cffff00ff隐秘程度：★★★★|n|r|cff333333测试版完成情况：未制作|r"
    },
    {
        ["地点ID"] = 25,
        ["按钮X"] = 0.239792,
        ["按钮Y"] = 0.3084828,
        ["箭头X"] = 0.239792,
        ["箭头Y"] = 0.3254828,
        ["初始提示"] = "|cffffcc99地区名：未知|r|n|cffff0000危险等级：未知|n|r|cffffffcc类型：城镇|n探索途径：未知|n|r|cffff00ff隐秘程度：☆|n|r|cff333333测试版完成情况：未制作|r"
    },
    {
        ["地点ID"] = 26,
        ["按钮X"] = 0.2032344,
        ["按钮Y"] = 0.2380902,
        ["箭头X"] = 0.2032344,
        ["箭头Y"] = 0.2550902,
        ["初始提示"] = "|cffffcc99地区名：未知|r|n|cffff0000危险等级：未知|n|r|cffffffcc类型：城镇|n探索途径：未知|n|r|cffff00ff隐秘程度：☆|n|r|cff333333测试版完成情况：未制作|r"
    },
    {
        ["地点ID"] = 27,
        ["按钮X"] = 0.1843664,
        ["按钮Y"] = 0.2347968,
        ["箭头X"] = 0.1843664,
        ["箭头Y"] = 0.2517968,
        ["初始提示"] = "|cffffcc99地区名：未知|r|n|cffff0000危险等级：未知|n|r|cffffffcc类型：城镇|n探索途径：未知|n|r|cffff00ff隐秘程度：★☆|n|r|cff333333测试版完成情况：未制作|r"
    }
}
____exports["世界地图解锁配置表"] = {
    {
        ["地点ID"] = 2,
        ["解锁来源"] = "主线剧情",
        ["目标剧情进度"] = 1,
        ["解锁提示"] = "|cffffcc99地区名：精灵村|r|n|cffff0000危险等级：无|n|r|cffffffcc类型：城镇（双击可传送）|n探索途径：主线|n|r|cffff00ff隐秘程度：☆|n|r|cff333333测试版完成情况：100%|r",
        ["解锁图标"] = "WorldMap\\elven-village.blp",
        ["解锁后注册传送"] = true
    },
    {["地点ID"] = 3, ["矩形区域名称"] = "史莱姆草原", ["解锁提示"] = "|cffffcc99地区名：史莱姆草原|r|n|cffff0000危险等级：LV3|n|r|cffffffcc类型：战斗|n探索途径：正常|n|r|cffff00ff隐秘程度：☆|n|r|cff333333测试版完成情况：100%|r", ["解锁图标"] = "WorldMap\\slime-prairie.blp"},
    {["地点ID"] = 5, ["矩形区域名称"] = "迷雾森林", ["解锁提示"] = "|cffffcc99地区名：迷雾森林|r|n|cffff0000危险等级：LV25|n|r|cffffffcc类型：战斗|n探索途径：正常|n|r|cffff00ff隐秘程度：★★☆|n|r|cff333333测试版完成情况：100%|r", ["解锁图标"] = "WorldMap\\mist-forest.blp"},
    {["地点ID"] = 6, ["矩形区域名称"] = "奇幻湖", ["解锁提示"] = "|cffffcc99地区名：奇幻湖|r|n|cffff0000危险等级：LV3|n|r|cffffffcc类型：战斗|n探索途径：正常|n|r|cffff00ff隐秘程度：☆|n|r|cff333333测试版完成情况：100%|r", ["解锁图标"] = "WorldMap\\fantasy-lake.blp"},
    {["地点ID"] = 7, ["矩形区域名称"] = "精灵森", ["解锁提示"] = "|cffffcc99地区名：精灵森|r|n|cffff0000危险等级：LV5|n|r|cffffffcc类型：战斗|n探索途径：正常|n|r|cffff00ff隐秘程度：☆|n|r|cff333333测试版完成情况：100%|r", ["解锁图标"] = "WorldMap\\elven-forest.blp"},
    {["地点ID"] = 8, ["矩形区域名称"] = "奇幻湖底", ["解锁提示"] = "|cffffcc99地区名：奇幻湖底|r|n|cffff0000危险等级：LV20|n|r|cffffffcc类型：战斗|n探索途径：正常|n|r|cffff00ff隐秘程度：★★☆|n|r|cff333333测试版完成情况：100%|r", ["解锁图标"] = "WorldMap\\lake-depths.blp"},
    {["地点ID"] = 9, ["矩形区域名称"] = "巨石峡谷", ["解锁提示"] = "|cffffcc99地区名：巨石峡谷|r|n|cffff0000危险等级：LV10|n|r|cffffffcc类型：战斗|n探索途径：正常|n|r|cffff00ff隐秘程度：☆|n|r|cff333333测试版完成情况：100%|r", ["解锁图标"] = "WorldMap\\stone-giant-canyon.blp"},
    {
        ["地点ID"] = 10,
        ["解锁来源"] = "主线剧情",
        ["目标剧情进度"] = 6,
        ["解锁提示"] = "|cffffcc99地区名：沙漠绿洲|r|n|cffff0000危险等级：无|n|r|cffffffcc类型：城镇（双击可传送）|n探索途径：主线|n|r|cffff00ff隐秘程度：☆|n|r|cff333333测试版完成情况：100%|r",
        ["解锁图标"] = "WorldMap\\desert-oasis.blp",
        ["解锁后注册传送"] = true,
        ["进入后开启视野"] = "沙漠绿洲"
    },
    {["地点ID"] = 11, ["矩形区域名称"] = "盗贼洞窟", ["解锁提示"] = "|cffffcc99地区名：盗贼洞窟|r|n|cffff0000危险等级：LV20|n|r|cffffffcc类型：战斗|n探索途径：正常|n|r|cffff00ff隐秘程度：★★★|n|r|cff333333测试版完成情况：100%|r", ["解锁图标"] = "WorldMap\\thieves-cave.blp"},
    {
        ["地点ID"] = 12,
        ["解锁来源"] = "主线剧情",
        ["目标剧情进度"] = 8,
        ["解锁提示"] = "|cffffcc99地区名：蛇人领地|r|n|cffff0000危险等级：无|n|r|cffffffcc类型：城镇（双击可传送）|n探索途径：主线|n|r|cffff00ff隐秘程度：☆|n|r|cff333333测试版完成情况：100%|r",
        ["解锁图标"] = "WorldMap\\serpent-territory.blp",
        ["解锁后注册传送"] = true
    },
    {["地点ID"] = 14, ["矩形区域名称"] = "悲风山谷", ["解锁提示"] = "|cffffcc99地区名：悲风山谷|r|n|cffff0000危险等级：LV15|n|r|cffffffcc类型：战斗|n探索途径：正常|n|r|cffff00ff隐秘程度：☆|n|r|cff333333测试版完成情况：100%|r", ["解锁图标"] = "WorldMap\\sorrowwind-valley.blp"},
    {["地点ID"] = 15, ["矩形区域名称"] = "灼炎火山", ["解锁提示"] = "|cffffcc99地区名：灼炎火山|r|n|cffff0000危险等级：LV20|n|r|cffffffcc类型：战斗|n探索途径：正常|n|r|cffff00ff隐秘程度：☆|n|r|cff333333测试版完成情况：100%|r", ["解锁图标"] = "WorldMap\\scorching-volcano.blp"},
    {
        ["地点ID"] = 16,
        ["解锁来源"] = "主线剧情",
        ["目标剧情进度"] = 37,
        ["解锁提示"] = "|cffffcc99地区名：熔岩小镇|r|n|cffff0000危险等级：无|n|r|cffffffcc类型：城镇（双击可传送）|n探索途径：主线|n|r|cffff00ff隐秘程度：☆|n|r|cff333333测试版完成情况：100%|r",
        ["解锁图标"] = "WorldMap\\molten-town.blp",
        ["解锁后注册传送"] = true
    },
    {
        ["地点ID"] = 17,
        ["解锁来源"] = "主线剧情",
        ["目标剧情进度"] = 39,
        ["解锁提示"] = "|cffffcc99地区名：恶魔城|r|n|cffff0000危险等级：无|n|r|cffffffcc类型：城镇（双击可传送）|n探索途径：主线|n|r|cffff00ff隐秘程度：☆|n|r|cff333333测试版完成情况：100%|r",
        ["解锁图标"] = "WorldMap\\wanyu-molten-realm.blp",
        ["解锁后注册传送"] = true
    },
    {
        ["地点ID"] = 18,
        ["解锁来源"] = "主线剧情",
        ["目标剧情进度"] = 20,
        ["解锁提示"] = "|cffffcc99地区名：精灵传送阵|r|n|cffff0000危险等级：无|n|r|cffffffcc类型：传送点（双击可传送）|n探索途径：主线|n|r|cffff00ff隐秘程度：☆|n|r|cff333333测试版完成情况：100%|r",
        ["解锁图标"] = "WorldMap\\elven-teleport-array.blp",
        ["解锁后注册传送"] = true
    },
    {
        ["地点ID"] = 19,
        ["解锁来源"] = "主线剧情",
        ["目标剧情进度"] = 21,
        ["解锁提示"] = "|cffffcc99地区名：生灵山谷|r|n|cffff0000危险等级：主线区域|n|r|cffffffcc类型：道路|n探索途径：主线|n|r|cffff00ff隐秘程度：☆|n|r|cff333333测试版完成情况：100%|r",
        ["解锁图标"] = "WorldMap\\living-valley.blp"
    },
    {
        ["地点ID"] = 20,
        ["解锁来源"] = "主线剧情",
        ["目标剧情进度"] = 22,
        ["解锁提示"] = "|cffffcc99地区名：精灵王城|r|n|cffff0000危险等级：无|n|r|cffffffcc类型：城镇（双击可传送）|n探索途径：主线|n|r|cffff00ff隐秘程度：☆|n|r|cff333333测试版完成情况：100%|r",
        ["解锁图标"] = "WorldMap\\elven-royal-city.blp",
        ["解锁后注册传送"] = true
    },
    {
        ["地点ID"] = 21,
        ["解锁来源"] = "主线剧情",
        ["目标剧情进度"] = 23,
        ["解锁提示"] = "|cffffcc99地区名：精灵王城外庭|r|n|cffff0000危险等级：无|n|r|cffffffcc类型：王宫区域|n探索途径：主线|n|r|cffff00ff隐秘程度：☆|n|r|cff333333测试版完成情况：100%|r",
        ["解锁图标"] = "WorldMap\\elven-city-outer-court.blp"
    }
}
____exports["世界地图旅行奖励配置表"] = {
    {["矩形区域名称"] = "精灵村", ["旅行编号"] = 1},
    {["矩形区域名称"] = "沙漠绿洲", ["旅行编号"] = 2},
    {["矩形区域名称"] = "蛇人领地门口", ["旅行编号"] = 3},
    {["矩形区域名称"] = "熔岩小镇", ["旅行编号"] = 4},
    {["矩形区域名称"] = "熔岩恶魔城", ["旅行编号"] = 5}
}
____exports["世界地图传送配置表"] = {
    {
        ["配置ID"] = "精灵村",
        ["地点ID"] = 2,
        ["目标X"] = -25675.1,
        ["目标Y"] = -27139.6,
        ["镜头X"] = -25675.1,
        ["镜头Y"] = -27139.6,
        ["镜头先于单位"] = false,
        ["禁止剧情进度"] = 16,
        ["所需BuffID"] = "B001"
    },
    {
        ["配置ID"] = "蛇人营地",
        ["地点ID"] = 12,
        ["目标X"] = -26721.6,
        ["目标Y"] = 1036.5,
        ["镜头X"] = -26721.6,
        ["镜头Y"] = 1036.5,
        ["镜头先于单位"] = true,
        ["所需BuffID"] = "B001"
    },
    {
        ["配置ID"] = "沙漠绿洲",
        ["地点ID"] = 10,
        ["目标X"] = -5270.3,
        ["目标Y"] = -24467.9,
        ["镜头X"] = -5270.3,
        ["镜头Y"] = -24467.9,
        ["镜头先于单位"] = false,
        ["所需BuffID"] = "B001"
    },
    {
        ["配置ID"] = "熔岩小镇",
        ["地点ID"] = 16,
        ["目标X"] = 8668.3,
        ["目标Y"] = -20334,
        ["镜头X"] = 8668.3,
        ["镜头Y"] = -20334,
        ["镜头先于单位"] = false,
        ["所需BuffID"] = "B001"
    },
    {
        ["配置ID"] = "恶魔城",
        ["地点ID"] = 17,
        ["目标X"] = 14743.5,
        ["目标Y"] = -14958.2,
        ["镜头X"] = 14743.5,
        ["镜头Y"] = -14958.2,
        ["镜头先于单位"] = false,
        ["所需BuffID"] = "B001"
    },
    {
        ["配置ID"] = "精灵传送阵",
        ["地点ID"] = 18,
        ["目标X"] = -19393.1,
        ["目标Y"] = -15122,
        ["镜头X"] = -19393.1,
        ["镜头Y"] = -15122,
        ["镜头先于单位"] = false,
        ["所需BuffID"] = "B001"
    },
    {
        ["配置ID"] = "精灵王城",
        ["地点ID"] = 20,
        ["目标X"] = -8183.9,
        ["目标Y"] = -9712.9,
        ["镜头X"] = -8183.9,
        ["镜头Y"] = -9712.9,
        ["镜头先于单位"] = false,
        ["所需BuffID"] = "B001"
    }
}
____exports["世界地图默认未知图标"] = _____672A_77E5_56FE_6807
return ____exports
