--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
____exports["区域背景音乐配置表"] = {
    {["场景定义"] = "沙漠区域", ["区域变量名"] = "gg_rct______________055", ["随机环境音乐变量名列表"] = {"gg_snd_BGM016", "gg_snd_BGM017"}, ["随机音乐组"] = "沙漠区域"},
    {["场景定义"] = "沙漠区域", ["区域变量名"] = "gg_rct______________086", ["随机环境音乐变量名列表"] = {"gg_snd_BGM016", "gg_snd_BGM017"}, ["随机音乐组"] = "沙漠区域"},
    {["场景定义"] = "沙漠区域", ["区域变量名"] = "gg_rct______________083", ["随机环境音乐变量名列表"] = {"gg_snd_BGM016", "gg_snd_BGM017"}, ["随机音乐组"] = "沙漠区域"},
    {["场景定义"] = "精灵森", ["区域变量名"] = "gg_rct_007____________u", ["默认环境音乐变量名"] = "gg_snd_BGM007"},
    {["场景定义"] = "地精洞窟", ["区域变量名"] = "gg_rct_02____________u", ["默认环境音乐变量名"] = "gg_snd_BGM015"},
    {["场景定义"] = "精灵村", ["区域变量名"] = "gg_rct________________QY", ["默认环境音乐变量名"] = "gg_snd_zhuchengBGM01"},
    {["场景定义"] = "史莱姆草原", ["区域变量名"] = "gg_rct________________00X", ["默认环境音乐变量名"] = "gg_snd_BGM006"},
    {["场景定义"] = "奇幻湖底", ["区域变量名"] = "gg_rct_008____________u", ["默认环境音乐变量名"] = "gg_snd_BGM015"},
    {["场景定义"] = "迷雾森林", ["区域变量名"] = "gg_rct_005____________u", ["默认环境音乐变量名"] = "gg_snd_BGM006"},
    {["场景定义"] = "巨石峡谷", ["区域变量名"] = "gg_rct_009____________u", ["默认环境音乐变量名"] = "gg_snd_BGM008"},
    {["场景定义"] = "盗贼洞窟", ["区域变量名"] = "gg_rct_011____________u", ["默认环境音乐变量名"] = "gg_snd_BGM011"},
    {["场景定义"] = "蛇人领地", ["区域变量名"] = "gg_rct_012____________A", ["默认环境音乐变量名"] = "gg_snd_BGM019"},
    {["场景定义"] = "蛇人领地", ["区域变量名"] = "gg_rct_012____________B", ["默认环境音乐变量名"] = "gg_snd_BGM019"},
    {["场景定义"] = "灼炎火山", ["区域变量名"] = "gg_rct_015____________u", ["默认环境音乐变量名"] = "gg_snd_BGM004"}
}
____exports.default = ____exports["区域背景音乐配置表"]
return ____exports
