--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
____exports["区域背景音乐配置表"] = {
    {["场景定义"] = "沙漠区域", ["矩形区域名称列表"] = {"沙漠区域.区域1", "悲风山谷", "沙漠区域.区域3"}, ["随机环境音乐变量名列表"] = {"gg_snd_BGM016", "gg_snd_BGM017"}, ["随机音乐组"] = "沙漠区域"},
    {["场景定义"] = "英雄选择区域", ["矩形区域名称列表"] = {"英雄选择区域"}, ["默认环境音乐变量名"] = "gg_snd_BGM0111"},
    {["场景定义"] = "精灵森", ["矩形区域名称列表"] = {"精灵森"}, ["默认环境音乐变量名"] = "gg_snd_BGM007"},
    {["场景定义"] = "静灵森", ["矩形区域名称列表"] = {"静灵森"}, ["默认环境音乐变量名"] = "gg_snd_BGM007"},
    {["场景定义"] = "地精洞窟", ["矩形区域名称列表"] = {"地精洞窟.区域1"}, ["默认环境音乐变量名"] = "gg_snd_BGM015"},
    {["场景定义"] = "精灵村", ["矩形区域名称列表"] = {"精灵村"}, ["默认环境音乐变量名"] = "gg_snd_zhuchengBGM01"},
    {["场景定义"] = "史莱姆草原", ["矩形区域名称列表"] = {"史莱姆草原"}, ["默认环境音乐变量名"] = "gg_snd_BGM006"},
    {["场景定义"] = "奇幻湖", ["矩形区域名称列表"] = {"奇幻湖"}, ["默认环境音乐变量名"] = "gg_snd_BGM006"},
    {["场景定义"] = "迷雾森林", ["矩形区域名称列表"] = {"迷雾森林"}, ["默认环境音乐变量名"] = "gg_snd_BGM012"},
    {["场景定义"] = "巨石峡谷", ["矩形区域名称列表"] = {"巨石峡谷"}, ["默认环境音乐变量名"] = "gg_snd_BGM008"},
    {["场景定义"] = "盗贼洞窟", ["矩形区域名称列表"] = {"盗贼洞窟"}, ["默认环境音乐变量名"] = "gg_snd_BGM014"},
    {["场景定义"] = "蛇人领地", ["矩形区域名称列表"] = {"蛇人领地门口", "王宫门口"}, ["默认环境音乐变量名"] = "gg_snd_BGM019"},
    {["场景定义"] = "恶魔迷宫", ["矩形区域名称列表"] = {"恶魔迷宫"}, ["默认环境音乐变量名"] = "gg_snd_BGM018"},
    {["场景定义"] = "灼炎火山", ["矩形区域名称列表"] = {"灼炎火山"}, ["默认环境音乐变量名"] = "gg_snd_BGM004"}
}
____exports.default = ____exports["区域背景音乐配置表"]
return ____exports
