/** @noSelfInFile */

import { 注册莫尔特斯腐败值与根须领域 } from "./03．腐败值与根须领域";
import { 注册莫尔特斯腐朽根须穿刺 } from "./04．腐朽根须穿刺";
import { 注册莫尔特斯腐败孢子云 } from "./05．腐败孢子云";
import { 注册莫尔特斯扭曲荆棘鞭笞 } from "./06．扭曲荆棘鞭笞";
import { 注册莫尔特斯腐败之种 } from "./07．腐败之种";
import { 注册莫尔特斯根系觉醒 } from "./08．根系觉醒";
import { 注册莫尔特斯腐朽领域 } from "./09．腐朽领域";
import { 注册莫尔特斯共生腐朽虫群 } from "./10．共生腐朽虫群";
import { 注册莫尔特斯古木悲鸣 } from "./11．古木悲鸣";
import { 注册莫尔特斯腐败传输 } from "./12．腐败传输";

export function 注册莫尔特斯技能结构(this: void): void {
  注册莫尔特斯腐败值与根须领域();
  注册莫尔特斯腐朽根须穿刺();
  注册莫尔特斯腐败孢子云();
  注册莫尔特斯扭曲荆棘鞭笞();
  注册莫尔特斯腐败之种();
  注册莫尔特斯根系觉醒();
  注册莫尔特斯腐朽领域();
  注册莫尔特斯共生腐朽虫群();
  注册莫尔特斯古木悲鸣();
  注册莫尔特斯腐败传输();
}
