import { 精灵村入口到长老发布任务剧情片段 } from "./01．精灵村与蛇人族剧情集合/01．精灵村入口到长老发布任务";
import { 击败地精到长老说去沙漠来剧情片段 } from "./01．精灵村与蛇人族剧情集合/02．击败地精到长老说去沙漠来";
import { 沙漠到蛇人族剧情片段 } from "./01．精灵村与蛇人族剧情集合/03．沙漠到蛇人族";
import { 蛇人族击败食人魔到护卫对战剧情片段 } from "./01．精灵村与蛇人族剧情集合/04．蛇人族击败食人魔到护卫对战";
import { 回村击败第一章最终Boss教派剧情片段 } from "./01．精灵村与蛇人族剧情集合/05．回村击败第一章最终Boss教派";
import { 入城到王城委托剧情片段 } from "./02．精灵城与章节末剧情集合/01．入城到王城委托";
import { 猎魂与树魔首领剧情片段 } from "./02．精灵城与章节末剧情集合/02．猎魂与树魔首领";
import { 王城会议到章节末承接剧情片段 } from "./02．精灵城与章节末剧情集合/03．王城会议到章节末承接";

export const 主线剧情片段配置表 = [
  精灵村入口到长老发布任务剧情片段,
  击败地精到长老说去沙漠来剧情片段,
  沙漠到蛇人族剧情片段,
  蛇人族击败食人魔到护卫对战剧情片段,
  回村击败第一章最终Boss教派剧情片段,
  入城到王城委托剧情片段,
  猎魂与树魔首领剧情片段,
  王城会议到章节末承接剧情片段,
];

export default 主线剧情片段配置表;
