--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____08_FF0E_6280_80FD_4F24_5BB3_7CFB_7EDF = require("系统.04．伤害系统.08．技能伤害系统")
local _____9020_6210_6280_80FD_4F24_5BB3 = ____08_FF0E_6280_80FD_4F24_5BB3_7CFB_7EDF["造成技能伤害"]
local ____21_FF0E_7EC4_5408_6280_80FD_4F24_5BB3 = require("系统.03．技能系统.00．技能模板+函数.02．通用函数.21．组合技能伤害")
local _____8BA1_7B97_7EC4_5408_6280_80FD_4F24_5BB3 = ____21_FF0E_7EC4_5408_6280_80FD_4F24_5BB3["计算组合技能伤害"]
local function _____63D0_4EA4Boss_6280_80FD_4F24_5BB3_7ED3_679C(_____53C2_6570, _____4F24_5BB3)
    if not (_____4F24_5BB3 > 0) then
        return {["是否造成伤害"] = false, ["伤害"] = _____4F24_5BB3}
    end
    local _____662F_5426_9020_6210_4F24_5BB3 = _____9020_6210_6280_80FD_4F24_5BB3({
        ["来源"] = _____53C2_6570["来源"],
        ["目标"] = _____53C2_6570["目标"],
        ["伤害"] = _____4F24_5BB3,
        ["伤害类型"] = _____53C2_6570["伤害类型"],
        attack = _____53C2_6570.attack,
        ranged = _____53C2_6570.ranged,
        attackType = _____53C2_6570.attackType,
        weaponType = _____53C2_6570.weaponType,
        ["来源类型"] = "Boss技能",
        ["技能ID"] = _____53C2_6570["技能ID"],
        ["技能实例ID"] = _____53C2_6570["技能实例ID"],
        ["标签"] = _____53C2_6570["标签"],
        ["伤害形态"] = _____53C2_6570["伤害形态"],
        ["参与技能伤害加成"] = _____53C2_6570["参与技能伤害加成"]
    })
    return {["是否造成伤害"] = _____662F_5426_9020_6210_4F24_5BB3, ["伤害"] = _____4F24_5BB3}
end
____exports["提交预计算Boss技能伤害"] = function(_____53C2_6570)
    return _____63D0_4EA4Boss_6280_80FD_4F24_5BB3_7ED3_679C(_____53C2_6570, _____53C2_6570["伤害"])
end
____exports["执行Boss技能伤害"] = function(_____53C2_6570)
    local _____4F24_5BB3 = _____8BA1_7B97_7EC4_5408_6280_80FD_4F24_5BB3(_____53C2_6570["来源"], _____53C2_6570["目标"], _____53C2_6570["伤害公式"])
    return _____63D0_4EA4Boss_6280_80FD_4F24_5BB3_7ED3_679C(_____53C2_6570, _____4F24_5BB3)
end
return ____exports
