--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____03_FF0E_9634_5F71_7A7F_68AD = require("系统.03．技能系统.05．单位技能.03．Boss技能.12．影骨莫特斯.03．阴影穿梭")
local _____6CE8_518C_5F71_9AA8_83AB_7279_65AF_9634_5F71_7A7F_68AD = ____03_FF0E_9634_5F71_7A7F_68AD["注册影骨莫特斯阴影穿梭"]
local ____04_FF0E_9AB8_9AA8_53EC_5524 = require("系统.03．技能系统.05．单位技能.03．Boss技能.12．影骨莫特斯.04．骸骨召唤")
local _____6CE8_518C_5F71_9AA8_83AB_7279_65AF_9AB8_9AA8_53EC_5524 = ____04_FF0E_9AB8_9AA8_53EC_5524["注册影骨莫特斯骸骨召唤"]
local ____05_FF0E_6697_5F71_7981_9522 = require("系统.03．技能系统.05．单位技能.03．Boss技能.12．影骨莫特斯.05．暗影禁锢")
local _____6CE8_518C_5F71_9AA8_83AB_7279_65AF_6697_5F71_7981_9522 = ____05_FF0E_6697_5F71_7981_9522["注册影骨莫特斯暗影禁锢"]
local ____06_FF0E_5E7D_5F71_7206_53D1 = require("系统.03．技能系统.05．单位技能.03．Boss技能.12．影骨莫特斯.06．幽影爆发")
local _____6CE8_518C_5F71_9AA8_83AB_7279_65AF_5E7D_5F71_7206_53D1 = ____06_FF0E_5E7D_5F71_7206_53D1["注册影骨莫特斯幽影爆发"]
local ____07_FF0E_76D7_8D3C_7684_9057_4EA7 = require("系统.03．技能系统.05．单位技能.03．Boss技能.12．影骨莫特斯.07．盗贼的遗产")
local _____6CE8_518C_5F71_9AA8_83AB_7279_65AF_76D7_8D3C_7684_9057_4EA7 = ____07_FF0E_76D7_8D3C_7684_9057_4EA7["注册影骨莫特斯盗贼的遗产"]
____exports["注册影骨莫特斯技能结构"] = function()
    _____6CE8_518C_5F71_9AA8_83AB_7279_65AF_9634_5F71_7A7F_68AD()
    _____6CE8_518C_5F71_9AA8_83AB_7279_65AF_9AB8_9AA8_53EC_5524()
    _____6CE8_518C_5F71_9AA8_83AB_7279_65AF_6697_5F71_7981_9522()
    _____6CE8_518C_5F71_9AA8_83AB_7279_65AF_5E7D_5F71_7206_53D1()
    _____6CE8_518C_5F71_9AA8_83AB_7279_65AF_76D7_8D3C_7684_9057_4EA7()
end
return ____exports
