/** @noSelfInFile */

import { 主动技能装备名称 } from "../03．主动技能/00．公共/00．主动技能装备名";

export const 物品主动技能测试命令列表 = [
  "wp1", "wp2", "wp3", "wp4", "wp5", "wp6", "wp7", "wp8",
  "wp9", "wp10", "wp11", "wp12", "wp13", "wp14", "wp15", "wp16",
  "wp17", "wp18", "wp19", "wp20", "wp21", "wp22", "wp23", "wp24",
] as const;

export const 物品主动技能测试清理装备列表 = [
  主动技能装备名称.回沙之书,
  主动技能装备名称.女妖头饰,
  主动技能装备名称.黑牧杖,
  主动技能装备名称.熔岩权杖,
  主动技能装备名称.破血之戒,
  主动技能装备名称.战士大衣,
  主动技能装备名称.比安血爪,
  主动技能装备名称.地狱火卡牌,
  主动技能装备名称.巨魔大剑,
  主动技能装备名称.远古毒咒护符,
  主动技能装备名称.史莱姆粘液瓶,
  主动技能装备名称.地精钥匙,
  主动技能装备名称.祭祀之杖,
  主动技能装备名称.幽冥法杖,
  主动技能装备名称.熔岩恶魔之灵眼,
  主动技能装备名称.暗幽亡戒,
  主动技能装备名称.使者魔炉,
  主动技能装备名称.汭冥血杖,
  主动技能装备名称.汭冥血杖强化,
  主动技能装备名称.使者精神魔杖,
  主动技能装备名称.史诗远古魔刃,
  主动技能装备名称.焰虚宝珠,
  主动技能装备名称.先祖之狱杖,
  主动技能装备名称.咆哮之心,
] as const;

export const 物品主动技能测试发放顺序 = [
  主动技能装备名称.回沙之书,
  主动技能装备名称.女妖头饰,
  主动技能装备名称.黑牧杖,
  主动技能装备名称.熔岩权杖,
  主动技能装备名称.破血之戒,
  主动技能装备名称.战士大衣,
  主动技能装备名称.比安血爪,
  主动技能装备名称.地狱火卡牌,
  主动技能装备名称.巨魔大剑,
  主动技能装备名称.远古毒咒护符,
  主动技能装备名称.史莱姆粘液瓶,
  主动技能装备名称.地精钥匙,
  主动技能装备名称.祭祀之杖,
  主动技能装备名称.幽冥法杖,
  主动技能装备名称.熔岩恶魔之灵眼,
  主动技能装备名称.暗幽亡戒,
  主动技能装备名称.使者魔炉,
  主动技能装备名称.汭冥血杖,
  主动技能装备名称.汭冥血杖强化,
  主动技能装备名称.使者精神魔杖,
  主动技能装备名称.史诗远古魔刃,
  主动技能装备名称.焰虚宝珠,
  主动技能装备名称.先祖之狱杖,
  主动技能装备名称.咆哮之心,
] as const;

export {};
