--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____05_FF0E_70B9_540D_9884_8B66_6267_884C_5668 = require("系统.03．技能系统.00．技能模板+函数.04．机制组件.10．复杂战斗通用机制.05．点名预警执行器")
local _____521B_5EFA_70B9_540D_9884_8B66_6267_884C_5668 = ____05_FF0E_70B9_540D_9884_8B66_6267_884C_5668["创建点名预警执行器"]
local function _____53D6_70B9_540D_76EE_6807_5217_8868(_____53C2_6570)
    if _____53C2_6570["目标列表"] ~= nil then
        return _____53C2_6570["目标列表"]
    end
    if _____53C2_6570["目标"] ~= nil and _____53C2_6570["目标"] ~= 0 then
        return {_____53C2_6570["目标"]}
    end
    return {}
end
____exports["开始点名预警结算模板"] = function(_____53C2_6570)
    local _____76EE_6807_5217_8868 = _____53D6_70B9_540D_76EE_6807_5217_8868(_____53C2_6570)
    local _____6267_884C_5668_5217_8868 = {}
    local _____5269_4F59_7ED3_7B97_6570_91CF = #_____76EE_6807_5217_8868
    local _____5DF2_53D6_6D88 = false
    if #_____76EE_6807_5217_8868 <= 0 then
        if _____53C2_6570["on全部结算完成"] ~= nil then
            _____53C2_6570["on全部结算完成"]()
        end
        return {
            ["数量"] = 0,
            ["取消"] = function()
            end
        }
    end
    do
        local i = 0
        while i < #_____76EE_6807_5217_8868 do
            do
                local _____5E8F_53F7 = i + 1
                local _____76EE_6807 = _____76EE_6807_5217_8868[i + 1]
                if _____76EE_6807 == nil or _____76EE_6807 == 0 then
                    _____5269_4F59_7ED3_7B97_6570_91CF = _____5269_4F59_7ED3_7B97_6570_91CF - 1
                    goto __continue10
                end
                local _____539F_63D0_793A_5708 = _____53C2_6570["提示圈"]
                local ____521B_5EFA_70B9_540D_9884_8B66_6267_884C_5668_7 = _____521B_5EFA_70B9_540D_9884_8B66_6267_884C_5668
                local ____53C2_6570__6E05_7406_2 = _____53C2_6570["清理"]
                local ____temp_3 = _____53C2_6570["名称"] .. tostring(_____5E8F_53F7)
                local ____76EE_6807_4 = _____76EE_6807
                local ____53C2_6570__5EF6_8FDF_79D2_5 = _____53C2_6570["延迟秒"]
                local ____53C2_6570__9501_5B9A_5750_6807_6 = _____53C2_6570["锁定坐标"]
                local ____temp_1
                if _____539F_63D0_793A_5708 == nil or _____539F_63D0_793A_5708 == false then
                    ____temp_1 = _____539F_63D0_793A_5708
                else
                    ____temp_1 = function(_____7ED3_679C)
                        local ____temp_0
                        if type(_____539F_63D0_793A_5708) == "function" then
                            ____temp_0 = _____539F_63D0_793A_5708(_____7ED3_679C, _____5E8F_53F7)
                        else
                            ____temp_0 = _____539F_63D0_793A_5708
                        end
                        return ____temp_0
                    end
                end
                local _____6267_884C_5668 = ____521B_5EFA_70B9_540D_9884_8B66_6267_884C_5668_7({
                    ["清理"] = ____53C2_6570__6E05_7406_2,
                    ["名称"] = ____temp_3,
                    ["目标"] = ____76EE_6807_4,
                    ["延迟秒"] = ____53C2_6570__5EF6_8FDF_79D2_5,
                    ["锁定坐标"] = ____53C2_6570__9501_5B9A_5750_6807_6,
                    ["提示圈"] = ____temp_1,
                    ["on锁定"] = function(_____7ED3_679C)
                        if _____53C2_6570["on锁定"] ~= nil then
                            _____53C2_6570["on锁定"](_____7ED3_679C, _____5E8F_53F7)
                        end
                    end,
                    ["on结算"] = function(_____7ED3_679C)
                        _____53C2_6570["on结算"](_____7ED3_679C, _____5E8F_53F7)
                        _____5269_4F59_7ED3_7B97_6570_91CF = _____5269_4F59_7ED3_7B97_6570_91CF - 1
                        if _____5269_4F59_7ED3_7B97_6570_91CF <= 0 and _____53C2_6570["on全部结算完成"] ~= nil then
                            _____53C2_6570["on全部结算完成"]()
                        end
                    end,
                    ["on取消"] = function()
                        if not _____5DF2_53D6_6D88 and _____53C2_6570["on取消"] ~= nil then
                            _____53C2_6570["on取消"]()
                        end
                    end
                })
                _____6267_884C_5668_5217_8868[#_____6267_884C_5668_5217_8868 + 1] = _____6267_884C_5668
            end
            ::__continue10::
            i = i + 1
        end
    end
    return {
        ["数量"] = #_____6267_884C_5668_5217_8868,
        ["取消"] = function()
            if _____5DF2_53D6_6D88 then
                return
            end
            _____5DF2_53D6_6D88 = true
            for ____, _____6267_884C_5668 in ipairs(_____6267_884C_5668_5217_8868) do
                _____6267_884C_5668["取消"](_____6267_884C_5668)
            end
            if _____53C2_6570["on取消"] ~= nil then
                _____53C2_6570["on取消"]()
            end
        end
    }
end
return ____exports
