/** @noSelfInFile */

import type { 受击反应配置 } from "./00．配置类型";

export const 受击反应配置表: 受击反应配置[] = [
  {
    配置ID: "hit_react_goblin_priest",
    单位名: "邪恶巫师",
    技能列表: [
      { 技能ID: "A0HZ", 施法方式: "立即", 下单归属: "中立敌对", 说明: "受击立即放技能" },
    ],
  },
  {
    配置ID: "hit_react_spider_queen",
    单位名: "蜘蛛女皇|cffff0000（BossLV25）|r",
    特殊逻辑名: "蜘蛛女皇受击喷射",
  },
  {
    配置ID: "hit_react_lizard_creep",
    单位名: "蜥蜴怪物",
    特殊逻辑名: "蜥蜴怪物受击喷火",
  },
  {
    配置ID: "hit_react_demon_warden",
    单位名: "恶魔看守者|cffff0000（Boss，无等级限制）|r",
    技能列表: [
      { 技能ID: "A0BW", 命令字串: "thunderbolt", 施法方式: "对单位", 目标来源: "伤害来源" },
      { 技能ID: "A0BX", 命令字串: "deathcoil", 施法方式: "对单位", 目标来源: "伤害来源" },
    ],
  },
  {
    配置ID: "hit_react_element_slime",
    单位名: "元素史莱姆",
    技能列表: [
      { 命令字串: "firebolt", 施法方式: "对单位", 目标来源: "伤害来源" },
    ],
  },
  {
    配置ID: "hit_react_lobster_guard",
    单位名: "|cff00ffff龙虾守卫|r|cffff0000（挑战Boss）LV22|r",
    技能列表: [
      { 技能ID: "A04X", 施法方式: "对单位", 目标来源: "伤害来源", 下单归属: "中立敌对" },
      { 技能ID: "S001", 施法方式: "对点", 目标来源: "伤害来源坐标", 下单归属: "中立敌对", 触发概率分子: 1, 触发概率分母: 2 },
    ],
  },
  {
    配置ID: "hit_react_wolf_mage",
    单位名: "狼人魔法师",
    技能列表: [
      { 技能ID: "A00E", 施法方式: "对单位", 目标来源: "伤害来源", 下单归属: "中立敌对" },
    ],
  },
  {
    配置ID: "hit_react_desert_lizard",
    单位名: "|cffffcc99沙漠蜥蜴（变异）|r|cffff0000BossLV29|r",
    技能列表: [
      { 技能ID: "A04J", 施法方式: "对单位", 目标来源: "伤害来源", 下单归属: "中立敌对" },
      { 技能ID: "A04K", 施法方式: "对单位", 目标来源: "伤害来源", 下单归属: "中立敌对" },
    ],
  },
  {
    配置ID: "hit_react_dune_mother",
    单位名: "沙丘母虫",
    技能列表: [
      { 技能ID: "A05G", 施法方式: "对单位", 目标来源: "伤害来源", 下单归属: "中立敌对" },
    ],
  },
  {
    配置ID: "hit_react_lake_element",
    单位名: "|cff00ccff湖底元素|r|cffff0000(头目)LV22|r",
    特殊逻辑名: "湖底元素受击连招",
  },
  {
    配置ID: "hit_react_forest_wolf_king",
    单位名: "森林狼王",
    技能列表: [
      { 技能ID: "A08B", 施法方式: "对点", 目标来源: "伤害来源坐标", 下单归属: "中立敌对", 与伤害来源距离不大于: 200 },
    ],
  },
  {
    配置ID: "hit_react_zetu",
    单位名: "泽图（挑战boss）",
    技能列表: [
      { 命令字串: "fanofknives", 施法方式: "立即", 自身生命值不高于: 80, 与伤害来源距离不大于: 800 },
    ],
  },
  {
    配置ID: "hit_react_fire_phoenix",
    单位名: "火凤凰",
    技能列表: [
      { 技能ID: "A0FB", 施法方式: "对点", 目标来源: "伤害来源坐标", 下单归属: "中立敌对" },
    ],
  },
  {
    配置ID: "hit_react_crocodile",
    单位名: "沙沙果实能力者",
    技能列表: [
      { 技能ID: "A0FF", 施法方式: "对单位", 目标来源: "伤害来源", 下单归属: "中立敌对", 最低玩家人数: 2 },
    ],
  },
  {
    配置ID: "hit_react_shinra_clone",
    单位名: "复制体",
    特殊逻辑名: "神罗战士受击随机技能",
  },
  {
    配置ID: "hit_react_tenshi",
    单位名: "比那名居天子",
    特殊逻辑名: "比那名居天子受击随机技能",
  },
  {
    配置ID: "hit_react_water_tentacle",
    单位名: "|cff00ffff水触须|r|cffff0000（头目LV4）|r",
    特殊逻辑名: "水触须范围缠绕",
  },
  {
    配置ID: "hit_react_wonder_stag",
    单位名: "奇妙鹿|cffff0000（Boss，LV7）|r",
    特殊逻辑名: "奇妙鹿受击反制",
  },
  {
    配置ID: "hit_react_blood_orc",
    单位名: "塞阿尔",
    技能列表: [
      { 技能ID: "A0I5", 施法方式: "对单位", 目标来源: "伤害来源", 下单归属: "中立敌对" },
      { 技能ID: "A0I7", 施法方式: "立即", 下单归属: "中立敌对", 与伤害来源距离不大于: 750 },
    ],
  },
  {
    配置ID: "hit_react_spirit_poison_snake",
    单位名: "灵毒王蛇|cffff0000（Boss，LV20MAX）|r",
    特殊逻辑名: "灵毒王蛇受击连招",
  },
  {
    配置ID: "hit_react_slime",
    单位名: "史莱姆",
    技能列表: [
      { 技能ID: "A0IL", 施法方式: "立即", 下单归属: "中立敌对" },
    ],
  },
  {
    配置ID: "hit_react_gnoll_warden_base",
    单位名: "豺狼守望者",
    技能列表: [
      { 技能ID: "A02B", 施法方式: "对单位", 目标来源: "伤害来源", 下单归属: "中立敌对" },
    ],
  },
  {
    配置ID: "hit_react_gnoll_warden_mutant",
    单位名: "豺狼守望者|cffff00ff（异变LV8）|r",
    技能列表: [
      { 技能ID: "A02B", 施法方式: "对单位", 目标来源: "伤害来源", 下单归属: "中立敌对" },
      { 技能ID: "A0IH", 施法方式: "对单位", 目标来源: "伤害来源", 下单归属: "中立敌对" },
    ],
  },
  {
    配置ID: "hit_react_cult_swordsman",
    单位名: "教派剑士",
    技能列表: [
      { 命令字串: "whirlwind", 施法方式: "立即", 触发概率分子: 1, 触发概率分母: 5 },
    ],
  },
];
