/** @noSelfInFile */

import { 注册卡瑟拉深海涡流 } from "./03．深海涡流";
import { 注册卡瑟拉触手鞭笞 } from "./04．触手鞭笞";
import { 注册卡瑟拉墨汁喷吐 } from "./05．墨汁喷吐";
import { 注册卡瑟拉深渊召唤 } from "./06．深渊召唤";
import { 注册卡瑟拉高压水炮 } from "./07．高压水炮";
import { 注册卡瑟拉触手解放 } from "./08．触手解放";
import { 注册卡瑟拉共生电击 } from "./09．共生电击";
import { 注册卡瑟拉触手再生与残片 } from "./10．触手再生与残片";

export function 注册卡瑟拉技能结构(this: void): void {
  注册卡瑟拉深海涡流();
  注册卡瑟拉触手鞭笞();
  注册卡瑟拉墨汁喷吐();
  注册卡瑟拉深渊召唤();
  注册卡瑟拉高压水炮();
  注册卡瑟拉触手解放();
  注册卡瑟拉共生电击();
  注册卡瑟拉触手再生与残片();
}
