--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____05_FF0E_7D27_51D1_5267_60C5_7247_6BB5_7F16_8BD1 = require("系统.11．剧情系统.01．主线任务.00．剧情系统核心工具.05．紧凑剧情片段编译")
local _____7F16_8BD1_7D27_51D1_5267_60C5_7247_6BB5 = ____05_FF0E_7D27_51D1_5267_60C5_7247_6BB5_7F16_8BD1["编译紧凑剧情片段"]
____exports["王宫禁军盘查紧凑剧情片段"] = {
    ["片段ID"] = "elven_city_palace_guard",
    ["名称"] = "王宫禁军盘查",
    ["触发条件"] = "剧情进度 == 22 且玩家靠近王宫禁军门卫",
    ["可Esc整段跳过"] = true,
    ["默认倍速"] = 1,
    ["默认对白持续时间"] = 3,
    ["对白列表"] = {
        {["序号"] = 1, ["说话者"] = "玩家", ["文本"] = "克林姆德一脉至今仍保有昔日王族气象。这座宫殿的规模虽不及帝国正殿，古老术式却更加完整。想必与八位神明之一的|cffffcc99『初代克林姆德王』|r有关。", ["持续时间"] = 8},
        {["序号"] = 2, ["说话者"] = "精灵禁军", ["文本"] = "诸位便是帝国使者吧。门口守卫已通过术法传来消息。还请诸位出示门扉之印，以便通行。", ["持续时间"] = 5},
        {["序号"] = 3, ["说话者"] = "玩家", ["文本"] = "门扉之印在此，请查验。", ["持续时间"] = 3},
        {["序号"] = 4, ["说话者"] = "精灵禁军", ["文本"] = "印记无误。|cffffff00王上的主殿就在初代之王雕像右侧|r，我会提前传讯，请内庭侍卫为诸位放行。", ["持续时间"] = 5.2},
        {["序号"] = 5, ["说话者"] = "玩家", ["文本"] = "辛苦二位了。", ["持续时间"] = 2}
    },
    ["动作时间线"] = {{
        ["序号"] = 1,
        ["挂点"] = "beforeDialog",
        ["对白序号"] = 1,
        ["动作ID"] = "剧情.停止触发单位",
        ["名称"] = "盘查对白开始时停止触发单位",
        ["参数"] = {}
    }, {
        ["序号"] = 2,
        ["挂点"] = "afterDialog",
        ["对白序号"] = 5,
        ["跳过也执行"] = true,
        ["动作ID"] = "JLC精灵城_王宫禁军盘查收尾",
        ["名称"] = "盘查完成后开启王宫外庭视野",
        ["参数"] = {}
    }, {
        ["序号"] = 3,
        ["挂点"] = "afterDialog",
        ["对白序号"] = 5,
        ["跳过也执行"] = true,
        ["动作ID"] = "主线.进入节点",
        ["名称"] = "王宫盘查后刷新觐见目标",
        ["参数"] = {["节点进度"] = 23}
    }}
}
____exports["王宫禁军盘查剧情片段"] = _____7F16_8BD1_7D27_51D1_5267_60C5_7247_6BB5(____exports["王宫禁军盘查紧凑剧情片段"])
return ____exports
