--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____05_FF0E_7D27_51D1_5267_60C5_7247_6BB5_7F16_8BD1 = require("系统.11．剧情系统.01．主线任务.00．剧情系统核心工具.05．紧凑剧情片段编译")
local _____7F16_8BD1_7D27_51D1_5267_60C5_7247_6BB5 = ____05_FF0E_7D27_51D1_5267_60C5_7247_6BB5_7F16_8BD1["编译紧凑剧情片段"]
____exports["王宫门卫支线发现紧凑剧情片段"] = {
    ["片段ID"] = "elven_city_side_quest_discover",
    ["名称"] = "王宫门卫支线发现",
    ["触发条件"] = "剧情进度 == 23 且玩家靠近王宫门卫2",
    ["可Esc整段跳过"] = true,
    ["默认倍速"] = 1,
    ["默认对白持续时间"] = 3,
    ["对白列表"] = {{["序号"] = 1, ["说话者"] = "玩家", ["文本"] = "这便是初代克林姆德王的雕像……传说中八位神明之一。仅是残留在石像中的气息，便已如此沉重。帝国对这位远古精灵王记载不多，之后或许可以去|cffffcc99『克林姆德书库』|r查阅一番。", ["持续时间"] = 10}},
    ["动作时间线"] = {{
        ["序号"] = 1,
        ["挂点"] = "beforeDialog",
        ["对白序号"] = 1,
        ["动作ID"] = "剧情.停止触发单位",
        ["名称"] = "王宫门卫2支线观察前停止触发单位",
        ["参数"] = {}
    }, {
        ["序号"] = 2,
        ["挂点"] = "beforeDialog",
        ["对白序号"] = 1,
        ["动作ID"] = "主线.写入进度",
        ["名称"] = "进入雕像观察节点",
        ["参数"] = {["节点进度"] = 24}
    }, {
        ["序号"] = 3,
        ["挂点"] = "afterDialog",
        ["对白序号"] = 1,
        ["动作ID"] = "JLC精灵城_王宫门卫2支线发现",
        ["名称"] = "王宫门卫2支线发现",
        ["参数"] = {["支线任务"] = "udg_RW[8]", ["旧JASS功能清单"] = "QuestSetDiscovered / QuestMessageBJ(DISCOVERED)"}
    }}
}
____exports["王宫门卫支线发现剧情片段"] = _____7F16_8BD1_7D27_51D1_5267_60C5_7247_6BB5(____exports["王宫门卫支线发现紧凑剧情片段"])
return ____exports
