--[[ Generated with https://github.com/TypeScriptToLua/TypeScriptToLua ]]
local ____exports = {}
local ____05_FF0E_7D27_51D1_5267_60C5_7247_6BB5_7F16_8BD1 = require("系统.11．剧情系统.01．主线任务.00．剧情系统核心工具.05．紧凑剧情片段编译")
local _____7F16_8BD1_7D27_51D1_5267_60C5_7247_6BB5 = ____05_FF0E_7D27_51D1_5267_60C5_7247_6BB5_7F16_8BD1["编译紧凑剧情片段"]
____exports["第二章王子Boss战过程紧凑剧情片段"] = {
    ["片段ID"] = "elven_city_prince_boss_start",
    ["名称"] = "第二章王子Boss战过程",
    ["触发条件"] = "剧情进度 == 33 且玩家靠近克林姆德王",
    ["可Esc整段跳过"] = true,
    ["默认倍速"] = 1,
    ["默认对白持续时间"] = 3,
    ["对白列表"] = {
        {["序号"] = 1, ["说话者"] = "耶提尔", ["文本"] = "这是怎么回事？竟有人杀入了王宫？！陛下呢？", ["持续时间"] = 5},
        {["序号"] = 2, ["说话者"] = "艾伦", ["文本"] = "老伙计，还有诸位帝国使者。方才|cffff0000『里科特王子』|r不知动用了什么术法，竟强行突破王宫禁制，凭借自身血脉之力打开了传承密室的大门。", ["持续时间"] = 8},
        {["序号"] = 3, ["说话者"] = "耶提尔", ["文本"] = "什么？那陛下呢？赫克提尔呢？", ["持续时间"] = 4},
        {["序号"] = 4, ["说话者"] = "艾伦", ["文本"] = "陛下与赫克提尔长老传出一声支援讯息后，便再无回应。", ["持续时间"] = 5},
        {["序号"] = 5, ["说话者"] = "里凡特", ["文本"] = "诸位帝国使者，耶提尔叔叔，事不宜迟，还请各位与我一同进入密室，查明情况。可以吗？", ["持续时间"] = 6},
        {["序号"] = 6, ["说话者"] = "众人", ["文本"] = "我等自然不会推辞。现在便出发吧。", ["持续时间"] = 3},
        {["序号"] = 7, ["说话者"] = "里凡特", ["文本"] = "初代克林姆德王，|cffffcc99『里特菲尔·克林姆德』|r。您的直系后代，|cffffcc99『里凡特·克林姆德』|r，以血脉之力相印证，开启同向起源之门。", ["持续时间"] = 8},
        {["序号"] = 8, ["说话者"] = "耶提尔", ["文本"] = "里克特！！你这小子干了什么！", ["持续时间"] = 4},
        {["序号"] = 9, ["说话者"] = "里科特", ["文本"] = "耶提尔叔叔，我不过是回来取一件原本就属于我的东西而已。", ["持续时间"] = 5},
        {["序号"] = 10, ["说话者"] = "耶提尔", ["文本"] = "你这个克林姆德族的败类、叛徒！你还有脸说什么\"你的东西\"！？", ["持续时间"] = 5},
        {["序号"] = 11, ["说话者"] = "里科特", ["文本"] = "这几位，想必就是帝国的使者了吧。在下|cffff0000『里科特』|r，如今忝任|cffff00ff『分离教派』第六主教|r。哦，对了，差点忘了，还有我那不成器的弟弟。就你这点本事，也配坐第一王子的位置？真是可笑。", ["持续时间"] = 10},
        {["序号"] = 12, ["说话者"] = "里凡特", ["文本"] = "哥哥，我配不配，不是由你来定的，而是由诸位长辈与父王来定。你现在立刻交出圣物与钥匙，尚且还有转圜余地。", ["持续时间"] = 7},
        {["序号"] = 13, ["说话者"] = "玩家", ["文本"] = "里科特，交出东西。", ["持续时间"] = 3},
        {["序号"] = 14, ["说话者"] = "里科特", ["文本"] = "算了，看来不让你们见识一下真正的力量，你们是不会闭嘴了。既然如此，我便陪你们稍稍玩上一会。", ["持续时间"] = 7}
    },
    ["动作时间线"] = {{
        ["序号"] = 1,
        ["挂点"] = "beforeDialog",
        ["对白序号"] = 1,
        ["动作ID"] = "JLC精灵城_第二章王子Boss战前置",
        ["名称"] = "第二章王子Boss战前置",
        ["参数"] = {["触发进度"] = 33, ["目标进度"] = 34, ["触发单位发布命令"] = "stop", ["任务更新提示"] = "|cffffff00『主线目标』：|r击败里科特"}
    }, {
        ["序号"] = 2,
        ["挂点"] = "afterDialog",
        ["对白序号"] = 14,
        ["动作ID"] = "startBossFight",
        ["名称"] = "启动里科特王子Boss战",
        ["参数"] = {["Boss名"] = "里科特王子"}
    }}
}
____exports["第二章王子Boss战过程剧情片段"] = _____7F16_8BD1_7D27_51D1_5267_60C5_7247_6BB5(____exports["第二章王子Boss战过程紧凑剧情片段"])
return ____exports
